<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读书笔记," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="这是第一本我刚看完书评就想写些什么的书，读书在于感悟，而悟道却往往在一瞬之间。以
前看很多书，老觉得作者说的也不过尔尔，现在想来是自己的功力不够，还体会不到作者想
要表达的意思。之前看书过于贪功，喜欢规定自己在一段时间段内一定要看完某一本书，现
在想想觉得可笑，快速读完但是内化不了的书不看也罢。这是一本我看了很久才看完的书，
但是我现在还是不敢说自己读懂了它，这本薄薄的书中内容太过于丰富，我想我的">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《程序员修炼之道》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/01/25/the-pragmatic-programmer-book-note/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="这是第一本我刚看完书评就想写些什么的书，读书在于感悟，而悟道却往往在一瞬之间。以
前看很多书，老觉得作者说的也不过尔尔，现在想来是自己的功力不够，还体会不到作者想
要表达的意思。之前看书过于贪功，喜欢规定自己在一段时间段内一定要看完某一本书，现
在想想觉得可笑，快速读完但是内化不了的书不看也罢。这是一本我看了很久才看完的书，
但是我现在还是不敢说自己读懂了它，这本薄薄的书中内容太过于丰富，我想我的">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《程序员修炼之道》">
<meta name="twitter:description" content="这是第一本我刚看完书评就想写些什么的书，读书在于感悟，而悟道却往往在一瞬之间。以
前看很多书，老觉得作者说的也不过尔尔，现在想来是自己的功力不够，还体会不到作者想
要表达的意思。之前看书过于贪功，喜欢规定自己在一段时间段内一定要看完某一本书，现
在想想觉得可笑，快速读完但是内化不了的书不看也罢。这是一本我看了很久才看完的书，
但是我现在还是不敢说自己读懂了它，这本薄薄的书中内容太过于丰富，我想我的">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/01/25/the-pragmatic-programmer-book-note/"/>





  <title> 读书札记之 —— 《程序员修炼之道》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/01/25/the-pragmatic-programmer-book-note/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《程序员修炼之道》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-01-25T15:38:09+08:00">
                2016-01-25
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x672C;&#x6211;&#x521A;&#x770B;&#x5B8C;&#x4E66;&#x8BC4;&#x5C31;&#x60F3;&#x5199;&#x4E9B;&#x4EC0;&#x4E48;&#x7684;&#x4E66;&#xFF0C;&#x8BFB;&#x4E66;&#x5728;&#x4E8E;&#x611F;&#x609F;&#xFF0C;&#x800C;&#x609F;&#x9053;&#x5374;&#x5F80;&#x5F80;&#x5728;&#x4E00;&#x77AC;&#x4E4B;&#x95F4;&#x3002;&#x4EE5;&#x524D;&#x770B;&#x5F88;&#x591A;&#x4E66;&#xFF0C;&#x8001;&#x89C9;&#x5F97;&#x4F5C;&#x8005;&#x8BF4;&#x7684;&#x4E5F;&#x4E0D;&#x8FC7;&#x5C14;&#x5C14;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x6765;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x529B;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x4F53;&#x4F1A;&#x4E0D;&#x5230;&#x4F5C;&#x8005;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x3002;&#x4E4B;&#x524D;&#x770B;&#x4E66;&#x8FC7;&#x4E8E;&#x8D2A;&#x529F;&#xFF0C;&#x559C;&#x6B22;&#x89C4;&#x5B9A;&#x81EA;&#x5DF1;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x4E00;&#x5B9A;&#x8981;&#x770B;&#x5B8C;&#x67D0;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x89C9;&#x5F97;&#x53EF;&#x7B11;&#xFF0C;&#x5FEB;&#x901F;&#x8BFB;&#x5B8C;&#x4F46;&#x662F;&#x5185;&#x5316;&#x4E0D;&#x4E86;&#x7684;&#x4E66;&#x4E0D;&#x770B;&#x4E5F;&#x7F62;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x6211;&#x770B;&#x4E86;&#x5F88;&#x4E45;&#x624D;&#x770B;&#x5B8C;&#x7684;&#x4E66;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x4E0D;&#x6562;&#x8BF4;&#x81EA;&#x5DF1;&#x8BFB;&#x61C2;&#x4E86;&#x5B83;&#xFF0C;&#x8FD9;&#x672C;&#x8584;&#x8584;&#x7684;&#x4E66;&#x4E2D;&#x5185;&#x5BB9;&#x592A;&#x8FC7;&#x4E8E;&#x4E30;&#x5BCC;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x7684;&#x8D44;&#x8D28;&#x8FD8;&#x662F;&#x5DEE;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5929;&#x5916;&#x6709;&#x5929;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x597D;&#x8FDC;&#x7684;&#x8DEF;&#x8981;&#x8D70;&#x3002;</p>
<a id="more"></a>
<h1 id="wu-dao-can-shan">&#x609F;&#x9053;&#x53C2;&#x7985;</h1>
<p>&#x8001;&#x5B50;&#x8BF4;&#xFF1A;&#x201C;&#x9053;&#x6CD5;&#x672F;&#x5668;&#x201D;&#xFF0C;&#x8FD9;&#x662F;&#x8FDB;&#x5B66;&#x7684;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#xFF0C;&#x5E02;&#x9762;&#x4E0A;&#x7684;&#x597D;&#x4E66;&#x4E5F;&#x6709;&#x5206;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#x3002;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5BF9;&#x4E8E;<code>C++</code>&#x5B66;&#x4E60;&#x6765;&#x8BF4;&#x300A;Vim &#x5B9E;&#x7528;&#x6280;&#x5DE7;&#x300B;&#x5C5E;&#x4E8E;&#x5668;&#x8FD9;&#x4E00;&#x7EA7;&#x522B;&#x7684;&#x4E66;&#xFF0C;&#x8BFB;&#x8FD9;&#x6837;&#x7684;&#x4E66;&#x6709;&#x52A9;&#x4E8E;&#x201C;&#x5229;&#x5668;&#x201D;&#xFF1B;&#x300A;C++ Primer&#x300B;&#x5C5E;&#x4E8E;&#x672F;&#x8FD9;&#x4E00;&#x7EA7;&#x522B;&#x7684;&#x4E66;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7684;C++&#x6280;&#x672F;&#xFF1B;&#x300A;Effective C++&#x300B;&#x5C5E;&#x4E8E;&#x6CD5;&#x8FD9;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x4E66;&#xFF0C;&#x8BFB;&#x8FD9;&#x4E00;&#x7C7B;&#x7684;&#x4E66;&#x6709;&#x52A9;&#x4E8E;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x4F18;&#x96C5;&#x7684;&#x4F7F;&#x7528;C++&#x6280;&#x672F;&#xFF1B;&#x300A;&#x7A0B;&#x5E8F;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x8FD9;&#x6837;&#x7684;&#x4E66;&#x5219;&#x662F;&#x5C5E;&#x4E8E;&#x9053;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#x4E66;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x8D85;&#x8131;&#x4E8E;&#x8BED;&#x8A00;&#xFF0C;&#x6307;&#x5BFC;&#x4E2A;&#x4EBA;&#x4FEE;&#x517B;&#x7684;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8BD1;&#x540D;&#x975E;&#x5E38;&#x7684;&#x70C2;&#x4FD7;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x8BD1;&#x8005;&#x6DF1;&#x5F97;&#x5176;&#x4E2D;&#x7684;&#x7CBE;&#x9AD3;&#xFF0C;&#x6B63;&#x5982;&#x6CE8;&#x91CD;&#x65F6;&#x6548;&#x7684;&#x56E2;&#x961F;&#x4E00;&#x7AE0;&#x6240;&#x8A00;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5927;&#x90E8;&#x5206;&#x662F;&#x6559;&#x4F60;&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x9700;&#x8981;&#x6162;&#x6162;&#x611F;&#x609F;&#x7684;&#x4E66;&#xFF0C;&#x609F;&#x9053;&#x53C2;&#x7985;&#xFF0C;&#x5F97;&#x9053;&#x8005;&#x53EF;&#x4EE5;&#x6210;&#x4ED9;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x5F97;&#x9053;&#x8005;&#x80FD;&#x591F;&#x6210;&#x795E;&#xFF0C;&#x5927;&#x5BB6;&#x5FC3;&#x4E2D;&#x7684;<code>&#x5927;&#x795E;</code>&#x3002;</p>
<h1 id="kan-bu-dong-de-zhang-jie">&#x770B;&#x4E0D;&#x61C2;&#x7684;&#x7AE0;&#x8282;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x6211;&#x6709;&#x5F88;&#x591A;&#x7AE0;&#x8282;&#x90FD;&#x770B;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x767D;&#xFF0C;&#x6BD4;&#x5982;<code>&#x9886;&#x57DF;&#x8BED;&#x8A00;</code>&#xFF0C;&#x6211;&#x867D;&#x7136;&#x4E5F;&#x63A5;&#x89E6;&#x8FC7;<code>Qt</code>&#x4E2D;&#x7684;<code>qrc</code>
&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x771F;&#x6B63;&#x7684;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;<code>&#x9886;&#x57DF;&#x8BED;&#x8A00;</code>&#xFF0C;&#x6BD5;&#x7ADF;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x5F00;&#x53D1;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x8FD8;&#x592A;&#x8FC7;&#x4E8E;&#x9065;&#x8FDC;&#x3002;</p>
<p>&#x53C8;&#x6BD4;&#x5982;<code>&#x4F30;&#x7B97;</code>&#x4E00;&#x8282;&#x8C08;&#x5982;&#x4F55;&#x5B66;&#x4F1A;&#x4F30;&#x7B97;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x53EF;&#x884C;&#x6027;&#x7684;&#x4E00;&#x79CD;&#x5929;&#x7136;&#x7684;&#x76F4;&#x89C9;&#x3002;&#x4F5C;&#x8005;&#x867D;&#x7136;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7BC7;&#x5E45;&#x5728;&#x5199;&#x5982;&#x4F55;&#x4F30;&#x7B97;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7406;&#x89E3;&#x5176;&#x4E2D;&#x7684;&#x5965;&#x5999;&#x4E4B;&#x6240;&#x5728;&#x3002;</p>
<p>&#x518D;&#x6BD4;&#x5982;<code>&#x9ED1;&#x677F;</code>&#x8FD9;&#x4E00;&#x4E2A;&#x7AE0;&#x8282;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x79CD;&#x751F;&#x4EA7;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x4E4B;&#x95F4;&#x4E00;&#x79CD;&#x90A3;&#x4E2A;&#x533F;&#x540D;&#x3001;&#x5F02;&#x6B65;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x542C;&#x8BF4;&#x8FC7;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6CA1;&#x6709;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x4E66;&#x4E2D;&#x770B;&#x8FC7;&#x76F8;&#x5173;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6211;&#x5F88;&#x52AA;&#x529B;&#x7684;&#x5C1D;&#x8BD5;&#x7406;&#x89E3;&#x4F5C;&#x8005;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x6280;&#x672F;&#x5374;&#x4F9D;&#x7136;&#x5F88;&#x96BE;&#x638C;&#x63E1;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x5730;&#x65B9;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x65E5;&#x540E;&#x529F;&#x529B;&#x89C1;&#x957F;&#x4E4B;&#x540E;&#x80FD;&#x591F;&#x9886;&#x609F;&#x5230;&#x4F5C;&#x8005;&#x4F20;&#x8FBE;&#x7684;&#x6DF1;&#x610F;&#x3002;</p>
<h1 id="zi-wo-xiu-yang">&#x81EA;&#x6211;&#x4FEE;&#x517B;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x90FD;&#x5728;&#x8C08;&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6BD4;&#x5982;&#x4E66;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x63D0;&#x793A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x6761;&#x63D0;&#x793A;&#xFF1A;</p>
<blockquote>
<p>Care About Youre Craft &#x2014;&#x2014; &#x5173;&#x5FC3;&#x4F60;&#x7684;&#x6280;&#x827A;</p>
</blockquote>
<blockquote>
<p>Sign Your Work &#x2014;&#x2014; &#x5728;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x4E0A;&#x7B7E;&#x540D;</p>
</blockquote>
<p>&#x9996;&#x5C3E;&#x547C;&#x5E94;&#x8BED;&#x91CD;&#x5FC3;&#x957F;&#x7684;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8981;&#x63D0;&#x9AD8;&#x81EA;&#x8EAB;&#x7684;&#x4FEE;&#x517B;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x8D1F;&#x8D23;&#xFF0C;&#x4E5F;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x611F;&#x5230;&#x9A84;&#x50B2;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x4EE4;&#x6211;&#x611F;&#x89E6;&#x6700;&#x6DF1;&#x7684;&#x662F;&#x4E24;&#x4F4D;&#x4F5C;&#x8005;&#x8EAB;&#x4E0A;&#x6D53;&#x6D53;&#x7684;&#x5DE5;&#x5320;&#x60C5;&#x6000;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F3A;&#x8C03;&#x7A0B;&#x5E8F;&#x5458;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x548C;&#x4FEE;&#x70BC;&#xFF0C;&#x4ED6;&#x4EEC;&#x751A;&#x81F3;&#x5355;&#x72EC;&#x5199;&#x4E86;&#x4E00;&#x7AE0;<code>&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x8D44;&#x4EA7;</code>&#x544A;&#x8BEB;&#x6211;&#x4EEC;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x9644;&#x5F55;&#x5F15;&#x7528;&#x548C;&#x53C2;&#x8003;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4E66;&#x7C4D;&#x548C;&#x7F51;&#x4E0A;&#x8D44;&#x6E90;&#xFF0C;&#x8DB3;&#x4EE5;&#x89C1;&#x5F97;&#x4E24;&#x4F4D;&#x4F5C;&#x8005;&#x81EA;&#x8EAB;&#x7684;&#x535A;&#x5B66;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x4F5C;&#x8005;&#x4EEC;&#x548C;&#x5B54;&#x5B50;&#x7684;<code>&#x5B66;&#x800C;&#x65F6;&#x4E60;&#x4E4B;</code>&#x7684;&#x601D;&#x60F3;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x81F3;&#x7684;&#x3002;</p>
<h1 id="jin-yi-bu-xue-xi">&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;</h1>
<p>&#x8981;&#x5B66;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#xFF0C;&#x4ECE;&#x5668;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x6211;&#x81F3;&#x5C11;&#x8FD8;&#x9700;&#x8981;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;</p>
<ul>
<li>
<p>&#x4E00;&#x95E8;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF08;&#x504F;&#x5411;&#x4E8E; Python&#xFF09;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6587;&#x672C;&#x5904;&#x7406;&#x3001;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x3001;&#x6D4B;&#x8BD5;&#x3001;&#x81EA;&#x52A8;&#x5316;&#x7B49;&#x65B9;&#x9762;&#x5B83;&#x90FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7528;&#x9014;&#x3002;</p>
</li>
<li>
<p>VimL&#xFF0C;&#x5B66;&#x4F1A;&#x6269;&#x5145;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5B8C;&#x6210;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
</li>
<li>
<p>GDB&#x3001;DDD &#x7B49;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x5B66;&#x4F1A;&#x6709;&#x6548;&#x7684;&#x8C03;&#x8BD5;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
<li>
<p>Git&#xFF0C;&#x6211;&#x867D;&#x7136;&#x77E5;&#x9053;&#x57FA;&#x672C;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5374;&#x5E76;&#x4E0D;&#x719F;&#x6089;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x7CBE;&#x901A;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x7BA1;&#x7406;&#x5668;&#x3002;</p>
</li>
<li>
<p>doxygen &#x6587;&#x6863;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x8FD9;&#x662F;<code>&#x5168;&#x90E8;&#x662F;&#x5199;</code>&#x5F97;&#x4EE5;&#x5728;C++&#x4E2D;&#x5B9E;&#x8DF5;&#x7684;&#x91CD;&#x70B9;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
<li>
<p>H5&#x3001;CSS3&#xFF0C;&#x4F7F;&#x7528; Web &#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x5E03;&#x6587;&#x6863;&#x662F;&#x6700;&#x4F73;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x81F3;&#x5C11;&#x5B83;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x66F4;&#x884C;&#x3002;</p>
</li>
<li>
<p>Autotool&#x3001;CMake&#x3001;cron&#xFF0C;&#x8FD9;&#x4E9B;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x3002;</p>
</li>
<li>
<p>&#x5B66;&#x4F1A;&#x4E00;&#x4E2A; profiler&#xFF0C;&#x53EF;&#x9009;&#x7684;&#x5DE5;&#x5177;&#x6709;gprof&#xFF0C;oprofile&#xFF0C;zoom&#xFF0C;pref&#xFF0C;pstack&#xFF0C;Valgrind</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x94FE;&#x63A5;&#xFF1A;</p>
<p><a href="http://stackoverflow.com/questions/1168766/what-is-a-good-easy-to-use-profiler-for-c-on-linux" target="_blank" rel="external">What is a good easy to use profiler for C++ on Linux</a><br>
<a href="http://stackoverflow.com/questions/375913/what-can-i-use-to-profile-c-code-in-linux" target="_blank" rel="external">What can I use to profile C++ code in Linux</a><br>
<a href="http://stackoverflow.com/questions/1875167/performance-profiling-on-linux" target="_blank" rel="external">Performance profiling on Linux</a><br>
<a href="http://stackoverflow.com/questions/1777556/alternatives-to-gprof" target="_blank" rel="external">Alternatives to gprof</a><br>
<a href="http://stackoverflow.com/questions/2497211/how-to-profile-multi-threaded-c-application-on-linux" target="_blank" rel="external">How to profile multi-threaded C++ application on Linux</a></p>
</li>
</ul>
<p>&#x8DEF;&#x6F2B;&#x6F2B;&#x5176;&#x4FEE;&#x8FDC;&#x516E;&#xFF0C;&#x543E;&#x5C06;&#x4E0A;&#x4E0B;&#x800C;&#x6C42;&#x7D22;&#xFF0C;&#x52A0;&#x6CB9;&#xFF01;&#xFF01;&#xFF01;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/01/25/more-effective-cpp-note/" rel="next" title="读书札记之 —— 《More Effective C++》">
                <i class="fa fa-chevron-left"></i> 读书札记之 —— 《More Effective C++》
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/02/05/cpp-gurues-blogs/" rel="prev" title="C++ 学习资源的汇总">
                C++ 学习资源的汇总 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">82</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#wu-dao-can-shan"><span class="nav-number">1.</span> <span class="nav-text">悟道参禅</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#kan-bu-dong-de-zhang-jie"><span class="nav-number">2.</span> <span class="nav-text">看不懂的章节</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#zi-wo-xiu-yang"><span class="nav-number">3.</span> <span class="nav-text">自我修养</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#jin-yi-bu-xue-xi"><span class="nav-number">4.</span> <span class="nav-text">进一步学习</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
