<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读书笔记,设计模式," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="刚开始接触面向对象编程的时候觉得封装是它最大的优点，毕竟相对于面向过程编程来
说，数据和操作数据的行为封装在一起给人耳目一新的感觉。随着编程经验和阅历的增长，
我开始觉得继承和多态才是面向对象最大的优势，运行时绑定的魔力太过于惊人。后来
我去看了设计模式，我又觉得组合才是面向对象编程的精髓之所在，面向接口而不面向
实现编程才是复用的王道。我知道有一天当我功力渐长之后，回过头来想这个问题的时候我
还">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《设计模式》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/01/03/design-patterns-note/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="刚开始接触面向对象编程的时候觉得封装是它最大的优点，毕竟相对于面向过程编程来
说，数据和操作数据的行为封装在一起给人耳目一新的感觉。随着编程经验和阅历的增长，
我开始觉得继承和多态才是面向对象最大的优势，运行时绑定的魔力太过于惊人。后来
我去看了设计模式，我又觉得组合才是面向对象编程的精髓之所在，面向接口而不面向
实现编程才是复用的王道。我知道有一天当我功力渐长之后，回过头来想这个问题的时候我
还">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《设计模式》">
<meta name="twitter:description" content="刚开始接触面向对象编程的时候觉得封装是它最大的优点，毕竟相对于面向过程编程来
说，数据和操作数据的行为封装在一起给人耳目一新的感觉。随着编程经验和阅历的增长，
我开始觉得继承和多态才是面向对象最大的优势，运行时绑定的魔力太过于惊人。后来
我去看了设计模式，我又觉得组合才是面向对象编程的精髓之所在，面向接口而不面向
实现编程才是复用的王道。我知道有一天当我功力渐长之后，回过头来想这个问题的时候我
还">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/01/03/design-patterns-note/"/>





  <title> 读书札记之 —— 《设计模式》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/01/03/design-patterns-note/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《设计模式》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-01-03T13:34:12+08:00">
                2016-01-03
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x89C9;&#x5F97;<strong>&#x5C01;&#x88C5;</strong>&#x662F;&#x5B83;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x6BD5;&#x7ADF;&#x76F8;&#x5BF9;&#x4E8E;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x7684;&#x884C;&#x4E3A;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#x7ED9;&#x4EBA;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#x7684;&#x611F;&#x89C9;&#x3002;&#x968F;&#x7740;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x548C;&#x9605;&#x5386;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x89C9;&#x5F97;&#x7EE7;&#x627F;&#x548C;<strong>&#x591A;&#x6001;</strong>&#x624D;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x7ED1;&#x5B9A;&#x7684;&#x9B54;&#x529B;&#x592A;&#x8FC7;&#x4E8E;&#x60CA;&#x4EBA;&#x3002;&#x540E;&#x6765;&#x6211;&#x53BB;&#x770B;&#x4E86;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x53C8;&#x89C9;&#x5F97;<strong>&#x7EC4;&#x5408;</strong>&#x624D;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x7CBE;&#x9AD3;&#x4E4B;&#x6240;&#x5728;&#xFF0C;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x800C;&#x4E0D;&#x9762;&#x5411;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#x624D;&#x662F;&#x590D;&#x7528;&#x7684;&#x738B;&#x9053;&#x3002;&#x6211;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x5929;&#x5F53;&#x6211;&#x529F;&#x529B;&#x6E10;&#x957F;&#x4E4B;&#x540E;&#xFF0C;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x60F3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6211;&#x4E5F;&#x671F;&#x5F85;&#x90A3;&#x4E00;&#x5929;&#x5FEB;&#x70B9;&#x5230;&#x6765;&#x3002;</p>
<a id="more"></a>
<h1 id="guan-yu-zhe-ben-shu-de-fan-yi">&#x5173;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7FFB;&#x8BD1;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x4E2D;&#x6587;&#x7248;&#x53C2;&#x4E0E;&#x7FFB;&#x8BD1;&#x7684;&#x4EBA;&#x975E;&#x5E38;&#x7684;&#x591A;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x8D28;&#x91CF;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#x3002;&#x603B;&#x4F53;&#x611F;&#x89C9;&#x7ED3;&#x6784;&#x6A21;&#x5F0F;&#x548C;&#x884C;&#x4E3A;&#x6A21;&#x5F0F;&#x4E24;&#x4E2A;&#x7AE0;&#x8282;&#x8981;&#x6BD4;&#x521B;&#x5EFA;&#x6A21;&#x5F0F;&#x4E00;&#x7AE0;&#x7FFB;&#x8BD1;&#x7684;&#x5230;&#x4F4D;&#x4E00;&#x4E9B;&#x3002;&#x4E0D;&#x8FC7;&#x7455;&#x4E0D;&#x63A9;&#x745C;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7FFB;&#x8BD1;&#x8FD8;&#x7B97;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4E2A;&#x4EBA;&#x63A8;&#x8350;&#x5728;&#x770B;&#x4E2D;&#x6587;&#x8BD1;&#x672C;&#x7684;&#x65F6;&#x5019;&#x5907;&#x4E00;&#x672C;&#x82F1;&#x6587;&#x539F;&#x672C;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x901A;&#x987A;&#x7684;&#x5730;&#x65B9;&#x90A3;&#x4E2A;&#x53C2;&#x8003;&#x82F1;&#x6587;&#x539F;&#x672C;&#xFF0C;&#x4E86;&#x89E3;&#x4F5C;&#x8005;&#x7684;&#x539F;&#x610F;&#x3002;</p>
<h1 id="san-si-er-hou-xing">&#x4E09;&#x601D;&#x800C;&#x540E;&#x884C;</h1>
<p>&#x8BFB;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x4E86;&#x300A;Effective C++&#x300B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6761;&#x6B3E;&#xFF1A;&#x8003;&#x8651;&#x865A;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x9009;&#x62E9;&#x3002;&#x5176;&#x5B9E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x53C8;&#x975E;&#x5E38;&#x7684;&#x591A;&#x7684;&#x89E3;&#x6CD5;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#xFF0C;&#x800C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x90FD;&#x6CA1;&#x60F3;&#x5C31;&#x9009;&#x62E9;&#x4E86;&#x865A;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x901A;&#x5E38;&#x6BD4;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x5F0F;&#x8981;&#x7B80;&#x5355;&#x8BB8;&#x591A;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x8F83;&#x4E3A;&#x7075;&#x6D3B;&#x7684;&#x89E3;&#x6CD5;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x89E3;&#x6CD5;&#x3002;&#x539F;&#x6765;&#x7684;&#x6211;&#x5728;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x91CD;&#x6765;&#x4E0D;&#x505A;&#x8BBE;&#x8BA1;&#xFF0C;&#x603B;&#x662F;&#x8DDF;&#x968F;&#x81EA;&#x5DF1;&#x7684;&#x60F0;&#x6027;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x76EE;&#x524D;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FC7;&#x5176;&#x4ED6;&#x89E3;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x6EE1;&#x8DB3;&#x4E0E;&#x76EE;&#x524D;&#x4E0D;&#x4F18;&#x96C5;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x5F0F;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x8BFB;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x6700;&#x60F3;&#x5BF9;&#x81EA;&#x5DF1;&#x8BF4;&#xFF1A;&#x4E09;&#x601D;&#x800C;&#x540E;&#x884C;&#x3002;&#x5728;&#x505A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4F60;&#x89C9;&#x5F97;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x51B3;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x66F4;&#x52A0;&#x5408;&#x7406;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h1 id="wen-gu-er-zhi-xin">&#x6E29;&#x6545;&#x800C;&#x77E5;&#x65B0;</h1>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x7ECF;&#x9A8C;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x6E29;&#x6545;&#x800C;&#x77E5;&#x65B0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x529B;&#xFF0C;&#x66F4;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x505A;&#x4E8B;&#x7684;&#x6001;&#x5EA6;&#x3002;&#x5F53;&#x4ECA;&#x7684;&#x8F6F;&#x4EF6;&#x754C;&#xFF0C;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x5171;&#x4EA7;&#x4E3B;&#x4E49;&#x65F6;&#x4EE3;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x80FD;&#x591F;&#x60F3;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x5DF2;&#x7ECF;&#x6709;&#x76F8;&#x5173;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#x5B66;&#x4E60;&#x90A3;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x662F;&#x8FDB;&#x6B65;&#x7684;&#x7EDD;&#x4F73;&#x9014;&#x5F84;&#xFF0C;&#x5C31;&#x50CF;&#x300A;&#x9ED1;&#x5BA2;&#x4E8E;&#x753B;&#x5BB6;&#x300B;&#x4E2D;&#x8BF4;&#x5230;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x4E34;&#x6479;&#x548C;&#x89C2;&#x5BDF;&#x5927;&#x5E08;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x5927;&#x5E08;&#x3002;</p>
<p>&#x6B64;&#x5916;&#x603B;&#x7ED3;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x628A;&#x522B;&#x4EBA;&#x7CBE;&#x6E5B;&#x7684;&#x6280;&#x5DE7;&#x5185;&#x5316;&#x6210;&#x81EA;&#x5DF1;&#x529F;&#x529B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x771F;&#x6B63;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x5B66;&#x4E86;&#x5FD8;&#x3001;&#x5FD8;&#x4E86;&#x5B66;&#x7684;&#x5FAA;&#x73AF;&#x53EA;&#x662F;&#x5728;&#x6D6A;&#x8D39;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x800C;&#x5DF2;&#x3002;</p>
<h1 id="jian-jie-xing">&#x95F4;&#x63A5;&#x6027;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x63D0;&#x5230;&#x4E86; 23 &#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x95F4;&#x63A5;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x81F3;&#x7406;&#x540D;&#x8A00;&#xFF1A;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x4E2D;&#x95F4;&#x5C42;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x4E5F;&#x8BB8;&#x6709;&#x4E00;&#x5929;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x95F4;&#x63A5;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x89E3;&#x51B3;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x89E3;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x4E00;&#x5929;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<h1 id="mo-shi-gan-wu">&#x6A21;&#x5F0F;&#x611F;&#x609F;</h1>
<p>&#x6211;&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x8BFB;&#x4E66;&#x5728;&#x4E8E;&#x611F;&#x609F;&#xFF0C;&#x8BFB;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x6709;&#x975E;&#x5E38;&#x591A;&#x7684;&#x611F;&#x609F;&#xFF0C;&#x6211;&#x5728;&#x4E66;&#x4E0A;&#x5199;&#x4E86;&#x5BC6;&#x5BC6;&#x9EBB;&#x9EBB;&#x7684;&#x5404;&#x79CD;&#x7B14;&#x8BB0;&#x3002;&#x6B63;&#x5982;&#x4F5C;&#x8005;&#x6240;&#x8A00;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x5728;&#x7B2C;&#x4E00;&#x904D;&#x770B;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8BFB;&#x61C2;&#x6240;&#x6709;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x73B0;&#x5728;&#x81EA;&#x4EE5;&#x4E3A;&#x662F;&#x5BF9;&#x4F5C;&#x8005;&#x89C2;&#x70B9;&#x7684;&#x6CE8;&#x89E3;&#x7684;&#x5404;&#x79CD;&#x7B14;&#x8BB0;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x5BF9;&#x4E8E;&#x4F5C;&#x8005;&#x7684;&#x89C2;&#x70B9;&#x7684;&#x66F2;&#x89E3;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x6253;&#x7B97;&#x628A;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x7684;&#x611F;&#x609F;&#x5199;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x9700;&#x8981;&#x53CD;&#x590D;&#x7684;&#x8BFB;&#x7684;&#x4E66;&#xFF0C;&#x4E00;&#x5343;&#x4E2A;&#x4EBA;&#x773C;&#x4E2D;&#x6709;&#x4E00;&#x5343;&#x4E2A;&#x54C8;&#x59C6;&#x96F7;&#x7279;&#xFF0C;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x4F60;&#x80FD;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x8BFB;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x609F;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/设计模式/" rel="tag"># 设计模式</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/01/02/book-list-to-read/" rel="next" title="2016 年书单">
                <i class="fa fa-chevron-left"></i> 2016 年书单
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/01/09/uml-distilled-note/" rel="prev" title="读书札记之 —— 《UML 精粹》">
                读书札记之 —— 《UML 精粹》 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">82</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#guan-yu-zhe-ben-shu-de-fan-yi"><span class="nav-number">1.</span> <span class="nav-text">关于这本书的翻译</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#san-si-er-hou-xing"><span class="nav-number">2.</span> <span class="nav-text">三思而后行</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#wen-gu-er-zhi-xin"><span class="nav-number">3.</span> <span class="nav-text">温故而知新</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#jian-jie-xing"><span class="nav-number">4.</span> <span class="nav-text">间接性</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#mo-shi-gan-wu"><span class="nav-number">5.</span> <span class="nav-text">模式感悟</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
