<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读书笔记," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="作者布拉恩.科尼汉（Brian W.Kernighan）是一座高山，难得一见的大师级的人物。C
语言圣经K&amp;amp;R中的 K 指的是他，awk 语言中的 K 也是他。它写过很多久负盛名
的书籍，比如《C程序设计语言》，《UNIX 编程环境》，《编程风格元素》和这本《程序
设计实践》。
大师写的书基本上都是一个基调，言简意赅，字字珠玑，简洁但不简单。这本书没有任何
的废话，从前言到附录，每一个部分">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《程序设计实践》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/02/29/tpop-note/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="作者布拉恩.科尼汉（Brian W.Kernighan）是一座高山，难得一见的大师级的人物。C
语言圣经K&amp;amp;R中的 K 指的是他，awk 语言中的 K 也是他。它写过很多久负盛名
的书籍，比如《C程序设计语言》，《UNIX 编程环境》，《编程风格元素》和这本《程序
设计实践》。
大师写的书基本上都是一个基调，言简意赅，字字珠玑，简洁但不简单。这本书没有任何
的废话，从前言到附录，每一个部分">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《程序设计实践》">
<meta name="twitter:description" content="作者布拉恩.科尼汉（Brian W.Kernighan）是一座高山，难得一见的大师级的人物。C
语言圣经K&amp;amp;R中的 K 指的是他，awk 语言中的 K 也是他。它写过很多久负盛名
的书籍，比如《C程序设计语言》，《UNIX 编程环境》，《编程风格元素》和这本《程序
设计实践》。
大师写的书基本上都是一个基调，言简意赅，字字珠玑，简洁但不简单。这本书没有任何
的废话，从前言到附录，每一个部分">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/02/29/tpop-note/"/>





  <title> 读书札记之 —— 《程序设计实践》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/02/29/tpop-note/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《程序设计实践》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-02-29T20:04:45+08:00">
                2016-02-29
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4F5C;&#x8005;&#x5E03;&#x62C9;&#x6069;.&#x79D1;&#x5C3C;&#x6C49;&#xFF08;Brian W.Kernighan&#xFF09;&#x662F;&#x4E00;&#x5EA7;&#x9AD8;&#x5C71;&#xFF0C;&#x96BE;&#x5F97;&#x4E00;&#x89C1;&#x7684;&#x5927;&#x5E08;&#x7EA7;&#x7684;&#x4EBA;&#x7269;&#x3002;<code>C</code>
&#x8BED;&#x8A00;&#x5723;&#x7ECF;<code>K&amp;R</code>&#x4E2D;&#x7684; <code>K</code> &#x6307;&#x7684;&#x662F;&#x4ED6;&#xFF0C;<code>awk</code> &#x8BED;&#x8A00;&#x4E2D;&#x7684; <code>K</code> &#x4E5F;&#x662F;&#x4ED6;&#x3002;&#x5B83;&#x5199;&#x8FC7;&#x5F88;&#x591A;&#x4E45;&#x8D1F;&#x76DB;&#x540D;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x6BD4;&#x5982;&#x300A;C&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x300B;&#xFF0C;&#x300A;UNIX &#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x300B;&#xFF0C;&#x300A;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x5143;&#x7D20;&#x300B;&#x548C;&#x8FD9;&#x672C;&#x300A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5B9E;&#x8DF5;&#x300B;&#x3002;</p>
<p>&#x5927;&#x5E08;&#x5199;&#x7684;&#x4E66;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x8C03;&#xFF0C;&#x8A00;&#x7B80;&#x610F;&#x8D45;&#xFF0C;&#x5B57;&#x5B57;&#x73E0;&#x7391;&#xFF0C;&#x7B80;&#x6D01;&#x4F46;&#x4E0D;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x5E9F;&#x8BDD;&#xFF0C;&#x4ECE;&#x524D;&#x8A00;&#x5230;&#x9644;&#x5F55;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x80FD;&#x8BA9;&#x4F60;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x5F88;&#x8584;&#xFF0C;&#x5374;&#x65E0;&#x6240;&#x4E0D;&#x5305;&#xFF0C;&#x5206;&#x6210;&#x4E5D;&#x4E2A;&#x7AE0;&#x8282;&#xFF0C;&#x6BCF;&#x4E00;&#x7AE0;&#x90FD;&#x8BB2;&#x8FF0;&#x4E86;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x73AF;&#x8282;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x53EF;&#x4EE5;&#x548C;&#x524D;&#x9635;&#x5B50;&#x8BFB;&#x7684;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x76F8;&#x5AB2;&#x7F8E;&#xFF0C;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x771F;&#x7684;&#x8BFB;&#x4E00;&#x8BFB;&#xFF08;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x7528;<code>C</code>&#x8BED;&#x8A00;&#x505A;&#x5F00;&#x53D1;&#xFF09;</p>
<p>&#x82F1;&#x96C4;&#x6240;&#x89C1;&#x901A;&#x5E38;&#x7565;&#x540C;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x548C;&#x539F;&#x6765;&#x770B;&#x8FC7;&#x7684;&#x5F88;&#x591A;&#x4E66;&#x6709;&#x91CD;&#x5408;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x7684;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x4F53;&#x73B0;&#x4E86;&#x4E66;&#x540D;&#x4E2D;&#x7684;<code>&#x5B9E;&#x8DF5;</code>&#x4E8C;&#x5B57;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x63D0;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x4E66;&#x7C4D;&#x90FD;&#x6CDB;&#x6CDB;&#x800C;&#x8C08;&#x7684;&#x91D1;&#x79D1;&#x7389;&#x5F8B;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x3002;</p>
<a id="more"></a>
<h1 id="bian-ma-feng-ge">&#x7F16;&#x7801;&#x98CE;&#x683C;</h1>
<p>&#x5173;&#x4E8E;&#x83DC;&#x9E1F;&#x548C;&#x5927;&#x725B;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x4F53;&#x73B0;&#x5728;&#x4EE3;&#x7801;&#x8C03;&#x8BD5;&#x80FD;&#x529B;&#x4E0A;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x4F53;&#x73B0;&#x5728;&#x6587;&#x6863;&#x9605;&#x8BFB;&#x80FD;&#x529B;&#x4E0A;&#xFF0C;&#x6211;&#x66F4;&#x8BA4;&#x540C;&#x7684;&#x89C2;&#x70B9;&#x662F;&#x4F53;&#x73B0;&#x5728;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x4E4B;&#x4E0A;&#x3002;&#x4E00;&#x6BB5;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x7F8E;&#x7684;&#xFF0C;&#x4F18;&#x96C5;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x5E94;&#x8BE5;&#x8FFD;&#x6C42;&#x7684;&#x5883;&#x754C;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x7B80;&#x5355;&#x3001;&#x6E05;&#x6670;&#x3001;&#x76F4;&#x767D;&#x8FDC;&#x6BD4;&#x523B;&#x610F;&#x7684;&#x9AD8;&#x6548;&#x91CD;&#x8981;&#x7684;&#x591A;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x5EFA;&#x8BAE;&#x540D;&#x5B57;&#x8D77;&#x7684;&#x8D8A;&#x957F;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x8D77;&#x540D;&#x597D;&#x574F;&#x7684;&#x5173;&#x952E;&#x4E0D;&#x5728;&#x4E8E;&#x957F;&#x77ED;&#x800C;&#x5728;&#x4E8E;&#x6E05;&#x6670;&#xFF0C;&#x4F20;&#x8FBE;&#x5B83;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x800C;&#x6E05;&#x6670;&#x6027;&#x548C;&#x4F5C;&#x7528;&#x57DF;&#x76F8;&#x5173;&#x3002;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line"><span class="keyword">for</span> (theElementIndex = <span class="number">0</span>; theElementIndex &lt; numberOfElements;</div><div class="line">        theElementIndex++)</div><div class="line">    elementArray[theElementIndex] = theElementIndex</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x76F8;&#x6BD4;&#x4E8E;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x503C;&#x5F97;&#x63A8;&#x8350;&#x7684;&#x5730;&#x65B9;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line"><span class="keyword">for</span> (i = <span class="number">0</span>; i &lt; nelement; i++)</div><div class="line">    elem[i] = i</div></pre></td></tr></table></figure>
<p>&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x6CE8;&#x91CA;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#x7684;&#x7B80;&#x5355;&#x548C;&#x6E05;&#x6670;&#x6BD4;&#x5197;&#x957F;&#x7684;&#x6CE8;&#x91CA;&#x8981;&#x91CD;&#x8981;&#x7684;&#x591A;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x6539;&#x8FDB;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5B9E;&#x5728;&#x6BD4;&#x8F83;&#x96BE;&#x4EE5;&#x505A;&#x5230;&#x6E05;&#x6670;&#xFF0C;&#x52A0;&#x4E0A;&#x9002;&#x5F53;&#x7684;&#x6CE8;&#x91CA;&#x5E76;&#x5728;&#x4FEE;&#x6539;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4FDD;&#x6301;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x540C;&#x6B65;&#x66F4;&#x65B0;&#x3002;</p>
<h1 id="suan-fa-he-shu-ju-jie-gou">&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;</h1>
<p>&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x5728;&#x4E8E;&#x81EA;&#x5DF1;&#x53D1;&#x660E;&#x65B0;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x800C;&#x5728;&#x4E8E;&#x9009;&#x62E9;&#xFF0C;&#x8BA9;&#x4F60;&#x5728;&#x9047;&#x5230;&#x95EE;&#x9898;&#x3001;&#x9700;&#x8981;&#x4F18;&#x5316;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x6709;&#x6240;&#x9009;&#x62E9;&#x3002;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x56DB;&#x5927;&#x91D1;&#x521A;&#xFF1A;&#x6570;&#x7EC4;&#x3001;&#x94FE;&#x8868;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x54C8;&#x5E0C;&#x8868;&#x662F;&#x6BCF;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x7684;&#x3002;</p>
<h1 id="she-ji-he-shi-xian">&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;</h1>
<p>&#x8FD9;&#x4E00;&#x7AE0;&#x7ED9;&#x51FA;&#x4E86;&#x9A6C;&#x53EF;&#x592B;&#x94FE;&#x6587;&#x5B57;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x548C; 5 &#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4E5F;&#x8BD5;&#x8FC7;&#x7528;
Python &#x91CD;&#x5199;&#x4E86;&#x8BE5;&#x7A0B;&#x5E8F;&#x3002;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x638C;&#x63E1;&#x591A;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x5728;&#x4E8E;&#x70AB;&#x8000;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x800C;&#x5728;&#x4E8E;&#x9009;&#x62E9;&#x548C;&#x6743;&#x8861;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x4F1A; <code>C</code> &#x8BED;&#x8A00;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x8FC7;&#x591A;&#x8003;&#x8651;&#x6027;&#x80FD;&#x7684;&#x5730;&#x65B9;&#x4F60;&#x4E5F;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x4EAB;&#x53D7;&#x5230;C++&#x3001;Python &#x5E26;&#x6765;&#x7684;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x4E0A;&#x7684;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x901A;&#x5E38;&#x548C;&#x4F60;&#x9009;&#x62E9;&#x7684;&#x5B9E;&#x73B0;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x4F60;&#x9009;&#x62E9;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6709;&#x5173;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x901A;&#x5E38;&#x5C31;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x7B80;&#x5355;&#x6E05;&#x6670;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x65AD;&#x7684;&#x8FED;&#x4EE3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x4E00;&#x89E6;&#x800C;&#x5C31;&#x3002;&#x6B64;&#x5916;&#x4EA7;&#x54C1;&#x7EA7;&#x522B;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x6253;&#x78E8;&#x548C;&#x6D4B;&#x8BD5;&#x3002;</p>
<h1 id="jie-kou">&#x63A5;&#x53E3;</h1>
<p>&#x8FD9;&#x4E00;&#x7AE0;&#x9996;&#x5148;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x9879;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#x2014;&#x2014;&#x539F;&#x578B;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x5728;&#x5404;&#x79CD;&#x4E66;&#x7C4D;&#x4E2D;&#x8BF4;&#x70C2;&#x4E86;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7ED9;&#x51FA;&#x4E86;&#x5B83;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x7684;&#x5B9E;&#x9645;&#x4F8B;&#x5B50;&#x3002;&#x4EE3;&#x7801;&#x4E0D;&#x53EF;&#x80FD;&#x4E00;&#x6B21;&#x6210;&#x529F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x5750;&#x5728;&#x81EA;&#x5DF1;&#x5EA7;&#x4F4D;&#x4E0A;&#x82E6;&#x601D;&#x51A5;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#xFF0C;&#x5C1D;&#x8BD5;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x4E0D;&#x662F;&#x5929;&#x624D;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x591A;&#x81EA;&#x604B;&#xFF0C;&#x4F60;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x5929;&#x624D;&#x5230;&#x4E00;&#x6B21;&#x628A;&#x7A0B;&#x5E8F;&#x5199;&#x5BF9;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x63A5;&#x53E3;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x5E94;&#x8BE5;&#x662F;&#x5B83;&#x7684;&#x63A5;&#x53E3;&#x8BF4;&#x660E;&#xFF08;specification&#xFF09;&#xFF0C;&#x5728;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x4E2D;&#x4F5C;&#x8005;&#x628A;&#x5B83;&#x79F0;&#x4E3A;&#x5408;&#x7EA6;&#xFF08;contact&#xFF09;&#xFF0C;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x6B8A;&#x9014;&#x540C;&#x5F52;&#x2014;&#x2014;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x63D0;&#x4F9B;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4F9B;&#x6C42;&#x53CC;&#x65B9;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x597D;&#x7684;&#x7684;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x3001;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x3001;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x7B49;&#x7B49;&#x3002;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x539F;&#x751F;&#x7684;&#x652F;&#x6301;&#x6BD4;&#x5982;C++&#x7684;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x3001;RAII&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7B49;&#xFF0C;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x5374;&#x8981;&#x8BBE;&#x8BA1;&#x8005;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x548C;&#x6743;&#x8861;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982; C &#x7A0B;&#x5E8F;&#x5458;&#x3002;</p>
<h1 id="diao-shi">&#x8C03;&#x8BD5;</h1>
<p>&#x4EE3;&#x7801;&#x9884;&#x9632;&#x7684;&#x8D8A;&#x597D;&#xFF0C;BUG &#x8D8A;&#x5C11;&#xFF0C;&#x8C03;&#x8BD5;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x8D8A;&#x5C11;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x5148;&#x8BFB;&#x4E00;&#x8BFB;&#x7B2C;&#x4E00;&#x7AE0;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x60F3;&#x5230;&#x8C03;&#x8BD5;&#x7B2C;&#x4E00;&#x53CD;&#x5E94;&#x662F;&#x501F;&#x52A9;&#x8C03;&#x8BD5;&#x5668;&#xFF0C;&#x6253;&#x65AD;&#x70B9;&#xFF0C;&#x5355;&#x6B65;&#x8DDF;&#x8E2A;&#xFF0C;&#x5728;&#x4F5C;&#x8005;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x540E;&#x4E00;&#x62DB;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x5148;&#x7406;&#x6027;&#x7684;&#x5206;&#x6790;&#x4E00;&#x4E0B;<code>BUG</code>&#x51FA;&#x73B0;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x770B;&#x770B;&#x51FA;&#x9519;&#x7684;&#x65F6;&#x5019;&#x7684;&#x6808;&#x5E27;&#x4FE1;&#x606F;&#xFF0C;&#x67E5;&#x67E5;&#x4F60;&#x6700;&#x8FD1;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x548C;&#x522B;&#x4EBA;&#x8BB2;&#x8BB2;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B9A;&#x4F4D;&#x6700;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x884C;&#x5C31;&#x4F11;&#x606F;&#x4F11;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x5F0F;&#x6BD4;&#x4F60;&#x7528;&#x8C03;&#x8BD5;&#x5668;&#x5FEB;&#x5F88;&#x591A;&#x3002;</p>
<h1 id="ce-shi">&#x6D4B;&#x8BD5;</h1>
<p>&#x6D4B;&#x8BD5;&#x7684;&#x9996;&#x8981;&#x539F;&#x5219;&#x662F;&#x2014;&#x2014;&#x4F60;&#x5F97;&#x505A;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x5E94;&#x8BE5;&#x505A;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E0D;&#x8981;&#x4F9D;&#x9760;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x5E2E;&#x4F60;&#x505A;&#x6D4B;&#x8BD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x6BD4;&#x4F60;&#x81EA;&#x5DF1;&#x66F4;&#x61C2;&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6D4B;&#x8BD5;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x627E;&#x5230;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x6CA1;&#x6709;&#x9519;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x50CF;&#x9AD8;&#x5FB7;&#x7EB3;&#x8FD9;&#x6837;&#x7684;&#x4E0A;&#x5E1D;&#x7EA7;&#x522B;&#x7684;&#x4EBA;&#x7269;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#x4F1A;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x81EA;&#x5DF1;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x540C;&#x65F6;&#x5C31;&#x5F00;&#x59CB;&#x6D4B;&#x8BD5;&#xFF0C;&#x5199;&#x4E00;&#x70B9;&#x6D4B;&#x8BD5;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5199;&#x5B8C;&#x4E86;&#x518D;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x68C0;&#x67E5;&#x4F60;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#xFF0C;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#x548C;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528;&#x65AD;&#x8A00;&#xFF0C;&#x9632;&#x5FA1;&#x6027;&#x7684;&#x7F16;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x6070;&#x6070;&#x662F;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x4E2D;&#x6309;&#x5408;&#x7EA6;&#x7F16;&#x7A0B;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5168;&#x9762;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x6BD4;&#x4E24;&#x8005;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4F4E;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x5B83;&#x5BF9;&#x6BD4;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#xFF0C;&#x5F88;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5728;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x4E2D;&#x4E5F;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x4E86;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x3002;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x4E00;&#x4E9B;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;<code>awk</code>&#xFF0C;<code>python</code>&#x7B49;&#x3002;</p>
<h1 id="xing-neng-diao-you">&#x6027;&#x80FD;&#x8C03;&#x4F18;</h1>
<p>&#x5982;&#x679C;&#x4E0D;&#x5FC5;&#x8981;&#xFF0C;&#x4E0D;&#x8981;&#x5C1D;&#x8BD5;&#x8C03;&#x4F18;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x5148;&#x7528; <code>profiler</code> &#x67E5;&#x4E00;&#x67E5;&#x6027;&#x80FD;&#x7684;&#x74F6;&#x9888;&#x662F;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF0C;&#x5728;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x505A;&#x4F18;&#x5316;&#x53EA;&#x4F1A;&#x6D6A;&#x8D39;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4F18;&#x5316;&#x8981;&#x9002;&#x53EF;&#x800C;&#x6B62;&#x3002;</p>
<h1 id="ke-yi-zhi-xing">&#x53EF;&#x79FB;&#x690D;&#x6027;</h1>
<p>&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x4EE5;&#x5916;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6807;&#x51C6;&#x4E4B;&#x5185;&#x7684;&#x7279;&#x6027;&#x4F7F;&#x7528;<code>&#x4E3B;&#x6D41;</code>&#x7684;&#x90E8;&#x5206;&#xFF08;&#x90A3;&#x4E9B;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x7528;&#xFF0C;&#x786E;&#x5B9A;&#x4E0D;&#x4F1A;&#x6709;&#x672A;&#x5B9A;&#x4E49;&#x95EE;&#x9898;&#x7684;&#x7279;&#x6027;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5FC5;&#x987B;&#x95EE;&#x4E00;&#x4E2A;<code>&#x8BED;&#x8A00;&#x4E13;&#x5BB6;</code>&#x624D;&#x80FD;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x662F;&#x5426;&#x662F;&#x53EF;&#x79FB;&#x690D;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;C&#x548C;C++&#x7684;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#x5B83;&#x662F;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x7684;&#x52A9;&#x624B;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x4EEC;&#x5374;&#x662F;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x7684;&#x5927;&#x5FCC;&#xFF0C;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x3002;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;&#x4F7F;&#x5F97;&#x4F60;&#x770B;&#x5230;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x7F16;&#x8BD1;&#x5668;&#x770B;&#x5230;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x548C;&#x6D4B;&#x8BD5;&#x3002;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5728;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x53EA;&#x662F;&#x8BF4;&#x660E;&#x7F16;&#x8BD1;&#x5668;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x4F60;&#x6362;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x53EF;&#x80FD;&#x7ACB;&#x9A6C;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#xFF0C;&#x628A;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x7684;&#x7EC6;&#x8282;&#x9690;&#x85CF;&#x5728;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E2D;&#xFF0C;&#x628A;&#x548C;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x79FB;&#x52A8;&#x5230;&#x72EC;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;linux&#x5E73;&#x53F0;&#x7684;&#x5B9E;&#x73B0;&#x653E;&#x5728;<code>linux.cpp</code>&#xFF0C;windows&#x5E73;&#x53F0;&#x7684;&#x5B9E;&#x73B0;&#x653E;&#x5728;
<code>windows.cpp</code>&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#x9009;&#x9879;&#x9009;&#x7740;&#x5408;&#x9002;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x6E05;&#x6670;&#x5F88;&#x591A;&#xFF0C;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x6269;&#x5C55;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6D89;&#x53CA;&#x5230;&#x6570;&#x636E;&#x7684;&#x4EA4;&#x6362;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x6765;&#x8BF4;&#x6709;&#x975E;&#x5E38;&#x5927;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x4F7F;&#x5F97;&#x4F60;&#x6570;&#x636E;&#x5904;&#x7406;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</p>
<h1 id="ji-fa">&#x8BB0;&#x6CD5;</h1>
<p>&#x6211;&#x539F;&#x6765;&#x4E00;&#x76F4;&#x4E0D;&#x592A;&#x7406;&#x89E3;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x91CC;&#x9762;&#x4F5C;&#x8005;&#x8BF4;&#x7684;&#x201C;&#x9886;&#x57DF;&#x8BED;&#x8A00;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x4E5F;&#x4E0D;&#x592A;&#x7406;&#x89E3;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;&#x91CC;&#x9762;&#x8BF4;&#x9053;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF0C;&#x66F4;&#x4E0D;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#x91CC;&#x9762;&#x4F5C;&#x8005;&#x4F1A;&#x9F13;&#x5439; <code>lisp</code> &#x8BED;&#x8A00;&#x4E2D;&#x5F3A;&#x5927;&#x5230;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x7F16;&#x7A0B;&#x7684;&#x5B8F;&#x3002;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x5728;&#x6211;&#x770B;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E5D;&#x7AE0;&#xFF1A;<code>Notation</code> &#x4E4B;&#x540E;&#x53D8;&#x5F97;&#x8C41;&#x7136;&#x5F00;&#x6717;</p>
<p>&#x9886;&#x57DF;&#x8BED;&#x8A00;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x795E;&#x79D8;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x7684; <code>printf</code> &#x683C;&#x5F0F;&#x5316;&#x8BB0;&#x53F7;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x5305;&#x542B;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5728;&#x201C;&#x95EE;&#x9898;&#x57DF;&#x201D;&#x548C;&#x201C;&#x89E3;&#x51B3;&#x57DF;&#x201D;&#x4E4B;&#x95F4;&#x4E00;&#x76F4;&#x90FD;&#x5B58;&#x5728;&#x9E3F;&#x6C9F;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x8DE8;&#x8D8A;&#x8FD9;&#x6761;&#x9E3F;&#x6C9F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x6307;&#x5B9A;&#x4E00;&#x95E8;&#x9760;&#x8FD1;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x95EE;&#x9898;&#x57DF;&#x4E2D;&#x7684;&#x672F;&#x8BED;&#x6765;&#x7F16;&#x7A0B;&#x3002;&#x8FD9;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x9AD8;&#x5927;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x8BED;&#x8A00;&#x4E0D;&#x8FC7;&#x662F;&#x8BB0;&#x53F7;&#x800C;&#x5DF2;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x8BB0;&#x53F7;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;<code>printf</code>&#x7684;&#x683C;&#x5F0F;&#x8BF4;&#x660E;&#x7B26;&#x3002;</p>
<p>&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x795E;&#x79D8;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x673A;&#x5668;&#x4EE3;&#x7801;&#x7684;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x5DE5;&#x5177;&#x3002;&#x65E9;&#x671F;&#x7684;
<code>C++</code> &#x7F16;&#x8BD1;&#x5668; <code>cfront</code> &#x628A; <code>C++</code> &#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x6210; <code>C</code> &#x8BED;&#x8A00;&#x4EE3;&#x7801;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x770B; <code>cfront</code>
&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;&#x3002;</p>
<p>&#x4E00;&#x5207;&#x7684;&#x4E00;&#x5207;&#x53C8;&#x56DE;&#x5230;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x738B;&#x9053;&#xFF1A;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#x3002;&#x9886;&#x57DF;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x975E;&#x5F97;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x8F6C;&#x6362;&#x6210;&#x66F4;&#x5E95;&#x5C42;&#x7684;&#x8BED;&#x8A00;&#x6BD4;&#x5982;<code>C++/C</code>&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x6765;&#x5E2E;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x8F6C;&#x6362;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/26/python-regx-note/" rel="next" title="Python 正则表达式疑难点">
                <i class="fa fa-chevron-left"></i> Python 正则表达式疑难点
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/09/cppx-list-initilization/" rel="prev" title="关于 C++ 11 初始化列表和转换构造函数">
                关于 C++ 11 初始化列表和转换构造函数 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">81</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">23</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#bian-ma-feng-ge"><span class="nav-number">1.</span> <span class="nav-text">编码风格</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#suan-fa-he-shu-ju-jie-gou"><span class="nav-number">2.</span> <span class="nav-text">算法和数据结构</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#she-ji-he-shi-xian"><span class="nav-number">3.</span> <span class="nav-text">设计和实现</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#jie-kou"><span class="nav-number">4.</span> <span class="nav-text">接口</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#diao-shi"><span class="nav-number">5.</span> <span class="nav-text">调试</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#ce-shi"><span class="nav-number">6.</span> <span class="nav-text">测试</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#xing-neng-diao-you"><span class="nav-number">7.</span> <span class="nav-text">性能调优</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#ke-yi-zhi-xing"><span class="nav-number">8.</span> <span class="nav-text">可移植性</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#ji-fa"><span class="nav-number">9.</span> <span class="nav-text">记法</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
