<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Linux Kernel," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="抢占（preempt）
现代操作系统为了提高资源的利用率一般都支持多任务（这里不想纠结进程、线程、内核线
程之间的关系所以使用任务一词），但是因为系统资源有限，系统中同一时间点能够运行的
任务是有限的（单核的话只有一个，多核可能有多个）。为了解决这个冲突，操作系统不得
不在任务之间不断的切换，让一些任务运行一段时间之后睡眠，然后从原来处于睡眠状态的
任务中选出一些来继续运行。这种从一个运行的任务切">
<meta property="og:type" content="article">
<meta property="og:title" content="Linux 中断、抢占、锁之间的关系">
<meta property="og:url" content="http://blog.guorongfei.com/2014/09/06/linux-interrupt-preemptive-lock/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="抢占（preempt）
现代操作系统为了提高资源的利用率一般都支持多任务（这里不想纠结进程、线程、内核线
程之间的关系所以使用任务一词），但是因为系统资源有限，系统中同一时间点能够运行的
任务是有限的（单核的话只有一个，多核可能有多个）。为了解决这个冲突，操作系统不得
不在任务之间不断的切换，让一些任务运行一段时间之后睡眠，然后从原来处于睡眠状态的
任务中选出一些来继续运行。这种从一个运行的任务切">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Linux 中断、抢占、锁之间的关系">
<meta name="twitter:description" content="抢占（preempt）
现代操作系统为了提高资源的利用率一般都支持多任务（这里不想纠结进程、线程、内核线
程之间的关系所以使用任务一词），但是因为系统资源有限，系统中同一时间点能够运行的
任务是有限的（单核的话只有一个，多核可能有多个）。为了解决这个冲突，操作系统不得
不在任务之间不断的切换，让一些任务运行一段时间之后睡眠，然后从原来处于睡眠状态的
任务中选出一些来继续运行。这种从一个运行的任务切">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2014/09/06/linux-interrupt-preemptive-lock/"/>





  <title> Linux 中断、抢占、锁之间的关系 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2014/09/06/linux-interrupt-preemptive-lock/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.gif">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Linux 中断、抢占、锁之间的关系
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2014-09-06T00:00:00+08:00">
                2014-09-06
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="qiang-zhan-preempt">&#x62A2;&#x5360;&#xFF08;preempt&#xFF09;</h1>
<p>&#x73B0;&#x4EE3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x8D44;&#x6E90;&#x7684;&#x5229;&#x7528;&#x7387;&#x4E00;&#x822C;&#x90FD;&#x652F;&#x6301;&#x591A;&#x4EFB;&#x52A1;&#xFF08;&#x8FD9;&#x91CC;&#x4E0D;&#x60F3;&#x7EA0;&#x7ED3;&#x8FDB;&#x7A0B;&#x3001;&#x7EBF;&#x7A0B;&#x3001;&#x5185;&#x6838;&#x7EBF;
&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x52A1;&#x4E00;&#x8BCD;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x7684;
&#x4EFB;&#x52A1;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF08;&#x5355;&#x6838;&#x7684;&#x8BDD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x591A;&#x6838;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x51B2;&#x7A81;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x5F97;
&#x4E0D;&#x5728;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x4E0D;&#x65AD;&#x7684;&#x5207;&#x6362;&#xFF0C;&#x8BA9;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x8FD0;&#x884C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x7761;&#x7720;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x539F;&#x6765;&#x5904;&#x4E8E;&#x7761;&#x7720;&#x72B6;&#x6001;&#x7684;
&#x4EFB;&#x52A1;&#x4E2D;&#x9009;&#x51FA;&#x4E00;&#x4E9B;&#x6765;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x79CD;&#x4ECE;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x884C;&#x4E3A;&#x53EB;&#x505A;&#x4EFB;
&#x52A1;&#x5207;&#x6362;&#xFF0C;&#x800C;&#x4EFB;&#x52A1;&#x5207;&#x6362;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<a id="more"></a>
<p>&#x8C03;&#x5EA6;&#x53C8;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x8C03;&#x5EA6;&#xFF1A;&#x62A2;&#x5360;&#x5F0F;&#x7684;&#x8C03;&#x5EA6;&#x548C;&#x975E;&#x62A2;&#x5360;&#x5F0F;&#x7684;&#x8C03;&#x5EA6;&#x3002;&#x5728;&#x975E;&#x62A2;&#x5360;&#x5F0F;&#x7684;&#x8C03;&#x5EA6;&#x4E2D;&#xFF0C;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x901A;
&#x8FC7;&#x534F;&#x8C03;&#x6765;&#x51B3;&#x5B9A;&#x54EA;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5C06;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x523B;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x5728;&#x62A2;&#x5360;&#x5F0F;&#x7684;&#x8C03;&#x5EA6;&#x4E2D;&#x8FD9;&#x4E00;&#x51B3;&#x7B56;&#x7531;&#x8C03;&#x5EA6;&#x5668;&#x6765;&#x5B8C;&#x6210;
&#x3002;&#x8C03;&#x5EA6;&#x5668;&#x8FD9;&#x79CD;&#x6682;&#x65F6;&#x505C;&#x6B62;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x4ECE;&#x800C;&#x8BA9;&#x53E6;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x8FD0;&#x884C;&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x79F0;&#x4E3A;&#x62A2;&#x5360;&#x3002;Linux &#x4F7F;
&#x7528;&#x7684;&#x5C31;&#x662F;&#x62A2;&#x5360;&#x5F0F;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x62A2;&#x5360;&#x4E00;&#x822C;&#x53C8;&#x5206;&#x4E3A;&#x7528;&#x6237;&#x62A2;&#x5360;&#x548C;&#x5185;&#x6838;&#x62A2;&#x5360;&#x3002;&#x7528;&#x6237;&#x62A2;&#x5360;&#xFF1A;&#x662F;&#x6307;&#x7684;&#x5185;&#x6838;&#x5728;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x65F6;&#x505A;&#x51FA;&#x7684;&#x62A2;&#x5360;
&#x51B3;&#x5B9A;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x4E00;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;</p>
<ul>
<li>
<p>&#x5185;&#x6838;&#x4ECE;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E2D;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4ECE;&#x800C;&#x9677;&#x5165;&#x5185;
&#x6838;&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x5185;&#x6838;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E4B;&#x540E;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF09;&#x3002;</p>
</li>
<li>
<p>&#x5185;&#x6838;&#x4ECE;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x4E2D;&#x5185;&#x6838;&#x6536;&#x5230;&#x4E2D;&#x65AD;&#x4FE1;
&#x53F7;&#x8F6C;&#x800C;&#x6267;&#x884C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x4E4B;&#x540E;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EE7;&#x7EED;&#x539F;&#x6765;&#x7684;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#xFF09;</p>
</li>
</ul>
<p>&#x5185;&#x6838;&#x62A2;&#x5360;&#xFF1A;&#x662F;&#x6307;&#x5728;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x62A2;&#x5360;&#x3002;&#x901A;&#x5E38;&#x5728;&#x6267;&#x884C;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x65F6;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x5185;&#x6838;
&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B21;&#x8C03;&#x5EA6;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x7528;&#x6237;&#x62A2;&#x5360;&#x7684;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8C03;
&#x5EA6;&#x5668;&#x65E0;&#x6CD5;&#x5728;&#x4EFB;&#x52A1;&#x8FD8;&#x5904;&#x4E8E;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x62A2;&#x5360;&#x3002;Linux &#x5B9E;&#x73B0;&#x4E86;&#x7684;&#x5185;&#x6838;&#x62A2;&#x5360;&#x4F7F;&#x5F97;&#x5185;&#x6838;&#x4EE3;&#x7801;
&#x7684;&#x6267;&#x884C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x62A2;&#x5360;&#xFF0C;&#x6761;&#x4EF6;&#x662F;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6CA1;&#x6709;&#x6301;&#x6709;&#x9501;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;
<code>thread_info</code> &#x4E2D;&#x52A0;&#x5165; <code>preempt_count</code> &#x8BA1;&#x6570;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x4E3A; 0 &#x8868;&#x793A;&#x53EF;&#x4EE5;
&#x62A2;&#x5360;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#x884C;&#x3002;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2D;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x5185;&#x6838;&#x62A2;&#x5360;&#xFF1A;</p>
<ul>
<li>
<p>&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x7ED3;&#x675F;&#x5E76;&#x8FD4;&#x56DE;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x4E4B;&#x524D;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x4E2D;&#x65AD;&#xFF09;</p>
</li>
<li>
<p>&#x5185;&#x6838;&#x518D;&#x6B21;&#x53D8;&#x6210;&#x53EF;&#x4EE5;&#x62A2;&#x5360;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x5185;&#x6838;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x62A2;&#x5360;&#x9700;&#x8981;&#x4F9D;&#x8D56; <code>preempt_count</code> &#x5982;&#x679C;&#x5B83;&#x4ECE;
&#x975E;&#x96F6;&#x53D8;&#x6210;&#x96F6;&#x4E5F;&#x5C31;&#x662F;&#x518D;&#x6B21;&#x53D8;&#x4E3A;&#x53EF;&#x62A2;&#x5360;&#xFF09;</p>
</li>
<li>
<p>&#x5185;&#x6838;&#x4EE3;&#x7801;&#x663E;&#x5F0F;&#x8C03;&#x7528; <code>schedule()</code> &#x51FD;&#x6570;&#xFF08;&#x5982;&#x679C;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x663E;&#x5F0F;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x8868;&#x660E;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x786E;&#x5B9A;
&#x76EE;&#x524D;&#x53EF;&#x4EE5;&#x62A2;&#x5360;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x7684; BUG &#x4E86;&#xFF09;</p>
</li>
<li>
<p>&#x4EFB;&#x52A1;&#x5728;&#x5185;&#x6838;&#x4E2D;&#x963B;&#x585E;&#xFF08;&#x8FD9;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4; <code>schedule()</code> &#x88AB;&#x8C03;&#x7528;&#xFF09;</p>
</li>
</ul>
<h1 id="zhong-duan-interrupt">&#x4E2D;&#x65AD;&#xFF08;interrupt&#xFF09;</h1>
<p>&#x5185;&#x6838;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x9700;&#x8981;&#x548C;&#x786C;&#x4EF6;&#x4E4B;&#x95F4;&#x6709;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x3002;&#x8003;&#x8651;&#x5230;&#x5904;&#x7406;&#x5668;&#x4E00;&#x822C;&#x901F;&#x5EA6;
&#x6BD4;&#x786C;&#x4EF6;&#x5FEB;&#x4E0A;&#x597D;&#x51E0;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x8BA9;&#x5185;&#x6838;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x800C;&#x7B49;&#x5F85;&#x786C;&#x4EF6;&#x7684;&#x54CD;&#x5E94;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;
&#x65B9;&#x5F0F;&#x4F7F;&#x5F97;&#x786C;&#x4EF6;&#x80FD;&#x591F;&#x901A;&#x77E5;&#x5185;&#x6838;&#xFF0C;&#x8BA9;&#x5185;&#x6838;&#x54CD;&#x5E94;&#x786C;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x662F;&#x901A;&#x8FC7;&#x201C;&#x8F6E;&#x8BE2;&#x201D;&#x5B9A;&#x671F;&#x7684;&#x68C0;&#x67E5;&#x786C;&#x4EF6;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x54CD;&#x5E94;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x5F00;&#x9500;&#x592A;&#x5927;&#x3002;&#x53E6;
&#x4E00;&#x79CD;&#x66F4;&#x4E3A;&#x5408;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x8BA9;&#x786C;&#x4EF6;&#x5728;&#x9700;&#x8981;&#x548C;&#x5185;&#x6838;&#x901A;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x5185;&#x6838;&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#xFF0C;&#x8FD9;
&#x79CD;&#x673A;&#x5236;&#x5C31;&#x662F;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#x3002;&#x800C;&#x5F53;&#x5185;&#x6838;&#x6536;&#x5230;&#x4FE1;&#x53F7;&#x4E4B;&#x540E;&#x53BB;&#x5904;&#x7406;&#x4FE1;&#x53F7;&#x7684;&#x4EE3;&#x7801;&#x53EB;&#x505A;&#x201C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x201D;&#xFF08;&#x6CE8;&#x610F;&#x4E0D;&#x8981;
&#x6DF7;&#x6DC6;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x8FD8;&#x4E2D;&#x65AD;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x5185;&#x6838;&#x51FD;&#x6570;&#x5C5E;&#x4E8E;&#x8F6F;&#x4EF6;&#x8303;&#x7574;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x662F;&#x4E00;&#x4E2A;&#x82AF;&#x7247;&#x662F;&#x786C;&#x4EF6;&#x8303;
&#x7574;&#xFF09;&#x3002;</p>
<p>&#x5F88;&#x663E;&#x7136;&#x4E2D;&#x65AD;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x523B;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F02;&#x6B65;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#xFF0C;&#x5185;&#x6838;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x786C;&#x4EF6;&#x5728;
&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x53BB;&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#x7ED9;&#x5B83;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;&#x5185;&#x6838;&#x5B83;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x4F60;&#x4E0B;&#x4E00;&#x6B21;&#x6572;&#x51FB;&#x952E;&#x76D8;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#xFF09;
&#x3002;</p>
<h1 id="zhong-duan-he-qiang-zhan-de-guan-xi">&#x4E2D;&#x65AD;&#x548C;&#x62A2;&#x5360;&#x7684;&#x5173;&#x7CFB;</h1>
<p>&#x5173;&#x4E8E;&#x4E2D;&#x65AD;&#x548C;&#x62A2;&#x5360;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5728;&#x300A;Linux Kernel Development (Third Edition)&#x300B;&#x7684;P127&#x9875;
&#x4E2D;&#x65AD;&#x63A7;&#x5236;&#x7684;&#x7B2C;&#x4E8C;&#x6BB5;&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x63D0;&#x5230;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>Moreover, disabling interrupts also disbles kernel preemption.</p>
</blockquote>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5176;&#x5B9E;&#x4E2D;&#x65AD;&#x548C;&#x62A2;&#x5360;&#x6709;&#x7740;&#x6BD4;&#x8F83;&#x5BC6;&#x5207;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x610F;&#x4E49;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x540E;
&#x4E00;&#x4E2A;&#x8BCD;&#x8BED; kernel preemption &#x6307;&#x7684;&#x662F;&#x5426;&#x4EC5;&#x4EC5;&#x662F;&#x5185;&#x6838;&#x62A2;&#x5360;&#x8FD8;&#x662F;&#x5305;&#x62EC;&#x7528;&#x6237;&#x62A2;&#x5360;&#x4E0D;&#x5F97;&#x800C;&#x77E5;&#xFF08;&#x4ECE;&#x5B57;
&#x9762;&#x4E0A;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x5355;&#x72EC;&#x6307;&#x7684;&#x5185;&#x6838;&#x62A2;&#x5360;&#xFF09;&#x3002;</p>
<p>&#x5728; stack overflow &#x4E2D;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x63D0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5404;&#x79CD;&#x89E3;&#x91CA;&#x4F17;&#x8BF4;&#x7EB7;&#x7EAD;&#x4E0D;&#x8FC7;&#x6709;&#x4E00;&#x70B9;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#xFF0C;
&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x4E4B;&#x540E;&#x65E0;&#x8BBA;&#x662F;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF08;&#x7528;&#x6237;&#x62A2;&#x5360;&#xFF09;&#x8FD8;&#x662F;&#x8FD4;&#x56DE;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF08;&#x5185;&#x6838;&#x62A2;&#x5360;&#xFF09;
&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8C03;&#x5EA6;&#x4ECE;&#x800C;&#x51FA;&#x73B0;&#x62A2;&#x5360;&#xFF0C;&#x8FD9;&#x70B9;&#x5728;&#x524D;&#x9762;&#x5173;&#x4E8E;&#x62A2;&#x5360;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x6709;&#x63D0;&#x5230;&#x8FC7;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x7406;
&#x89E3;&#xFF0C;&#x963B;&#x6B62;&#x4E86;&#x4E2D;&#x65AD;&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4ECE;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x8FD4;&#x56DE;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x62A2;&#x5360;&#x3002;</p>
<p>&#xFF08;&#x5173;&#x4E8E;&#x8FD9;&#x6BB5;&#x8BDD;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x6709;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x91CA;&#x6B22;&#x8FCE;&#x8865;&#x5145;&#xFF0C;&#x6211;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x8BFB;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;
&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#xFF09;</p>
<p>&#x53E6;&#x5916;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;context&#xFF09;&#x4E2D;&#x65AD;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x4E2D;
&#x65AD;&#x5904;&#x7406;&#x5668;&#x65E0;&#x6CD5;&#x963B;&#x585E;&#x4E5F;&#x4E0D;&#x80FD;&#x7761;&#x7720;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x80CC;&#x540E;&#x652F;&#x6491;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x662F;&#x4E0D;&#x53EF;&#x8C03;&#x5EA6;&#x7684;
&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x662F;&#x65E0;&#x6CD5;&#x62A2;&#x5360;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x8FD8;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x5176;&#x4ED6;&#x7684;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x65AD;
&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2D;&#x65AD;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x4EFB;&#x4F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;&#x66F4;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E2D;&#x65AD;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x53EF;&#x80FD;&#x5F53;&#x524D;&#x4E2D;&#x65AD;
&#x5904;&#x7406;&#x5668;&#x7684;&#x5904;&#x7406;&#x518D;&#x6B21;&#x88AB;&#x4E2D;&#x65AD;&#x3002;</p>
<h1 id="qiang-zhan-he-suo-de-guan-xi">&#x62A2;&#x5360;&#x548C;&#x9501;&#x7684;&#x5173;&#x7CFB;</h1>
<p>&#x62A2;&#x5360;&#x4E2D;&#x7684;&#x5185;&#x6838;&#x62A2;&#x5360;&#x53EF;&#x4EE5;&#x53D1;&#x751F;&#x7684;&#x6761;&#x4EF6;&#x662F;&#x4EFB;&#x52A1;&#x4E0D;&#x80FD;&#x6301;&#x6709;&#x9501;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; <code>preempt_count</code>&#xA0;&#x5FC5;&#x987B;&#x662F;&#x4E3A;
&#x96F6;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x52A0;&#x9501;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x5185;&#x6838;&#x62A2;&#x5360;&#x3002;</p>
<p>Linux &#x5185;&#x6838;&#x63D0;&#x4F9B;&#x4E86;&#x963B;&#x6B62;&#x5185;&#x6838;&#x62A2;&#x5360;&#x7684; API -- <code>preempt_disable()</code> &#x548C;&#xA0;<code>preempty_enable()</code>
&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x5176;&#x5B9E;&#x662F;&#x901A;&#x8FC7;&#x63A7;&#x5236; <code>preempt_count</code>&#xA0;&#x6765;&#x8FBE;&#x5230;&#x6548;&#x679C;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x662F;
<code>preempt_disble()</code> &#x7684;&#x5B9A;&#x4E49;&#xFF1A;</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line"><span class="meta">#<span class="meta-keyword">define</span> preempt_disable() \</span></div><div class="line">do { \</div><div class="line">        preempt_count_inc(); \</div><div class="line">        barrier(); \</div><div class="line">} while (0)</div></pre></td></tr></table></figure>
<p>&#x4ECE;&#x4EE3;&#x7801;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x7684;&#x770B;&#x5230;&#x5B83;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x7684;&#x5C31;&#x662F;&#x589E;&#x52A0; <code>preemptc_count</code> &#x7684;&#x503C;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x7A0B;
&#xFF08;<code>routine</code>&#xFF0C;&#x8FD9;&#x91CC;&#x7528; <code>routine</code> &#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x672C;&#x8EAB;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5B8F;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x5B8F;&#x5B9A;&#x4E49;&#x7684;&#x6700;&#x7EC8;&#x6269;&#x5C55;
&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x53BB;&#x533A;&#x5206;&#x5B8F;&#x5B9A;&#x4E49;&#x548C;&#x51FD;&#x6570;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x4E86; <code>routine</code> &#x800C;&#x4E0D;
&#x662F; <code>function</code>&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x4E86;&#x963B;&#x6B62;&#x5185;&#x6838;&#x62A2;&#x5360;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x9501;&#x548C;&#x5185;&#x6838;&#x62A2;&#x5360;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x6301;&#x6709;&#x9501;&#x7684;&#x4EFB;&#x52A1;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x5185;&#x6838;&#x62A2;&#x5360;&#x3002;LKD &#x4E2D;&#x6211;&#x76EE;&#x524D;&#x6CA1;
&#x6709;&#x770B;&#x5230;&#x5173;&#x4E8E;&#x9501;&#x548C;&#x7528;&#x6237;&#x62A2;&#x65AD;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x8FD9;&#x91CC;&#x4E0D;&#x5984;&#x4E0B;&#x5B9A;&#x8BBA;&#x3002;</p>
<h1 id="zhong-duan-he-suo-de-guan-xi">&#x4E2D;&#x65AD;&#x548C;&#x9501;&#x7684;&#x5173;&#x7CFB;</h1>
<p>&#x4E2D;&#x65AD;&#x548C;&#x9501;&#x7406;&#x8BBA;&#x4E0A;&#x8BF4;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6709;&#x8F83;&#x5927;&#x7684;&#x74DC;&#x845B;&#x3002;&#x5728;&#x540C;&#x6B65;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x9501;&#x662F;
&#x8D77;&#x7740;&#x975E;&#x5E38;&#x5173;&#x952E;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x5F53;&#x52A0;&#x9501;&#x548C;&#x4E2D;&#x65AD;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x4E86;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x4E2D;&#x65AD;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4EE5;&#x4E0B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5F53;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x88AB;
&#x4E2D;&#x65AD;&#x7684;&#x5230;&#x6765;&#x6253;&#x65AD;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5927;&#x788D;&#xFF0C;&#x7B49;&#x5F85;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7ED3;&#x675F;&#x4E4B;&#x5019;&#x539F;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;
&#x8FD0;&#x884C;&#xFF08;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x8FD4;&#x56DE;&#x4E4B;&#x540E;&#x4F1A;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6D89;&#x53CA;&#x5230;&#x540C;&#x6B65;&#x95EE;
&#x9898;&#x5904;&#x7406;&#xFF0C;&#x4E8B;&#x60C5;&#x5C31;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x52A0;&#x9501;&#x5F62;&#x6210;&#x4E34;&#x754C;&#x533A;&#x3002;&#x5728;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x4E2D;
&#x540C;&#x6837;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x88AB;&#x963B;&#x585E;&#x4E5F;&#x4E0D;&#x80FD;&#x7761;&#x7720;&#x6240;&#x4EE5;&#x5B83;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x9501;&#x5C31;&#x53EA;&#x6709;&#x81EA;&#x65CB;&#x9501;
&#xFF08;spin lock&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x4EFB;&#x52A1; A &#x83B7;&#x5F97;&#x4E86;&#x67D0;&#x4E2A;&#x4E34;&#x754C;&#x533A;&#x7684;&#x81EA;&#x65CB;&#x9501; L&#xA0;&#x4F46;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x9000;&#x51FA;&#x4E34;&#x754C;&#x533A;&#xFF08;&#x4E5F;&#x5C31;
&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x91CA;&#x653E;&#x8FD9;&#x628A;&#x81EA;&#x65CB;&#x9501;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5B83;&#x88AB;&#x4E00;&#x4E2A;&#x7A81;&#x5982;&#x5176;&#x6765;&#x7684;&#x4E2D;&#x65AD;&#x6253;&#x65AD;&#xFF0C;&#x5185;&#x6838;&#x8F6C;&#x800C;&#x6267;&#x884C;&#x4E2D;&#x65AD;&#x5904;
&#x7406;&#x5668; B&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668; B &#x540C;&#x6837;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x4E34;&#x754C;&#x533A;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x9700;&#x8981;&#x5148;&#x83B7;&#x53D6;&#x81EA;&#x65CB;&#x9501; L&#xFF0C;&#x4E8E;
&#x662F;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668; B &#x5F00;&#x59CB;&#x81EA;&#x65CB;&#x56E0;&#x4E3A;&#x9501;&#x88AB; A &#x5360;&#x6709;&#x800C; A &#x88AB; B &#x6253;&#x65AD;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x91CA;&#x653E;&#x81EA;&#x65CB;&#x9501; L
&#xFF0C;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x662F;&#x65E0;&#x6CD5;&#x62A2;&#x5360;&#x7684;&#x6240;&#x4EE5; B &#x4E00;&#x76F4;&#x81EA;&#x65CB;&#xFF0C;&#x8FD9;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x6B7B;&#x9501;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x4F7F;&#x7528;&#x81EA;&#x65CB;&#x9501;&#x7684;&#x540C;&#x65F6;&#x4E00;&#x822C;&#x4F1A;&#x963B;&#x6B62;&#x4E2D;&#x65AD;&#x7684;&#x53D1;&#x751F;&#xFF0C;Linux &#x5185;&#x6838;&#x751A;&#x81F3;&#x63D0;&#x4F9B;&#x4E86;&#x540C;&#x65F6;&#x5B8C;&#x6210;&#x8FD9;
&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x7684; API -- <code>spin_lock_irqsave()</code>&#x3001;<code>spin_unlock_irqrestore()</code> &#x7B49;&#x7B49;&#x3002;&#x963B;&#x6B62;&#x4E2D;
&#x65AD;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x4E0D;&#x88AB;&#x5F53;&#x524D;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x4E2D;&#x65AD;&#x6253;&#x65AD;&#xFF0C;&#x800C;&#x52A0;&#x9501;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x9632;&#x6B62;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x4EFB;&#x52A1;&#x540C;
&#x65F6;&#x5904;&#x7406;&#x6570;&#x636E;&#x3002;&#x7ED3;&#x5408;&#x8FD9;&#x4E24;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x5904;&#x7406;&#x540C;&#x6B65;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<hr>
<p>&#x4EE5;&#x4E0A;&#x5185;&#x5BB9;&#x662F;&#x6211;&#x9605;&#x8BFB;&#x300A;Linux Kernel Development(Third Edition)&#x300B;&#x65F6;&#x7684;&#x4E00;&#x4E9B;&#x603B;&#x7ED3;&#xFF0C;&#x5982;&#x679C;&#x6709;
&#x9519;&#x8BEF;&#x7684;&#x5730;&#x65B9;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x6307;&#x6B63;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Linux-Kernel/" rel="tag"># Linux Kernel</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/09/16/emacs-c-cpp-python-config/" rel="prev" title="Emacs C、C++、Python 编程的简单配置">
                Emacs C、C++、Python 编程的简单配置 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">74</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#qiang-zhan-preempt"><span class="nav-number">1.</span> <span class="nav-text">抢占（preempt）</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#zhong-duan-interrupt"><span class="nav-number">2.</span> <span class="nav-text">中断（interrupt）</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#zhong-duan-he-qiang-zhan-de-guan-xi"><span class="nav-number">3.</span> <span class="nav-text">中断和抢占的关系</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#qiang-zhan-he-suo-de-guan-xi"><span class="nav-number">4.</span> <span class="nav-text">抢占和锁的关系</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#zhong-duan-he-suo-de-guan-xi"><span class="nav-number">5.</span> <span class="nav-text">中断和锁的关系</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
