<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="C/CPP,读书笔记," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="萨特是 ISO C++标准委员会主席， C++/CLI首席架构师，久负盛名之人，书的质量自然不
用怀疑。这本书是Exceptional系列书籍的第一本，很多人觉得这个系列可以和梅耶的
Effective系列相媲美，虽然名气上它似乎不如后者。梅耶的书读起来很有趣，像一个逗
比给你讲故事，萨特的书读起来相对沉重一些，更像一个老教授在你身边耳提面命。">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《Exceptional C++》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/04/10/exceptional-cpp-not/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="萨特是 ISO C++标准委员会主席， C++/CLI首席架构师，久负盛名之人，书的质量自然不
用怀疑。这本书是Exceptional系列书籍的第一本，很多人觉得这个系列可以和梅耶的
Effective系列相媲美，虽然名气上它似乎不如后者。梅耶的书读起来很有趣，像一个逗
比给你讲故事，萨特的书读起来相对沉重一些，更像一个老教授在你身边耳提面命。">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《Exceptional C++》">
<meta name="twitter:description" content="萨特是 ISO C++标准委员会主席， C++/CLI首席架构师，久负盛名之人，书的质量自然不
用怀疑。这本书是Exceptional系列书籍的第一本，很多人觉得这个系列可以和梅耶的
Effective系列相媲美，虽然名气上它似乎不如后者。梅耶的书读起来很有趣，像一个逗
比给你讲故事，萨特的书读起来相对沉重一些，更像一个老教授在你身边耳提面命。">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/04/10/exceptional-cpp-not/"/>





  <title> 读书札记之 —— 《Exceptional C++》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/04/10/exceptional-cpp-not/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《Exceptional C++》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-04-10T21:27:21+08:00">
                2016-04-10
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8428;&#x7279;&#x662F; ISO C++&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x4E3B;&#x5E2D;&#xFF0C; C++/CLI&#x9996;&#x5E2D;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x4E45;&#x8D1F;&#x76DB;&#x540D;&#x4E4B;&#x4EBA;&#xFF0C;&#x4E66;&#x7684;&#x8D28;&#x91CF;&#x81EA;&#x7136;&#x4E0D;&#x7528;&#x6000;&#x7591;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x662F;<code>Exceptional</code>&#x7CFB;&#x5217;&#x4E66;&#x7C4D;&#x7684;&#x7B2C;&#x4E00;&#x672C;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x53EF;&#x4EE5;&#x548C;&#x6885;&#x8036;&#x7684;
<code>Effective</code>&#x7CFB;&#x5217;&#x76F8;&#x5AB2;&#x7F8E;&#xFF0C;&#x867D;&#x7136;&#x540D;&#x6C14;&#x4E0A;&#x5B83;&#x4F3C;&#x4E4E;&#x4E0D;&#x5982;&#x540E;&#x8005;&#x3002;&#x6885;&#x8036;&#x7684;&#x4E66;&#x8BFB;&#x8D77;&#x6765;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x50CF;&#x4E00;&#x4E2A;&#x9017;&#x6BD4;&#x7ED9;&#x4F60;&#x8BB2;&#x6545;&#x4E8B;&#xFF0C;&#x8428;&#x7279;&#x7684;&#x4E66;&#x8BFB;&#x8D77;&#x6765;&#x76F8;&#x5BF9;&#x6C89;&#x91CD;&#x4E00;&#x4E9B;&#xFF0C;&#x66F4;&#x50CF;&#x4E00;&#x4E2A;&#x8001;&#x6559;&#x6388;&#x5728;&#x4F60;&#x8EAB;&#x8FB9;&#x8033;&#x63D0;&#x9762;&#x547D;&#x3002;</p>
<a id="more"></a>
<h1 id="dui-bi-effective-c">&#x5BF9;&#x6BD4; Effective C++</h1>
<p>&#x5728;&#x300A;Effective STL&#x300B;&#x7684;&#x53C2;&#x8003;&#x6570;&#x76EE;&#x4E2D;&#xFF0C;&#x6885;&#x8036;&#x63D0;&#x5230;&#x4E86; <code>Exceptional</code> &#x7CFB;&#x5217;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x4ED6;&#x8BF4;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x5BF9;&#x4E8E; <code>Effective</code> &#x7CFB;&#x5217;&#x7684;&#x6A21;&#x8303;&#x8865;&#x5145;&#x3002;&#x8D77;&#x521D;&#x6211;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8BC4;&#x8BBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C0F;&#x4EBA;&#x4E4B;&#x5FC3;&#x7684;&#x8BA4;&#x4E3A;&#x6885;&#x8036;&#x5439;&#x725B;&#xFF0C;&#x5F26;&#x5916;&#x4E4B;&#x610F;&#x662F;&#x8FD9;&#x5957;&#x4E66;&#x53EA;&#x662F;<code>Effective</code>&#x7CFB;&#x5217;&#x7684;&#x6CE8;&#x811A;&#xFF0C;&#x6CA1;&#x4ED6;&#x7684;&#x4E66;&#x597D;&#x3002;</p>
<p>&#x770B;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#x6211;&#x7406;&#x89E3;&#x6885;&#x8036;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#x5BF9;&#x4E8E;<code>Effective</code>&#x7CFB;&#x5217;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x8303;&#x8865;&#x5145;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x5728;
<code>Effective</code>&#x7CFB;&#x5217;&#x4E2D;&#x90FD;&#x6709;&#x6D89;&#x53CA;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x90FD;&#x66F4;&#x52A0;&#x7684;&#x8BE6;&#x7EC6;&#x3002;&#x6BD4;&#x5982;&#x300A;ESTL&#x300B;&#x4E2D;&#x63D0;&#x5230;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x5927;&#x5C0F;&#x5199;&#x4E0D;&#x654F;&#x611F;&#x5B57;&#x7B26;&#x4E32;&#x6BD4;&#x8F83;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x4E86;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x548C;&#x4F7F;&#x7528;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x3002;&#x5728;<code>Effective C++</code>&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x8FD9;&#x4E48;&#x8BE6;&#x7EC6;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x770B;&#x8FC7;&#x8FD9;&#x4E9B;&#x4E66;&#x81EA;&#x5DF1;&#x5C31;&#x4F1A;&#x6162;&#x6162;&#x7684;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;<code>Effective</code>&#x7CFB;&#x5217;&#x7684;&#x4E66;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x4E66;&#x597D;&#x3002;&#x6885;&#x8036;&#x6700;&#x8BA9;&#x4EBA;&#x4F69;&#x670D;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#x4ED6;&#x53EF;&#x4EE5;&#x4ECE;&#x6D69;&#x701A;&#x7684;C++&#x7279;&#x6027;&#x4E2D;&#x627E;&#x51FA;&#x90A3;&#x4E9B;&#x65B0;&#x624B;&#x6700;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4ED6;&#x7684;&#x4E66;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x9762;&#x5411;&#x7684;&#x662F;&#x521D;&#x7EA7;&#x5B66;&#x8005;&#xFF08;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x6210;&#x4E3A;C++&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x7B2C;&#x4E8C;&#x672C;&#x4E66;&#xFF09;&#x3002;&#x8428;&#x7279;&#x7684;&#x4E66;&#x662F;&#x9762;&#x5411;&#x4E2D;&#x7EA7;&#x6C34;&#x5E73;&#x7684;C++&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BA8;&#x8BBA;&#x7684;&#x529B;&#x5EA6;&#x4E5F;&#x76F8;&#x5BF9;&#x4F1A;&#x6DF1;&#x4E00;&#x4E9B;&#x3002;</p>
<h1 id="yong-ni-shou-xi-de-te-xing-li-jie-ni-zi-ji-xie-de-dai-ma">&#x7528;&#x4F60;&#x719F;&#x6089;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x7406;&#x89E3;&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;</h1>
<p>&#x8428;&#x7279;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x4E0D;&#x65AD;&#x7684;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x4F7F;&#x7528;&#x4F60;&#x719F;&#x6089;&#x7684;&#x7279;&#x6027;&#x53BB;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x7406;&#x89E3;&#x4F60;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x4E3A;&#x4E86;&#x70AB;&#x6280;&#x53BB;&#x5199;&#x4E00;&#x4E9B;&#x534E;&#x800C;&#x4E0D;&#x5B9E;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x8BA9;&#x6211;&#x60F3;&#x8D77;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#x4E2D;&#x7684;&#x540D;&#x8A00;&#xFF1A;&#x5173;&#x5FC3;&#x4F60;&#x7684;&#x6280;&#x827A;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x4E0A;&#x7B7E;&#x540D;&#x3002;&#x7F16;&#x5199;C++&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x60F3;&#x5F53;&#x7136;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4F60;&#x8DB3;&#x591F;&#x7684;&#x7EC6;&#x5FC3;&#x548C;&#x8010;&#x6027;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x7F16;&#x5199;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5F88;&#x7528;&#x5FC3;&#x7684;&#x601D;&#x8003;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x8D1F;&#x8D23;&#x3002;</p>
<h1 id="yong-yuan-du-zou-zai-jing-tong-c-de-lu-shang">&#x6C38;&#x8FDC;&#x90FD;&#x8D70;&#x5728;&#x7CBE;&#x901A;C++&#x7684;&#x8DEF;&#x4E0A;</h1>
<p>&#x6211;&#x770B;&#x5B8C;<code>effective</code>&#x7CFB;&#x5217;&#x7684;&#x51E0;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x7684;C++&#x7684;&#x5C0F;&#x5B66;&#x751F;&#x6C34;&#x5E73;&#xFF0C;&#x770B;&#x5B8C;&#x8FD9;&#x672C;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x662F;&#x5E7C;&#x513F;&#x56ED;&#x7684;&#x6C34;&#x5E73;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x4E0D;&#x4EC5;&#x4EC5;&#x8BA8;&#x8BBA;&#x4E86;C++&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x600E;&#x6837;&#x7684;&#x5F71;&#x54CD;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#x90FD;&#x6D89;&#x53CA;&#x5230;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x4E66;&#x4E2D;&#x4E0D;&#x65AD;&#x63D0;&#x5230;&#x7684;&#x89E3;&#x8026;&#x95EE;&#x9898;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x83B7;&#x76CA;&#x6700;&#x5927;&#x7684;&#x5185;&#x5BB9;&#x662F;&#xFF1A;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x3001;&#x7C7B;&#x5173;&#x7CFB;&#x7684;&#x8BA8;&#x8BBA;&#x3001;&#x7F16;&#x8BD1;&#x9632;&#x706B;&#x5899;&#x3001;&#x63A5;&#x53E3;&#x89C4;&#x5219;&#x3002;</p>
<h1 id="yi-chang-an-quan-xing">&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x6027;</h1>
<p>&#x5173;&#x4E8E;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x6027;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F30;&#x8BA1;&#x6CA1;&#x6709;&#x54EA;&#x4E00;&#x672C;&#x4E66;&#x6709;&#x8FD9;&#x672C;&#x4E66;&#x8FD9;&#x4E48;&#x5B8C;&#x6574;&#x800C;&#x900F;&#x4FA7;&#x3002;C++&#x7684;&#x5F02;&#x5E38;&#x9971;&#x53D7;&#x8BDF;&#x75C5;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x751A;&#x81F3;&#x76F4;&#x63A5;&#x5EFA;&#x8BAE;&#x4E0D;&#x7528;&#xFF0C;&#x6BD4;&#x5982;<code>Google</code>&#x516C;&#x53F8;&#x7684;C++&#x7F16;&#x7801;&#x89C4;&#x8303;&#x4E2D;&#x5C31;&#x76F4;&#x63A5;&#x7981;&#x7528;&#x5F02;&#x5E38;&#x3002;&#x5176;&#x4E2D;&#x5F88;&#x5927;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x5F88;&#x96BE;&#x5B8C;&#x6210;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x8303;&#x578B;&#x7F16;&#x7801;&#x6765;&#x8BF4;&#x66F4;&#x662F;&#x5982;&#x6B64;&#x3002;<code>Tom Cargill</code>
&#x7684;&#x6587;&#x7AE0;&#x8BA9;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x656C;&#x800C;&#x8FDC;&#x4E4B;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F88;&#x591A;&#x4E66;&#x7C4D;&#x4E2D;&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x7ED9;&#x51FA;&#x7684;&#x5EFA;&#x8BAE;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x6BD4;&#x5982;&#x300A;&#x6DF1;&#x5EA6;&#x63A2;&#x7D22;C++&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x300B;&#x3001;&#x300A;More Effective C++&#x300B;&#x3002;</p>
<p><code>Tom Cargill</code>&#x7684;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x5728;&#x6885;&#x8036;&#x7684;&#x4E66;&#x4E2D;&#x4E5F;&#x6709;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x501F;&#x7740;&#x770B;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x673A;&#x4F1A;&#x6211;&#x4E5F;&#x5C31;&#x8BA4;&#x8BA4;&#x771F;&#x771F;&#x7684;&#x628A;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x597D;&#x597D;&#x7684;&#x8BFB;&#x4E86;&#x4E00;&#x8BFB;&#x3002;&#x770B;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x540E;&#x660E;&#x767D;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x7528;&#x5F02;&#x5E38;&#x662F;&#x6709;&#x5B83;&#x7684;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x5F02;&#x5E38;&#x7684;&#x51FA;&#x73B0;&#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#x5B89;&#x5168;&#x7684;&#x7834;&#x574F;&#x53EF;&#x4EE5;&#x8BF4;&#x9632;&#x4E0D;&#x80DC;&#x9632;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x7F16;&#x5199;&#x8303;&#x578B;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x8D21;&#x732E;&#x4E86;&#x4E00;&#x7AE0;&#x5341;&#x4E8C;&#x4E2A;&#x6761;&#x6B3E;&#x4E13;&#x95E8;&#x8BA8;&#x8BBA;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8428;&#x7279;&#x65E0;&#x975E;&#x60F3;&#x8981;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x4E2D;&#x90A3;&#x4E48;&#x96BE;&#x5199;&#x3002;&#x4F60;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x662F;&#xFF1A;</p>
<ol>
<li>
<p>&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4E0D;&#x662F;&#x98CE;&#x683C;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4F1A;&#x4E25;&#x91CD;&#x7684;&#x5F71;&#x54CD;&#x5230;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li>
<p>&#x4E0D;&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5B8C;&#x6210;&#x4E24;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x8981;&#x6C42;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3002;</p>
</li>
<li>
<p>&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5728;&#x6790;&#x6784;&#x3001;operator delete() &#x548C; operator delete<a href=""></a> &#x4E2D;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
</li>
<li>
<p>&#x4F7F;&#x7528; RAII &#x5355;&#x72EC;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x3002;</p>
</li>
<li>
<p>&#x628A;&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x5355;&#x72EC;&#x653E;&#x7F6E;&#x5728;&#x4E00;&#x5757;&#x513F;&#xFF0C;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#x5728;&#x8C03;&#x7528;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x6709;&#x5F02;&#x5E38;&#x629B;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</li>
</ol>
<h1 id="bian-yi-fang-huo-qiang">&#x7F16;&#x8BD1;&#x9632;&#x706B;&#x5899;</h1>
<p>&#x5176;&#x5B9E;&#x7F16;&#x8BD1;&#x9632;&#x706B;&#x671F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x9632;&#x6B62;&#x7F16;&#x8BD1;&#x4F9D;&#x8D56;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x540C;&#x6837;&#x4E5F;&#x662F;&#x5B9E;&#x73B0;&#x548C;&#x63A5;&#x53E3;&#x5206;&#x79BB;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x628A;&#x79C1;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x5168;&#x90E8;&#x9690;&#x85CF;&#x5728;<code>pimpl_</code>&#x4E4B;&#x540E;&#x3002;&#x5728;<code>effective c++</code>&#x4E00;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x4E24;&#x79CD;&#x964D;&#x4F4E;&#x7F16;&#x8BD1;&#x4F9D;&#x8D56;&#x7684;&#x65B9;&#x5F0F;<code>&#x7EAF;&#x865A;&#x63A5;&#x53E3;&#x7C7B;</code>&#x548C;<code>pimpl</code>&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4E00;&#x76F4;&#x6BD4;&#x8F83;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;<code>&#x7EAF;&#x865A;&#x63A5;&#x53E3;&#x7C7B;</code>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x6F02;&#x4EAE;&#x4E00;&#x4E9B;&#xFF08;&#x539F;&#x8C05;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x6D01;&#x7656;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6309;&#x7167;&#x6211;&#x73B0;&#x5728;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;<code>pimpl</code>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7EC4;&#x5408;&#x800C;&#x524D;&#x8005;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7EE7;&#x627F;&#xFF0C;&#x7EC4;&#x5408;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x8981;&#x8FDC;&#x9AD8;&#x4E8E;&#x7EE7;&#x627F;&#xFF0C;&#x8026;&#x5408;&#x5EA6;&#x4E5F;&#x8981;&#x5C0F;&#x5F88;&#x591A;&#x3002;</p>
<h1 id="lei-guan-xi">&#x7C7B;&#x5173;&#x7CFB;</h1>
<p>&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7ED9;&#x6211;&#x6700;&#x5927;&#x7684;&#x611F;&#x89E6;&#x5C31;&#x662F;&#xFF0C;&#x7EE7;&#x627F;&#x4E0D;&#x662F;<code>OO</code>&#x7684;&#x57FA;&#x7840;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x6CA1;&#x6709;&#x7EE7;&#x627F;&#x5C31;&#x7B97;&#x4E0D;&#x4E0A;<code>OO</code>
&#xFF0C;<code>OO</code> &#x7684;&#x5F3A;&#x5927;&#x5728;&#x4E8E;&#x4F7F;&#x7528;&#x7C7B;&#x5173;&#x7CFB;&#x964D;&#x4F4E;&#x4F9D;&#x8D56;&#xFF0C;&#x800C;&#x5173;&#x7CFB;&#x4E0D;&#x4EC5;&#x4EC5;&#x53EA;&#x6709;&#x7EE7;&#x627F;&#x4E00;&#x79CD;&#xFF08;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5F3A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7EC4;&#x5408;&#x662F;&#x4E00;&#x79CD;&#x76F8;&#x5BF9;&#x5F31;&#x7684;&#x5173;&#x7CFB;&#xFF09;&#x3002;</p>
<h1 id="jie-kou-gui-ze">&#x63A5;&#x53E3;&#x89C4;&#x5219;</h1>
<p><code>Effective C++</code>&#x4E2D;&#x63D0;&#x5230;&#x4E00;&#x4E2A;&#x53CD;&#x76F4;&#x89C9;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x975E;&#x6210;&#x5458;&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F;&#x6210;&#x5458;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x63D0;&#x5230;&#x7684;&#x63A5;&#x53E3;&#x89C4;&#x5219;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x53EA;&#x6709;&#x6210;&#x5458;&#x51FD;&#x6570;&#x624D;&#x80FD;&#x7B97;&#x7684;&#x4E0A;&#x662F;&#x7C7B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x975E;&#x6210;&#x5458;&#x51FD;&#x6570;&#x540C;&#x6837;&#x4E5F;&#x662F;&#x3002;&#x800C;&#x975E;&#x6210;&#x5458;&#x51FD;&#x6570;&#x548C;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x8981;&#x5C0F;&#x4E8E;&#x6210;&#x5458;&#x51FD;&#x6570;&#xFF0C;&#x6269;&#x5C55;&#x6027;&#x8981;&#x5F3A;&#x4E8E;&#x6210;&#x5458;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h1 id="qi-ta-nei-rong">&#x5176;&#x4ED6;&#x5185;&#x5BB9;</h1>
<p>&#x5F53;&#x7136;&#x4E66;&#x4E2D;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x540C;&#x6837;&#x503C;&#x5F97;&#x5927;&#x5BB6;&#x8BA4;&#x771F;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x5305;&#x62EC;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF0C;&#x6A21;&#x677F;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;STL&#x7EC4;&#x4EF6;&#x7684;&#x7528;&#x6CD5;&#x7B49;&#x7B49;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/C-CPP/" rel="tag"># C/CPP</a>
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/04/01/effective-stl-note/" rel="next" title="读书札记之 —— 《Effective STL》">
                <i class="fa fa-chevron-left"></i> 读书札记之 —— 《Effective STL》
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/18/wanqin-minguo-note/" rel="prev" title="读书札记之 —— 《从晚晴到民国》">
                读书札记之 —— 《从晚晴到民国》 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">80</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#dui-bi-effective-c"><span class="nav-number">1.</span> <span class="nav-text">对比 Effective C++</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#yong-ni-shou-xi-de-te-xing-li-jie-ni-zi-ji-xie-de-dai-ma"><span class="nav-number">2.</span> <span class="nav-text">用你熟悉的特性，理解你自己写的代码</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#yong-yuan-du-zou-zai-jing-tong-c-de-lu-shang"><span class="nav-number">3.</span> <span class="nav-text">永远都走在精通C++的路上</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#yi-chang-an-quan-xing"><span class="nav-number">4.</span> <span class="nav-text">异常安全性</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#bian-yi-fang-huo-qiang"><span class="nav-number">5.</span> <span class="nav-text">编译防火墙</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#lei-guan-xi"><span class="nav-number">6.</span> <span class="nav-text">类关系</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#jie-kou-gui-ze"><span class="nav-number">7.</span> <span class="nav-text">接口规则</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#qi-ta-nei-rong"><span class="nav-number">8.</span> <span class="nav-text">其他内容</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
