<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Linux Kernel,LKD," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="Unix 的优点
Linux 承袭了大量 Unix 的设计精华主要包括下面这些：


系统接口简单，也就是说系统调用设计的很合理


一切都是文件，这样就可以把数据和设备的访问统一到 open(), read(), write(),
lseek(), close() 这组系统调用中


使用 C 语言编写，有非常好的可移植性（这个应该是相对与汇编语言来说吧）


快速的进程创建（fork）


简">
<meta property="og:type" content="article">
<meta property="og:title" content="LKD 总结 —— 第一章">
<meta property="og:url" content="http://blog.guorongfei.com/2014/09/18/lkd-chapter-one/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="Unix 的优点
Linux 承袭了大量 Unix 的设计精华主要包括下面这些：


系统接口简单，也就是说系统调用设计的很合理


一切都是文件，这样就可以把数据和设备的访问统一到 open(), read(), write(),
lseek(), close() 这组系统调用中


使用 C 语言编写，有非常好的可移植性（这个应该是相对与汇编语言来说吧）


快速的进程创建（fork）


简">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="LKD 总结 —— 第一章">
<meta name="twitter:description" content="Unix 的优点
Linux 承袭了大量 Unix 的设计精华主要包括下面这些：


系统接口简单，也就是说系统调用设计的很合理


一切都是文件，这样就可以把数据和设备的访问统一到 open(), read(), write(),
lseek(), close() 这组系统调用中


使用 C 语言编写，有非常好的可移植性（这个应该是相对与汇编语言来说吧）


快速的进程创建（fork）


简">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2014/09/18/lkd-chapter-one/"/>





  <title> LKD 总结 —— 第一章 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2014/09/18/lkd-chapter-one/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                LKD 总结 —— 第一章
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2014-09-18T00:00:00+08:00">
                2014-09-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="unix-de-you-dian">Unix &#x7684;&#x4F18;&#x70B9;</h1>
<p>Linux &#x627F;&#x88AD;&#x4E86;&#x5927;&#x91CF; Unix &#x7684;&#x8BBE;&#x8BA1;&#x7CBE;&#x534E;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#xFF1A;</p>
<ul>
<li>
<p>&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;&#x7B80;&#x5355;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x8BBE;&#x8BA1;&#x7684;&#x5F88;&#x5408;&#x7406;</p>
</li>
<li>
<p>&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x636E;&#x548C;&#x8BBE;&#x5907;&#x7684;&#x8BBF;&#x95EE;&#x7EDF;&#x4E00;&#x5230; open(), read(), write(),
lseek(), close() &#x8FD9;&#x7EC4;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4E2D;</p>
</li>
<li>
<p>&#x4F7F;&#x7528; C &#x8BED;&#x8A00;&#x7F16;&#x5199;&#xFF0C;&#x6709;&#x975E;&#x5E38;&#x597D;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF08;&#x8FD9;&#x4E2A;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x5BF9;&#x4E0E;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#x5427;&#xFF09;</p>
</li>
<li>
<p>&#x5FEB;&#x901F;&#x7684;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#xFF08;fork&#xFF09;</p>
</li>
<li>
<p>&#x7B80;&#x5355;&#x800C;&#x7A33;&#x5B9A;&#x7684;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x673A;&#x5236;&#xFF08;IPC&#xFF09;</p>
</li>
</ul>
<a id="more"></a>
<h1 id="cao-zuo-xi-tong-he-gai-shu">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x6982;&#x8FF0;</h1>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#x6307;&#x7684;&#x53EA;&#x662F;&#x5B83;&#x7684;&#x5185;&#x6838;&#x3001;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x800C;&#x4E0D;&#x5305;&#x62EC;&#x5728;&#x4E0A;&#x9762;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x4E0D;&#x8FC7;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B58;&#x5728;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x8BA9;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x8DD1;&#x8D77;&#x6765;&#x5B8C;&#x6210;&#x7528;&#x6237;&#x60F3;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5728;&#x6700;&#x5916;&#x5C42;&#x7528;&#x6765;&#x548C;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x800C;&#x5728;&#x6700;&#x5185;&#x5C42;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x670D;&#x52A1;&#x7684;&#x662F;&#x5185;&#x6838;&#x3002;</p>
<p>&#x5185;&#x6838;&#x4E3B;&#x8981;&#x7531;&#x4EE5;&#x4E0B;&#x51E0;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5904;&#x7406;&#x5668;&#x3001;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x3001;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x3001;
IPC &#x7B49;&#x7B49;&#x3002;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF08;kernel-space&#xFF09;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF08;
user-space&#xFF09;&#x3002;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x548C;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7684;&#x6982;&#x5FF5;&#x9700;&#x8981;&#x65E5;&#x540E;&#x6162;&#x6162;&#x7406;&#x89E3;&#xFF0C;&#x5728; ULK&#xFF08;Understanding
Linux Kernel&#xFF09; &#x91CC;&#x9762;&#x63D0;&#x5230;&#x4E86; CPU &#x6709;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x548C;&#x975E;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#x7B49;&#xFF0C;&#x800C;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x4E00;&#x822C;&#x8FD0;&#x884C;&#x5728;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5219;&#x8FD0;&#x884C;&#x5728;&#x975E;&#x7279;&#x6743;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x79CD;&#x4E24;&#x4E2A;&#x6A21;&#x5F0F;&#x53C8;&#x88AB;&#x6210;&#x4E3A;&#x5185;&#x6838;&#x6A21;&#x5F0F;&#xFF08;kernel mode&#xFF09;&#x548C;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#xFF08;user mode&#xFF09;&#x3002;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x548C;&#x5185;&#x6838;&#x6A21;&#x5F0F;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x6307;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5728;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x4E0A;&#x7684;&#x89E3;&#x91CA;&#x8BF4;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5206;&#x4E3A;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x548C;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x79CD;&#x89E3;&#x91CA;&#x5E94;&#x8BE5;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x5185;&#x6838;&#x5BF9;&#x4E0A;&#x5C42;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x7ED9;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x800C;&#x9677;&#x5165;&#x5230;&#x5185;&#x6838;&#x4E2D;&#x6267;&#x884C;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x4ECE;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x5207;&#x6362;&#x5230;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x5185;&#x6838;&#x8FD0;&#x884C;&#x5728;&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x4E2D;&#x65AD;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#x3002;&#x5BF9;&#x4E0B;&#x5C42;&#x6765;&#x8BF4;&#xFF0C;&#x5185;&#x6838;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x4E2D;&#x65AD;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x4E4B;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x3002;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x8FD0;&#x884C;&#xFF08;&#x8FD0;&#x884C;&#x7684;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF09;&#x5E76;&#x4E14;&#x5185;&#x6838;&#x5904;&#x4E8E;&#x4E2D;&#x65AD;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x90FD;&#x53EA;&#x53EF;&#x80FD;&#x5904;&#x4E8E;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#x4E4B;&#x4E00;&#xFF1A;</p>
<ul>
<li>
<p>&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#xFF0C;&#x6267;&#x884C;&#x8FDB;&#x7A0B;&#x4EE3;&#x7801;</p>
</li>
<li>
<p>&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x7684;&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6267;&#x884C;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF08;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x6B64;&#x65F6;&#x5185;&#x6838;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x66FF;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x662F;&#x8FDB;&#x7A0B;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4E2D;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#xFF09;</p>
</li>
<li>
<p>&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x7684;&#x4E2D;&#x65AD;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x5904;&#x7406;&#x4E2D;&#x65AD;&#xFF08;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7684;&#x8FDB;&#x7A0B;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x80FD;&#x591F;&#x963B;&#x585E;&#xFF0C;&#x4E0D;&#x80FD;&#x7761;&#x7720;&#xFF0C;&#x65E0;&#x6CD5;&#x8C03;&#x5EA6;&#xFF09;</p>
</li>
</ul>
<p>&#x6240;&#x4EE5;&#x5176;&#x5B9E;&#x5185;&#x6838;&#x5E76;&#x6CA1;&#x6709;&#x65E0;&#x65F6;&#x4E0D;&#x523B;&#x7684;&#x5728;&#x8FD0;&#x884C;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6267;&#x884C;&#x7684;&#x662F;&#x7528;&#x6237;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x540E;&#x9762;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x6267;&#x884C;&#x7684;&#x662F;&#x5185;&#x6838;&#x4EE3;&#x7801;&#xFF08;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x6267;&#x884C;&#x4E24;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x4E0A;&#x9762;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5728;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x4F46;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x5B83;&#x7684;&#x5185;&#x6838;&#x5728;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#xFF09;&#x3002;</p>
<h1 id="hong-nei-he-he-wei-nei-he">&#x5B8F;&#x5185;&#x6838;&#x548C;&#x5FAE;&#x5185;&#x6838;</h1>
<p>&#x8FD9;&#x4E24;&#x79CD;&#x5185;&#x6838;&#x7684;&#x4E89;&#x8BBA;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x505C;&#x8FC7;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5927;&#x795E;&#x5854;&#x80FD;&#x9C8D;&#x59C6;&#xFF08;&#x5B66;&#x672F;&#x6D3E;&#x2014;&#x2014;&#x5FAE;&#x5185;&#x6838;&#x6D3E;&#xFF09;&#x548C;&#x6797;&#x7EB3;&#x65AF;&#xFF08;&#x5B9E;&#x7528;&#x6D3E;&#x2014;&#x2014;&#x5B8F;&#x5185;&#x6838;&#x6D3E;&#xFF09;&#x5C31;&#x54EA;&#x79CD;&#x5185;&#x6838;&#x597D;&#x6709;&#x8FC7;&#x6FC0;&#x70C8;&#x7684;&#x4E89;&#x8BBA;&#x3002;&#x5B8F;&#x5185;&#x6838;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x5185;&#x6838;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x9AD8;&#x6548;&#x800C;&#x7B80;&#x5355;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6240;&#x6709;&#x7684;
Unix &#x90FD;&#x662F;&#x5B8F;&#x5185;&#x6838;&#xFF08;&#x5F53;&#x7136;&#x4E5F;&#x5305;&#x62EC;&#x5B83;&#x7684;&#x540E;&#x7EE7;&#x8005; Linux&#xFF09;&#x3002;&#x800C;&#x5FAE;&#x5185;&#x6838;&#x5728;&#x5B66;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x7F8E;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5185;&#x6838;&#x7684;&#x529F;&#x80FD;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x670D;&#x52A1;&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5185;&#x6838;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x670D;&#x52A1;&#x95F4;&#x4EA4;&#x4E92;&#x662F;&#x901A;&#x8FC7; IPC &#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x53EA;&#x6709;&#x6838;&#x5FC3;&#x7684;&#x670D;&#x52A1;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7684;&#x63D0;&#x4F9B;&#x7CFB;&#x7EDF;&#x7684;&#x5065;&#x58EE;&#x6027;&#xFF08;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7EC8;&#x6B62;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x7684;&#x670D;&#x52A1;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x670D;&#x52A1;&#x4E5F;&#x53EF;&#x4EE5;&#x9500;&#x6BC1;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;IPC &#x4E0D;&#x4F46;&#x5F00;&#x9500;&#x975E;&#x5E38;&#x5927;&#x4E5F;&#x6CA1;&#x6709;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x9AD8;&#x6548;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5728;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x548C;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5207;&#x6362;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x5FAE;&#x5185;&#x6838;&#x90FD;&#x628A;&#x670D;&#x52A1;&#x653E;&#x5728;&#x5185;&#x6838;&#x7A7A;&#x95F4;&#xFF08;&#x8FD9;&#x5C31;&#x6709;&#x8FDD;&#x8BBE;&#x8BA1;&#x521D;&#x8877;&#xFF09;&#x3002;</p>
<p>Linux &#x5411;&#x6765;&#x90FD;&#x662F;&#x5B9E;&#x7528;&#x81F3;&#x4E0A;&#x3002;&#x5B83;&#x867D;&#x7136;&#x662F;&#x5B8F;&#x5185;&#x6838;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x652F;&#x6301;&#x6A21;&#x5757;&#x7684;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#xFF0C;&#x4ECE;&#x800C;&#x652F;&#x6301;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x5B83;&#x4E5F;&#x652F;&#x6301;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x5FAE;&#x5185;&#x6838;&#x7684;&#x670D;&#x52A1;&#x6982;&#x5FF5;&#xFF09;&#xFF0C;&#x6B64;&#x5916;&#x5185;&#x6838;&#x672C;&#x8EAB;&#x662F;&#x53EF;&#x62A2;&#x5360;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x7684;&#xFF08;&#x8FD9;&#x7C7B;&#x4F3C;&#x5FAE;&#x5185;&#x6838;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x878D;&#x5408;&#x4E86;&#x5FAE;&#x5185;&#x6838;&#x548C;&#x5B8F;&#x5185;&#x6838;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x65E2;&#x6CA1;&#x6709;&#x5FAE;&#x5185;&#x6838;&#x7684;&#x5F00;&#x9500;&#x53C8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#x3002;</p>
<h1 id="linux-du-you-de-te-dian">Linux &#x72EC;&#x6709;&#x7684;&#x7279;&#x70B9;</h1>
<p>Linux &#x5E76;&#x4E0D;&#x662F; Unix &#x7684;&#x76F4;&#x7CFB;&#x540E;&#x4EE3;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x5B83;&#x90FD;&#x53EF;&#x4EE5;&#x9009;&#x7740;&#x6700;&#x4F73;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x6848;&#x800C;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x65B0;&#x5EFA;&#x4E00;&#x5957;&#x623F;&#x5B50;&#x8981;&#x6BD4;&#x6574;&#x4FEE;&#x4E00;&#x5957;&#x623F;&#x5B50;&#x7B80;&#x5355;&#xFF09;&#x3002;Linux &#x9009;&#x7740;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x6807;&#x51C6;&#x5728;&#x4E8E;&#x662F;&#x5426;&#x6709;&#x5408;&#x7406;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x4F18;&#x96C5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4E8E;&#x5B83;&#x542C;&#x4E0A;&#x53BB;&#x7F8E;&#x4E0D;&#x7F8E;&#x3002;</p>
<h1 id="linux-nei-he-ban-ben">Linux &#x5185;&#x6838;&#x7248;&#x672C;</h1>
<p>&#x5728;&#x4E66;&#x672C;&#x4E0A;&#x63D0;&#x5230;&#x7684;&#x7248;&#x672C;&#x53F7;&#x548C;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4F3C;&#x4E4E;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#xFF0C;&#x4E66;&#x672C;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>2.6.26.1
</code></pre>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x662F;&#x4E3B;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E3A;&#x6B21;&#x7248;&#x672C;&#x53F7;&#x3002;&#x6B21;&#x7248;&#x672C;&#x53F7;&#x51B3;&#x5B9A;&#x5185;&#x6838;&#x7248;&#x672C;&#x662F;&#x5426;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#x3002;&#x5982;&#x679C;&#x6B21;&#x7248;&#x672C;&#x53F7;&#x4E3A;&#x5076;&#x6570;&#x8868;&#x793A;&#x7A33;&#x5B9A;&#x5426;&#x5219;&#x662F;&#x5F00;&#x53D1;&#x7248;&#x672C;&#x3002;&#x7248;&#x672C;&#x53F7;&#x7684;&#x524D;&#x4E24;&#x4F4D;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7CFB;&#x5217;&#x5982; 2.4 &#x7CFB;&#x5217;&#x3002;&#x7B2C;&#x4E09;&#x4E2A;&#x6570;&#x5B57;&#x8868;&#x793A;&#x7248;&#x672C;&#x4FEE;&#x6B63;&#xFF0C;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7CFB;&#x5217;&#x4E2D;&#xFF08;&#x5982; 2.4 &#x7CFB;&#x5217;&#xFF09;&#x56E0;&#x4E3A;BUG &#x4FEE;&#x590D;&#x3001;&#x65B0;&#x9A71;&#x52A8;&#x548C;&#x65B0;&#x7279;&#x6027;&#x7684;&#x52A0;&#x5165;&#x800C;&#x53D1;&#x5E03;&#x7684;&#x65B0;&#x7248;&#x672C;&#xFF08;2.4.1&#xFF09;&#x3002;&#x540C;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x90BB;&#x7684;&#x4FEE;&#x6B63;&#x53F7;&#x4E4B;&#x95F4;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x65B9;&#x6848;&#x5728; 2004 &#x51FA;&#x73B0;&#x4E86;&#x53D8;&#x5316;&#x3002;2.6 &#x5E8F;&#x5217;&#x7684;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x65E0;&#x9650;&#x5EF6;&#x957F;&#xFF0C;&#x524D;&#x9762;&#x4E09;&#x4F4D;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x8FF7;&#x4F60;&#x5F00;&#x53D1;&#x5E8F;&#x5217;&#xFF0C;&#x5982; 2.6.26 &#x5E8F;&#x5217;&#x3002;&#x76F8;&#x90BB;&#x7684;&#x4E24;&#x4E2A;&#x5C0F;&#x7684;&#x5E8F;&#x5217;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x975E;&#x5E38;&#x5927;&#x7684;&#x53D8;&#x5316;&#x3002;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x5F88;&#x957F;&#xFF0C;&#x6BD4;&#x5982; 2.6.26 &#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x7684;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x53EF;&#x80FD;&#x957F;&#x8FBE;&#x6570;&#x6708;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x4E25;&#x91CD;&#x7684; BUG &#x9700;&#x8981;&#x66F4;&#x65B0;&#x7248;&#x672C;&#x53F7;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x7B2C;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;2.6.26.1 &#x4E2D;&#x7684; 1&#xFF0C;&#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x539F;&#x6765;&#x65B9;&#x6848;&#x4E2D;&#x7684;&#x4FEE;&#x6B63;&#x53F7;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A; BUG &#x901A;&#x5E38;&#x662F;&#x76EE;&#x524D;&#x7684;&#x7248;&#x672C;&#xFF08;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x662F; 2.6.27&#xFF09;&#x5BF9;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684; back-port
&#x3002;</p>
<p>&#x5F53;&#x524D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x548C;&#x4E66;&#x4E0A;&#x7684;&#x6709;&#x4E86;&#x8F83;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x6797;&#x7EB3;&#x65AF;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x628A;&#x5185;&#x6838;&#x7248;&#x672C;&#x53F7;&#x4ECE;&#x5197;&#x957F;&#x7684; 2.6 &#x76F4;&#x63A5;&#x8DF3;&#x5230;&#x4E86; 3.0 &#xFF08;&#x501F;&#x53E3;&#x662F;&#x5185;&#x6838;&#x53D1;&#x5E03; 20 &#x5468;&#x5E74;&#xFF0C;&#x4E3A;&#x4E86;&#x5347;&#x7EA7;&#x7248;&#x672C;&#x53F7;&#x4ED6;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x715E;&#x8D39;&#x82E6;&#x5FC3;&#xFF0C;&#x7F51;&#x4E0A;&#x6709;&#x8FD9;&#x4E00;&#x6BB5;&#x6709;&#x8DA3;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5F00;&#x6E90;&#x548C;&#x4E0D;&#x5F00;&#x6E90;&#x7684;&#x533A;&#x522B;<sup class="footnote-ref"><a href="#fn1" id="fnref1">[1]</a></sup>&#xFF09;&#xFF0C;&#x76EE;&#x524D;&#x5185;&#x6838;&#x7248;&#x672C;&#x6F14;&#x5316;&#x5230; 3.17&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x7248;&#x672C;&#x5206;&#x4E3A;&#xFF1A; Prepatch&#x3001;Mainline&#x3001;Stable&#x3001;Longterm &#x56DB;&#x79CD;&#x800C;&#x4E0D;&#x662F;&#x7A33;&#x5B9A;&#x548C;&#x5F00;&#x53D1;&#x4E24;&#x79CD;<sup class="footnote-ref"><a href="#fn2" id="fnref2">[2]</a></sup>&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x518D;&#x51FA;&#x73B0;&#x4E09;&#x4F4D;&#x6570;&#x7684;&#x8FF7;&#x4F60;&#x5F00;&#x53D1;&#x5E8F;&#x5217;&#x3002;</p>
<hr>
<hr class="footnotes-sep">
<section class="footnotes">
<ol class="footnotes-list">
<li id="fn1" class="footnote-item"><p>&#x6797;&#x7EB3;&#x65AF;&#x5B83;&#x867D;&#x7136;&#x521B;&#x9020;&#x4E86; Linux &#x5B83;&#x4E5F;&#x62E5;&#x6709; Linux &#x7684;&#x5546;&#x6807;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x6CA1;&#x6709;&#x6743;&#x5229;&#x89C9;&#x5F97; Linux &#x7684;&#x8D70;&#x5411;&#x3002;Linux &#x5230;&#x5E95;&#x4F1A;&#x5982;&#x4F55;&#x53D1;&#x5C55;&#x8FD8;&#x662F;&#x770B;&#x793E;&#x533A;&#x7684;&#x5168;&#x4F53;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x51B3;&#x5B9A; <a href="#fnref1" class="footnote-backref">&#x21A9;</a></p>
</li>
<li id="fn2" class="footnote-item"><p>&#x76EE;&#x524D;&#x5230;&#x7248;&#x672C;&#x53F7;&#x4E5F;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x6B21;&#x7248;&#x672C;&#x53F7;&#x5230;&#x5947;&#x5076;&#x6027;&#x6765;&#x533A;&#x5206;&#x7A33;&#x5B9A;&#x548C;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x6BD4;&#x5982;&#x76EE;&#x524D;&#x6700;&#x65B0;&#x5230; Stable &#x7248;&#x672C;&#x662F; 3.17.1 (2014-10-22) <a href="#fnref2" class="footnote-backref">&#x21A9;</a></p>
</li>
</ol>
</section>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Linux-Kernel/" rel="tag"># Linux Kernel</a>
          
            <a href="/tags/LKD/" rel="tag"># LKD</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/09/16/emacs-c-cpp-python-config/" rel="next" title="Emacs C、C++、Python 编程的简单配置">
                <i class="fa fa-chevron-left"></i> Emacs C、C++、Python 编程的简单配置
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/09/30/c-language-funny-usage/" rel="prev" title="C 语言的趣味用法">
                C 语言的趣味用法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">80</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#unix-de-you-dian"><span class="nav-number">1.</span> <span class="nav-text">Unix 的优点</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#cao-zuo-xi-tong-he-gai-shu"><span class="nav-number">2.</span> <span class="nav-text">操作系统和概述</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#hong-nei-he-he-wei-nei-he"><span class="nav-number">3.</span> <span class="nav-text">宏内核和微内核</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#linux-du-you-de-te-dian"><span class="nav-number">4.</span> <span class="nav-text">Linux 独有的特点</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#linux-nei-he-ban-ben"><span class="nav-number">5.</span> <span class="nav-text">Linux 内核版本</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
