<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读书笔记," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="这是一部有趣的“野史”，让我了解到正史（教科书）之外的各种史料和观点，给我的感觉
是醍醐灌顶，耳目一新。我高中学文科，对这一段的历史还算了解，书中提到的大事基本
熟悉，只是作者站在一个全新的角度去看待这些事情，给人的体会自然也就不一样了。
《从晚晴到民国》这本书是《晚期七十年》一书的删减版本，至于删减了什么东西我不太
清楚，不过剩下的东西很值得一读。本书覆盖了鸦片战争（1840）年到辛亥革命（19">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《从晚晴到民国》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/04/18/wanqin-minguo-note/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="这是一部有趣的“野史”，让我了解到正史（教科书）之外的各种史料和观点，给我的感觉
是醍醐灌顶，耳目一新。我高中学文科，对这一段的历史还算了解，书中提到的大事基本
熟悉，只是作者站在一个全新的角度去看待这些事情，给人的体会自然也就不一样了。
《从晚晴到民国》这本书是《晚期七十年》一书的删减版本，至于删减了什么东西我不太
清楚，不过剩下的东西很值得一读。本书覆盖了鸦片战争（1840）年到辛亥革命（19">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《从晚晴到民国》">
<meta name="twitter:description" content="这是一部有趣的“野史”，让我了解到正史（教科书）之外的各种史料和观点，给我的感觉
是醍醐灌顶，耳目一新。我高中学文科，对这一段的历史还算了解，书中提到的大事基本
熟悉，只是作者站在一个全新的角度去看待这些事情，给人的体会自然也就不一样了。
《从晚晴到民国》这本书是《晚期七十年》一书的删减版本，至于删减了什么东西我不太
清楚，不过剩下的东西很值得一读。本书覆盖了鸦片战争（1840）年到辛亥革命（19">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/04/18/wanqin-minguo-note/"/>





  <title> 读书札记之 —— 《从晚晴到民国》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/04/18/wanqin-minguo-note/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《从晚晴到民国》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-04-18T10:47:17+08:00">
                2016-04-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x6709;&#x8DA3;&#x7684;&#x201C;&#x91CE;&#x53F2;&#x201D;&#xFF0C;&#x8BA9;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x6B63;&#x53F2;&#xFF08;&#x6559;&#x79D1;&#x4E66;&#xFF09;&#x4E4B;&#x5916;&#x7684;&#x5404;&#x79CD;&#x53F2;&#x6599;&#x548C;&#x89C2;&#x70B9;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#x662F;&#x918D;&#x9190;&#x704C;&#x9876;&#xFF0C;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#x3002;&#x6211;&#x9AD8;&#x4E2D;&#x5B66;&#x6587;&#x79D1;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E00;&#x6BB5;&#x7684;&#x5386;&#x53F2;&#x8FD8;&#x7B97;&#x4E86;&#x89E3;&#xFF0C;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x5927;&#x4E8B;&#x57FA;&#x672C;&#x719F;&#x6089;&#xFF0C;&#x53EA;&#x662F;&#x4F5C;&#x8005;&#x7AD9;&#x5728;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x770B;&#x5F85;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x7ED9;&#x4EBA;&#x7684;&#x4F53;&#x4F1A;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#x3002;</p>
<p>&#x300A;&#x4ECE;&#x665A;&#x6674;&#x5230;&#x6C11;&#x56FD;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x300A;&#x665A;&#x671F;&#x4E03;&#x5341;&#x5E74;&#x300B;&#x4E00;&#x4E66;&#x7684;&#x5220;&#x51CF;&#x7248;&#x672C;&#xFF0C;&#x81F3;&#x4E8E;&#x5220;&#x51CF;&#x4E86;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x6211;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#xFF0C;&#x4E0D;&#x8FC7;&#x5269;&#x4E0B;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x503C;&#x5F97;&#x4E00;&#x8BFB;&#x3002;&#x672C;&#x4E66;&#x8986;&#x76D6;&#x4E86;&#x9E26;&#x7247;&#x6218;&#x4E89;&#xFF08;1840&#xFF09;&#x5E74;&#x5230;&#x8F9B;&#x4EA5;&#x9769;&#x547D;&#xFF08;1911&#xFF09;&#x8FD9;&#x4E03;&#x5341;&#x5E74;&#x5DE6;&#x53F3;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x6309;&#x7167;&#x4F5C;&#x8005;&#x7684;&#x5386;&#x53F2;&#x8F6C;&#x578B;&#x89C2;&#x70B9;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x671F;&#x5341;&#x51E0;&#x5E74;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x5DE8;&#x53D8;&#xFF0C;&#x5E94;&#x8BE5;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7A77;&#x5219;&#x53D8;&#xFF0C;&#x53D8;&#x5219;&#x901A;&#xFF0C;&#x4E0D;&#x901A;&#x518D;&#x53D8;&#xFF0C;&#x5FAA;&#x73AF;&#x5F80;&#x590D;&#x3002;&#x8FD9;&#x6BB5;&#x65F6;&#x671F;&#x5927;&#x6982;&#x662F;200&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x8FD8;&#x5904;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x65F6;&#x671F;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x8FD8;&#x4F1A;&#x5927;&#x53D8;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x56FD;&#x96BE;&#x53F2;&#xFF0C;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#x5F53;&#x4E2D;&#x7684;&#x56FD;&#x4EBA;&#x8EAB;&#x5904;&#x6C34;&#x706B;&#x4E4B;&#x4E2D;&#xFF0C;&#x4EBA;&#x547D;&#x5982;&#x877C;&#x8681;&#xFF0C;&#x60E8;&#x4E0D;&#x582A;&#x8A00;&#x3002;&#x5728;&#x5185;&#x5FE7;&#x5916;&#x60A3;&#x4E4B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x9886;&#x571F;&#x5B8C;&#x6574;&#x3001;&#x4E3B;&#x6743;&#x72EC;&#x7ACB;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E0D;&#x5E78;&#x4E2D;&#x7684;&#x4E07;&#x5E78;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x6CA6;&#x843D;&#x4E3A;&#x6B96;&#x6C11;&#x5730;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x90A3;&#x4E9B;&#x5728;&#x6C11;&#x65CF;&#x5371;&#x4EA1;&#x4E4B;&#x9645;&#x633A;&#x8EAB;&#x800C;&#x51FA;&#x7684;&#x6C11;&#x65CF;&#x82F1;&#x96C4;&#x3002;&#x6211;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6700;&#x5438;&#x5F15;&#x6211;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x4EBA;&#x7684;&#x82F1;&#x96C4;&#x4E8B;&#x8FF9;&#xFF0C;&#x4ED6;&#x4EEC;&#x7406;&#x5F53;&#x540D;&#x5782;&#x9752;&#x53F2;&#xFF0C;&#x6D41;&#x82B3;&#x767E;&#x4E16;&#x3002;</p>
<a id="more"></a>
<h1 id="ya-pian-zhan-zheng">&#x9E26;&#x7247;&#x6218;&#x4E89;</h1>
<blockquote>
<p>&#x6D77;&#x7EB3;&#x767E;&#x5DDD;&#xFF0C;&#x6709;&#x5BB9;&#x4E43;&#x5927;&#xFF1B;&#x58C1;&#x7ACB;&#x5343;&#x4EDE;&#xFF0C;&#x65E0;&#x6B32;&#x5219;&#x521A;</p>
</blockquote>
<p>&#x4E2D;&#x56FD;&#x4F20;&#x7EDF;&#x5C0F;&#x519C;&#x7ECF;&#x6D4E;&#xFF0C;&#x81EA;&#x7ED9;&#x81EA;&#x8DB3;&#xFF0C;&#x82F1;&#x5546;&#x7684;&#x8D27;&#x7269;&#x5728;&#x4E2D;&#x56FD;&#x5356;&#x4E0D;&#x51FA;&#x53BB;&#xFF0C;&#x957F;&#x671F;&#x5904;&#x4E8E;&#x9006;&#x5DEE;&#x72B6;&#x6001;&#x3002;&#x5370;&#x5EA6;&#x6CA6;&#x4E3A;&#x82F1;&#x56FD;&#x6B96;&#x6C11;&#x5730;&#x4E4B;&#x540E;&#xFF0C;&#x4E1C;&#x5370;&#x5EA6;&#x6D0B;&#x516C;&#x53F8;&#x53D1;&#x73B0;&#x4E86;&#x9E26;&#x7247;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x3002;&#x4E3A;&#x4E86;&#x626D;&#x8F6C;&#x8D38;&#x6613;&#x9006;&#x5DEE;&#x4ED6;&#x4EEC;&#x7ADF;&#x7136;&#x516C;&#x5F00;&#x5411;&#x4E2D;&#x56FD;&#x8D29;&#x6BD2;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E27;&#x5C3D;&#x5929;&#x826F;&#x3002;&#x9E26;&#x7247;&#x837C;&#x6BD2;&#x6211;&#x534E;&#x590F;&#x5927;&#x5730;&#xFF0C;&#x4E2D;&#x56FD;&#x5306;&#x5306;&#x5C31;&#x6CA6;&#x843D;&#x4E3A;&#x4E1C;&#x4E9A;&#x75C5;&#x592B;&#x4E86;&#x3002;</p>
<p>&#x4E2D;&#x56FD;&#x8FD1;&#x4EE3;&#x5386;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x4F4D;&#x6C11;&#x65CF;&#x82F1;&#x96C4;&#x6797;&#x5219;&#x5F90;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x7684;&#x864E;&#x95E8;&#x9500;&#x70DF;&#x3002;&#x5F53;&#x7136;&#x5173;&#x4E8E;&#x864E;&#x95E8;&#x9500;&#x70DF;&#x5F88;&#x591A;&#x4EBA;&#x628A;&#x529F;&#x52B3;&#x5168;&#x7ED9;&#x4E86;&#x6797;&#x5219;&#x5F90;&#xFF0C;&#x5176;&#x5B9E;&#x516C;&#x6B63;&#x4E00;&#x70B9;&#x6765;&#x8BF4;&#x9053;&#x5149;&#x7687;&#x5E1D;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x7981;&#x70DF;&#xFF0C;&#x4EFB;&#x547D;&#x6797;&#x5219;&#x5F90;&#x4E3A;&#x94A6;&#x5DEE;&#x5927;&#x81E3;&#x8FDB;&#x884C;&#x7981;&#x70DF;&#xFF0C;&#x4ED6;&#x540C;&#x6837;&#x4E5F;&#x662F;&#x529F;&#x4E0D;&#x53EF;&#x6CA1;&#x7684;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x9053;&#x5149;&#x7687;&#x5E1D;&#x7B7E;&#x5B9A;&#x4E86;&#x5386;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x4E2A;&#x4E0D;&#x5E73;&#x7B49;&#x6761;&#x7EA6;&#x300A;&#x5357;&#x4EAC;&#x6761;&#x7EA6;&#x300B;&#x624D;&#x4F7F;&#x5F97;&#x5B83;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x80CC;&#x4E0A;&#x4E86;&#x4E27;&#x6743;&#x8FB1;&#x56FD;&#x4E4B;&#x540D;&#x3002;</p>
<p>&#x7981;&#x70DF;&#x4E4B;&#x540E;&#xFF0C;&#x82F1;&#x56FD;&#x77AC;&#x95F4;&#x4ECE;&#x8D29;&#x5356;&#x9E26;&#x7247;&#x800C;&#x6765;&#x7684;&#x8D38;&#x6613;&#x987A;&#x5DEE;&#x56DE;&#x5230;&#x539F;&#x6765;&#x7684;&#x9006;&#x5DEE;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x4E86;&#x9E26;&#x7247;&#x6218;&#x4E89;&#x3002;&#x82F1;&#x56FD;&#x65E0;&#x803B;&#x4E4B;&#x5904;&#x5C31;&#x5728;&#x4E8E;&#x660E;&#x77E5;&#x662F;&#x6BD2;&#x54C1;&#x4F9D;&#x65E7;&#x8D29;&#x5356;&#xFF0C;&#x56DE;&#x5934;&#x770B;&#x770B;&#x672C;&#x56FD;&#x5546;&#x4EBA;&#x53C8;&#x4F55;&#x5C1D;&#x4E0D;&#x662F;&#x660E;&#x77E5;&#x5BF9;&#x4EBA;&#x4F53;&#x6709;&#x5BB3;&#x8FD8;&#x4F9D;&#x65E7;&#x9500;&#x552E;&#x5404;&#x79CD;&#x6BD2;&#x5976;&#x7C89;&#x3001;&#x6BD2;&#x5927;&#x7C73;&#x3001;&#x5730;&#x6C9F;&#x6CB9;&#x5462;&#xFF1F;&#x8FD9;&#x4E9B;&#x4EBA;&#x60DF;&#x5229;&#x662F;&#x56FE;&#x548C;&#x90A3;&#x65F6;&#x5019;&#x65E0;&#x803B;&#x7684;&#x82F1;&#x5546;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x662F;&#x771F;&#x6B63;&#x7684;&#x6C11;&#x65CF;&#x8D25;&#x7C7B;&#xFF0C;&#x7A83;&#x56FD;&#x4E4B;&#x8D3C;&#x3002;&#x5F53;&#x9762;&#x6BD2;&#x54C1;&#x6CDB;&#x6EE5;&#xFF0C;&#x9053;&#x5149;&#x5C1A;&#x4E14;&#x77E5;&#x9053;&#x7981;&#x70DF;&#xFF0C;&#x73B0;&#x5728;&#x98DF;&#x54C1;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x6A2A;&#x751F;&#xFF0C;&#x5F53;&#x6743;&#x8005;&#x5374;&#x65E0;&#x6240;&#x4F5C;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x9A82;&#x6E05;&#x5EF7;&#x65E0;&#x80FD;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x53CD;&#x601D;&#x81EA;&#x5DF1;&#x5176;&#x5B9E;&#x66F4;&#x52A0;&#x7684;&#x65E0;&#x80FD;&#x3002;</p>
<p>&#x9E26;&#x7247;&#x6218;&#x4E89;&#x4E4B;&#x540E;&#xFF0C;&#x4E3A;&#x6D0B;&#x4EBA;&#x6240;&#x8FEB;&#xFF0C;&#x6797;&#x5219;&#x5F90;&#x88AB;&#x8D2C;&#x65B0;&#x7586;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x77E5;&#x9053;&#x6797;&#x5219;&#x5F90;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x864E;&#x95E8;&#x785D;&#x70DF;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x662F;&#x5B83;&#x4E3A;&#x5B88;&#x62A4;&#x8FB9;&#x9672;&#x505A;&#x51FA;&#x7684;&#x8D21;&#x732E;&#x3002;&#x6797;&#x5219;&#x5F90;&#x5728;&#x65B0;&#x7586;&#x5F85;&#x4E86;&#x516B;&#x5E74;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FB9;&#x7586;&#x7684;&#x5B89;&#x5371;&#x5341;&#x5206;&#x62C5;&#x5FC3;&#xFF0C;&#x5B83;&#x544A;&#x8001;&#x8FD8;&#x4E61;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4F4D;&#x82F1;&#x96C4;&#x4EBA;&#x7269;&#x5DE6;&#x5B97;&#x68E0;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5DE6;&#x5B97;&#x68E0;&#x6267;&#x610F;&#x6536;&#x590D;&#x65B0;&#x7586;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x53D7;&#x6797;&#x5219;&#x5F90;&#x6240;&#x6258;&#x3002;</p>
<h1 id="shou-fu-xin-jiang">&#x6536;&#x590D;&#x65B0;&#x7586;</h1>
<blockquote>
<p>&#x5927;&#x5C06;&#x7B79;&#x8FB9;&#x5C1A;&#x672A;&#x8FD8;&#xFF0C;&#x6E56;&#x6E58;&#x5B50;&#x5F1F;&#x6EE1;&#x5929;&#x5C71;&#x3002;&#x65B0;&#x683D;&#x6768;&#x67F3;&#x4E09;&#x5343;&#x91CC;&#xFF0C;&#x5F15;&#x5F97;&#x6625;&#x98CE;&#x5EA6;&#x7389;&#x5173;&#x3002;</p>
</blockquote>
<p>&#x5DE6;&#x5B97;&#x68E0;&#x662F;&#x4E00;&#x4EE3;&#x8C6A;&#x6770;&#xFF0C;&#x5149;&#x7EEA;&#x5E74;&#x95F4;&#xFF0C;&#x6E05;&#x5EF7;&#x5185;&#x4E89;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x4E3B;&#x5F20;&#x6D77;&#x9632;&#xFF0C;&#x5DE6;&#x5B97;&#x68E0;&#x4E3B;&#x5F20;&#x8FB9;&#x9632;&#xFF0C;&#x6700;&#x540E;&#x674E;&#x9E3F;&#x7AE0;&#x5EFA;&#x4E86;&#x5317;&#x6D0B;&#x6D77;&#x519B;&#xFF0C;&#x5728;&#x7532;&#x5348;&#x4E2D;&#x65E5;&#x6218;&#x4E89;&#x4E2D;&#x7247;&#x7532;&#x4E0D;&#x5B58;&#xFF1B;&#x800C;&#x5DE6;&#x5B97;&#x68E0;&#x633A;&#x8FD1;&#x8FB9;&#x7586;&#xFF0C;&#x6700;&#x7EC8;&#x6536;&#x590D;&#x4E86;&#x65B0;&#x7586;&#x3002;</p>
<p>&#x65B0;&#x7586;&#x8FB9;&#x9672;&#xFF0C;&#x6C99;&#x4FC4;&#x6276;&#x690D;&#x6D69;&#x7F55;&#x6C57;&#x56FD;&#x963F;&#x53E4;&#x67CF;&#x5360;&#x6211;&#x7586;&#x571F;&#xFF0C;&#x5DE6;&#x5B97;&#x68E0;&#x51FB;&#x8D25;&#x963F;&#x53E4;&#x67CF;&#x6536;&#x590D;&#x65B0;&#x7586;&#x3002;&#x540E;&#x6765;&#x5DE6;&#x5B97;&#x68E0;&#x62AC;&#x68FA;&#x897F;&#x5F81;&#xFF0C;&#x7387;&#x519B;&#x633A;&#x8FD1;&#x4F0A;&#x7281;&#x4EE5;&#x793A;&#x6C99;&#x4FC4;&#x51B3;&#x4E00;&#x6B7B;&#x6218;&#xFF0C;&#x4E3A;&#x300A;&#x4E2D;&#x4FC4;&#x4F0A;&#x7281;&#x6761;&#x7EA6;&#x300B;&#x63D0;&#x4F9B;&#x4E86;&#x519B;&#x4E8B;&#x540E;&#x76FE;&#x3002;&#x6B63;&#x662F;&#x5DE6;&#x5B97;&#x68E0;&#x8FD9;&#x79CD;&#x5927;&#x4E08;&#x592B;&#x6B7B;&#x5F53;&#x9A6C;&#x9769;&#x88F9;&#x5C38;&#x8FD8;&#x7684;&#x6C14;&#x9B44;&#xFF0C;&#x624D;&#x4FDD;&#x6211;&#x4E2D;&#x534E;&#x4E00;&#x767E;&#x516D;&#x5341;&#x4E07;&#x7586;&#x571F;&#x5B89;&#x7136;&#x65E0;&#x6059;&#x4E0D;&#x81F3;&#x4E8E;&#x88AB;&#x6C99;&#x4FC4;&#x541E;&#x5E76;&#x3002;</p>
<h1 id="tai-ping-tian-guo">&#x592A;&#x5E73;&#x5929;&#x56FD;</h1>
<p>&#x6B63;&#x53F2;&#x5F53;&#x4E2D;&#x5BF9;&#x4E8E;&#x592A;&#x5E73;&#x5929;&#x56FD;&#x7684;&#x8BC4;&#x4EF7;&#x7279;&#x522B;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206;&#x7684;&#x53F2;&#x5B66;&#x5927;&#x5E08;&#x5BF9;&#x5B83;&#x90FD;&#x662F;&#x55E4;&#x4E4B;&#x4EE5;&#x9F3B;&#x7684;&#x3002;&#x592A;&#x5E73;&#x5929;&#x56FD;&#x53C8;&#x79F0;&#x4E3A;&#x201C;&#x6D2A;&#x6768;&#x4E4B;&#x4E71;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x6216;&#x8BB8;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x5B83;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x65E5;&#x519B;&#x653B;&#x7834;&#x5357;&#x4EAC;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x4E86;&#x5C60;&#x57CE;&#xFF0C;&#x5176;&#x5B9E;&#x592A;&#x5E73;&#x5929;&#x56FD;&#x65F6;&#x671F;&#x5357;&#x4EAC;&#x540C;&#x6837;&#x88AB;&#x5C60;&#x57CE;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4E09;&#x6B21;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x5C60;&#x57CE;&#x5728;&#x592A;&#x5E73;&#x519B;&#x653B;&#x7834;&#x5357;&#x4EAC;&#x4E4B;&#x540E;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x5728;&#x592A;&#x5E73;&#x519B;&#x5185;&#x4E71;&#x4E4B;&#x65F6;&#xFF0C;&#x7B2C;&#x4E09;&#x6B21;&#x662F;&#x6E58;&#x519B;&#x7834;&#x57CE;&#x4E4B;&#x540E;&#x3002;&#x5357;&#x4EAC;&#x8FD9;&#x4E2A;&#x91D1;&#x7C89;&#x5C0F;&#x5929;&#x5802;&#xFF0C;&#x864E;&#x636E;&#x9F99;&#x87E0;&#x4E4B;&#x5730;&#xFF0C;&#x5E1D;&#x738B;&#x4E4B;&#x90FD;&#xFF0C;&#x767E;&#x5E74;&#x4E4B;&#x5185;&#x5C61;&#x906D;&#x5C60;&#x57CE;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x56FD;&#x4E4B;&#x5927;&#x96BE;&#xFF0C;&#x4E07;&#x6C11;&#x540C;&#x60B2;&#x3002;&#x592A;&#x5E73;&#x519B;&#x5C60;&#x57CE;&#x4E0D;&#x4EC5;&#x4EC5;&#x9650;&#x4E8E;&#x5357;&#x4EAC;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x6CBF;&#x8DEF;&#x653B;&#x4F10;&#x7684;&#x65F6;&#x5019;&#x5728;&#x5168;&#x5DDE;&#x3001;&#x6CA7;&#x5DDE;&#x90FD;&#x6709;&#x5C60;&#x57CE;&#x3002;</p>
<p>&#x592A;&#x5E73;&#x5929;&#x56FD;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x201C;&#x5185;&#x4E71;&#x201D;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x5929;&#x671D;&#x7530;&#x4EA9;&#x5236;&#x5EA6;&#x538B;&#x6839;&#x5C31;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x8FC7;&#xFF0C;&#x4E00;&#x7FA4;&#x611A;&#x6627;&#x65E0;&#x77E5;&#x7684;&#x5C60;&#x592B;&#x5230;&#x5904;&#x70E7;&#x6740;&#x62A2;&#x63A0;&#xFF0C;&#x6BD4;&#x6740;&#x4EBA;&#x516B;&#x767E;&#x4E07;&#x7684;&#x9EC4;&#x5DE2;&#x4E5F;&#x597D;&#x4E0D;&#x4E86;&#x592A;&#x591A;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x592A;&#x5E73;&#x519B;&#x4E2D;&#x4E5F;&#x6709;&#x4EBA;&#x624D;&#xFF0C;&#x77F3;&#x8FBE;&#x5F00;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x9996;&#x5C48;&#x4E00;&#x6307;&#x7684;&#x8C6A;&#x6770;&#x3002;&#x6D2A;&#x79C0;&#x5168;&#x5360;&#x9886;&#x5357;&#x4EAC;&#x5DF2;&#x7136;&#x6210;&#x4E3A;&#x5B59;&#x6743;&#xFF0C;&#x77F3;&#x8FBE;&#x5F00;&#x88AB;&#x6392;&#x6324;&#x4E4B;&#x540E;&#x5175;&#x8D25;&#x5927;&#x6E21;&#x6CB3;&#x5176;&#x5B9E;&#x662F;&#x60F3;&#x8981;&#x7531;&#x6B64;&#x9053;&#x53BB;&#x5929;&#x5E9C;&#x4E4B;&#x56FD;&#x7684;&#x5173;&#x4E2D;&#x5F53;&#x5218;&#x5907;&#xFF0C;&#x8FD9;&#x6837;&#x4E09;&#x8DB3;&#x9F0E;&#x529B;&#x4F30;&#x8BA1;&#x4E2D;&#x56FD;&#x53C8;&#x8981;&#x5408;&#x4E45;&#x5FC5;&#x5206;&#x4E86;&#x3002;&#x77F3;&#x8FBE;&#x5F00;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x5728;&#x5927;&#x6E21;&#x6CB3;&#x88AB;&#x56F4;&#xFF0C;&#x4ED6;&#x4E3A;&#x4E86;&#x4FDD;&#x5168;&#x4ED6;&#x624B;&#x4E0B;&#x7684;&#x5C06;&#x58EB;&#xFF0C;&#x4E3B;&#x52A8;&#x6295;&#x964D;&#xFF0C;&#x540E;&#x6765;&#x88AB;&#x62BC;&#x5F80;&#x6210;&#x90FD;&#x51CC;&#x8FDF;&#x5904;&#x6B7B;&#x3002;&#x4ED6;&#x7B97;&#x662F;&#x6761;&#x6C49;&#x5B50;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6E05;&#x5EF7;&#x80CC;&#x4FE1;&#x5F03;&#x4E49;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x653E;&#x8FC7;&#x4ED6;&#x624B;&#x4E0B;&#x7684;&#x5C06;&#x58EB;&#xFF0C;&#x5C3D;&#x6570;&#x5C60;&#x6740;&#x3002;</p>
<h1 id="jia-wu-zhong-ri-zhan-zheng">&#x7532;&#x5348;&#x4E2D;&#x65E5;&#x6218;&#x4E89;</h1>
<p>&#x7532;&#x5348;&#x4E2D;&#x65E5;&#x6218;&#x4E89;&#x662F;&#x4E2D;&#x56FD;&#x7684;&#x6D0B;&#x52A1;&#x8FD0;&#x52A8;&#x548C;&#x65E5;&#x672C;&#x7684;&#x7EF4;&#x65B0;&#x53D8;&#x6CD5;&#x7684;&#x6210;&#x679C;&#x68C0;&#x9A8C;&#x5382;&#x3002;&#x6700;&#x7EC8;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x5168;&#x519B;&#x8986;&#x6CA1;&#xFF0C;&#x671D;&#x91CE;&#x5927;&#x60CA;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x6210;&#x4E3A;&#x5343;&#x592B;&#x6240;&#x6307;&#x7684;&#x5927;&#x6C49;&#x5978;&#x3002;&#x6559;&#x79D1;&#x4E66;&#x4E0A;&#x603B;&#x662F;&#x4F1A;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x674E;&#x4E2D;&#x5802;&#x7B7E;&#x8BA2;&#x5404;&#x79CD;&#x4E27;&#x6743;&#x8FB1;&#x56FD;&#x7684;&#x6761;&#x7EA6;&#xFF0C;&#x5927;&#x6C49;&#x5978;&#x7684;&#x5F62;&#x8C61;&#x8DC3;&#x7136;&#x7EB8;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x5386;&#x53F2;&#x4E0A;&#x7684;&#x674E;&#x9E3F;&#x7AE0;&#x5B8C;&#x5168;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5F62;&#x8C61;&#xFF0C;&#x4ED6;&#x5316;&#x89E3;&#x6211;&#x56FD;&#x88AB;&#x74DC;&#x5206;&#x7684;&#x5371;&#x673A;&#xFF0C;&#x4FDD;&#x6211;&#x4E3B;&#x6743;&#x5B8C;&#x6574;&#x53EF;&#x4EE5;&#x8BF4;&#x5C45;&#x529F;&#x81F3;&#x4F1F;&#xFF0C;&#x5B83;&#x6700;&#x7EC8;&#x88AB;&#x6C99;&#x4FC4;&#x903C;&#x6B7B;&#x5728;&#x75C5;&#x69BB;&#x4E4B;&#x4E0A;&#x4E5F;&#x53EF;&#x4EE5;&#x7B97;&#x97A0;&#x8EAC;&#x5C3D;&#x7601;&#x6B7B;&#x800C;&#x540E;&#x5DF2;&#x4E86;&#x3002;</p>
<p>&#x9EC4;&#x6D77;&#x6D77;&#x6218;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x4E00;&#x518D;&#x907F;&#x8BA9;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x77E5;&#x9053;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x65E5;&#x519B;&#x7684;&#x5BF9;&#x624B;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x6781;&#x529B;&#x4E3B;&#x548C;&#x4E00;&#x518D;&#x907F;&#x8BA9;&#x3002;&#x6E05;&#x5EF7;&#x5185;&#x90E8;&#x81EA;&#x8EAB;&#x6C89;&#x6EBA;&#x5728;&#x5929;&#x671D;&#x4E0A;&#x56FD;&#x7684;&#x68A6;&#x4E2D;&#xFF0C;&#x8BA4;&#x4E3A;&#x654C;&#x4E0D;&#x8FC7;&#x82F1;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6253;&#x5F39;&#x4E38;&#x5C0F;&#x56FD;&#x65E5;&#x672C;&#x7EF0;&#x7EF0;&#x6709;&#x4F59;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x674E;&#x9E3F;&#x7AE0;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x5207;&#x770B;&#x7684;&#x6E05;&#x6E05;&#x695A;&#x695A;&#xFF0C;&#x7532;&#x5348;&#x60E8;&#x8D25;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x80CC;&#x9ED1;&#x9505;&#x88AB;&#x5343;&#x592B;&#x6240;&#x6307;&#x548C;&#x80CC;&#x9ED1;&#x9505;&#x7684;&#x79E6;&#x6867;&#x662F;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#x3002;</p>
<p>&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x654C;&#x4E0D;&#x8FC7;&#x65E5;&#x672C;&#x6D77;&#x519B;&#x4E0D;&#x8F93;&#x5728;&#x519B;&#x4EBA;&#x7D20;&#x8D28;&#xFF0C;&#x8F93;&#x5728;&#x6B66;&#x5668;&#x88C5;&#x5907;&#x7684;&#x843D;&#x540E;&#x3002;&#x6148;&#x79A7;&#x8001;&#x592A;&#x540E;&#x4E3A;&#x4E86;&#x4FEE;&#x5EFA;&#x9890;&#x548C;&#x56ED;&#x632A;&#x7528;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x7684;&#x519B;&#x8D39;&#xFF0C;&#x5317;&#x6D0B;&#x8230;&#x961F;&#x7684;&#x8239;&#x6162;&#x70AE;&#x949D;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x65E5;&#x519B;&#x7684;&#x5BF9;&#x624B;&#x3002;</p>
<p>&#x9EC4;&#x6D77;&#x5927;&#x6218;&#x4E2D;&#x9093;&#x4E16;&#x660C;&#x4F01;&#x56FE;&#x7528;&#x81F4;&#x8FDC;&#x53F7;&#x649E;&#x6BC1;&#x65E5;&#x519B;&#x5409;&#x91CE;&#x597D;&#xFF0C;&#x4E0D;&#x5E78;&#x88AB;&#x9C7C;&#x96F7;&#x51FB;&#x4E2D;&#xFF0C;&#x4ED6;&#x843D;&#x6C34;&#x4E4B;&#x540E;&#x4E0D;&#x613F;&#x63A5;&#x6536;&#x968F;&#x4ECE;&#x7ED9;&#x7684;&#x6551;&#x751F;&#x5708;&#xFF0C;&#x4E0E;&#x7231;&#x72AC;&#x540C;&#x6C89;&#x5927;&#x6D77;&#xFF0C;&#x58EE;&#x70C8;&#x6B89;&#x56FD;&#x3002;&#x4E00;&#x5E74;&#x540E;&#x5A01;&#x6D77;&#x536B;&#x6D77;&#x6218;&#x4E2D;&#xFF0C;&#x5317;&#x6D0B;&#x6C34;&#x5E08;&#x60E8;&#x8D25;&#xFF0C;&#x5218;&#x6B65;&#x87FE;&#x3001;&#x4E01;&#x6C5D;&#x660C;&#x5148;&#x540E;&#x81EA;&#x6740;&#xFF0C;&#x81EA;&#x53E4;&#x8270;&#x96BE;&#x7EF4;&#x4E00;&#x6B7B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x613F;&#x6295;&#x964D;&#x4EE5;&#x6B7B;&#x62A5;&#x56FD;&#xFF0C;&#x53EF;&#x6B4C;&#x53EF;&#x6CE3;&#x3002;</p>
<h1 id="wu-xu-bian-fa">&#x620A;&#x620C;&#x53D8;&#x6CD5;</h1>
<p>&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x63D0;&#x5230;&#x620A;&#x620C;&#x53D8;&#x6CD5;&#x90FD;&#x4F1A;&#x60F3;&#x5230;&#x5EB7;&#x3001;&#x6881;&#x5E08;&#x5F92;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x53D8;&#x6CD5;&#x4E2D;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x4EBA;&#x7269;&#x662F;&#x5E74;&#x8F7B;&#x7684;&#x5149;&#x7EEA;&#x7687;&#x5E1D;&#x3002;&#x4ED6;&#x4E0D;&#x613F;&#x505A;&#x4EA1;&#x56FD;&#x4E4B;&#x541B;&#xFF0C;&#x51B3;&#x5FC3;&#x53D8;&#x6CD5;&#xFF0C;&#x53D8;&#x6CD5;&#x5931;&#x8D25;&#x4E4B;&#x540E;&#x88AB;&#x5E7D;&#x7981;&#xFF0C;&#x6BD4;&#x8D77;&#x5EB7;&#x3001;&#x6881;&#x4E8C;&#x4EBA;&#x4ED6;&#x662F;&#x4E2A;&#x66F4;&#x52A0;&#x60B2;&#x5267;&#x7684;&#x4EBA;&#x7269;&#x3002;</p>
<p>&#x620A;&#x620C;&#x53D8;&#x6CD5;&#x5931;&#x8D25;&#x8C2D;&#x55E3;&#x540C;&#x4E0D;&#x613F;&#x907F;&#x96BE;&#xFF0C;&#x7518;&#x613F;&#x4E3A;&#x53D8;&#x6CD5;&#x732E;&#x8EAB;&#xFF0C;&#x7559;&#x4E0B;&#x201C;&#x6211;&#x81EA;&#x6A2A;&#x5200;&#x5411;&#x5929;&#x7B11;&#xFF0C;&#x53BB;&#x7559;&#x809D;&#x80C6;&#x4E24;&#x6606;&#x4ED1;&#x201D;&#x7684;&#x7EDD;&#x53E5;&#xFF0C;&#x6D69;&#x6C14;&#x957F;&#x5B58;&#xFF0C;&#x4E2D;&#x534E;&#x6C11;&#x65CF;&#x80FD;&#x591F;&#x8EB2;&#x8FC7;&#x6D69;&#x52AB;&#xFF0C;&#x514D;&#x906D;&#x74DC;&#x5206;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x7537;&#x513F;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<h1 id="ba-guo-lian-jun-qin-hua">&#x516B;&#x56FD;&#x8054;&#x519B;&#x4FB5;&#x534E;</h1>
<p>&#x4E5F;&#x8BB8;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x516B;&#x56FD;&#x8054;&#x519B;&#x4FB5;&#x534E;&#xFF0C;&#x9996;&#x5148;&#x5BA3;&#x6218;&#x7684;&#x662F;&#x6148;&#x79A7;&#x592A;&#x540E;&#x3002;&#x9996;&#x90FD;&#x6CA6;&#x9677;&#xFF0C;&#x751F;&#x7075;&#x6D82;&#x70AD;&#x662F;&#x56FD;&#x4EBA;&#x81EA;&#x5DF1;&#x5F15;&#x8D77;&#x7684;&#x3002;&#x4E49;&#x548C;&#x56E2;&#x653B;&#x6253;&#x4F7F;&#x9986;&#xFF0C;&#x516B;&#x56FD;&#x624D;&#x6709;&#x63A5;&#x53E3;&#x8FDB;&#x519B;&#x5317;&#x4EAC;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x77E5;&#x9053;&#x674E;&#x9E3F;&#x7AE0;&#x4EE3;&#x8868;&#x6E05;&#x5EF7;&#x7B7E;&#x8BA2;&#x8FD9;&#x4E2A;&#x4E0D;&#x5E73;&#x7B49;&#x6761;&#x7EA6;&#xFF0C;&#x8BF4;&#x4ED6;&#x5356;&#x56FD;&#xFF0C;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x674E;&#x9E3F;&#x7AE0;&#xFF0C;&#x4EE5;&#x5F53;&#x65F6;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x4E2D;&#x56FD;&#x5F88;&#x53EF;&#x80FD;&#x88AB;&#x74DC;&#x5206;&#x3002;&#x674E;&#x9E3F;&#x7AE0;&#x6700;&#x9AD8;&#x660E;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#x4ED6;&#x628A;&#x56F4;&#x653B;&#x4F7F;&#x9986;&#x8BF4;&#x6210;&#x662F;&#x201C;&#x62F3;&#x4E71;&#x201D;&#xFF0C;&#x5BA3;&#x6218;&#x8BCF;&#x4E66;&#x662F;&#x4F2A;&#x9020;&#xFF0C;&#x8FD9;&#x6837;&#x4E2D;&#x56FD;&#x4ECE;&#x53C2;&#x6218;&#x56FD;&#x53D8;&#x6210;&#x53D7;&#x5BB3;&#x56FD;&#xFF0C;&#x516B;&#x56FD;&#x8054;&#x519B;&#x5165;&#x4EAC;&#x662F;&#x52A9;&#x527F;&#x62F3;&#x532A;&#x3002;&#x5982;&#x6B64;&#x4EE5;&#x6765;&#x5217;&#x5F3A;&#x6CA1;&#x6709;&#x74DC;&#x5206;&#x63A5;&#x53E3;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x662F;&#x8D54;&#x6B3E;&#x6CA1;&#x6709;&#x5272;&#x5730;&#x3002;</p>
<p>&#x300A;&#x8F9B;&#x4E11;&#x6761;&#x7EA6;&#x300B;&#x4E4B;&#x6240;&#x4EE5;&#x8D54;&#x6B3E;4.5&#x4EBF;&#xFF0C;&#x662F;&#x8868;&#x793A;&#x8981;&#x4E2D;&#x56FD;&#x7684;&#x56DB;&#x4E07;&#x4E07;&#x4E94;&#x5343;&#x4EBA;&#x6BCF;&#x4EBA;&#x8D54;&#x4E00;&#x4E24;&#x767D;&#x94F6;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x674E;&#x9E3F;&#x7AE0;&#x5728;&#x7B7E;&#x8BA2;&#x8FD9;&#x4E2A;&#x6761;&#x7EA6;&#x4E4B;&#x540E;&#x5C31;&#x901D;&#x4E16;&#x4E86;&#xFF0C;&#x4FC4;&#x56FD;&#x5984;&#x56FE;&#x4FB5;&#x5360;&#x6211;&#x56FD;&#x4E1C;&#x5317;&#xFF0C;&#x903C;&#x674E;&#x9E3F;&#x7AE0;&#x548C;&#x4ED6;&#x4EEC;&#x7B7E;&#x8BA2;&#x4E0D;&#x5E73;&#x7B49;&#x6761;&#x7EA6;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x6B7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FC4;&#x56FD;&#x516C;&#x4F7F;&#x8FD8;&#x5728;&#x75C5;&#x69BB;&#x4E4B;&#x4FA7;&#x7D27;&#x903C;&#x3002;&#x674E;&#x9E3F;&#x7AE0;&#x8FD9;&#x4E2A;&#x5BB0;&#x76F8;&#x5408;&#x80A5;&#x5929;&#x4E0B;&#x7626;&#x7684;&#x674E;&#x5BB0;&#x76F8;&#x4E5F;&#x8BB8;&#x6709;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x4F5C;&#x98CE;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x4ED6;&#x662F;&#x6C49;&#x5978;&#xFF0C;&#x8BF4;&#x4ED6;&#x5356;&#x56FD;&#x5C31;&#x771F;&#x7684;&#x6709;&#x5931;&#x504F;&#x9887;&#x4E86;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x674E;&#x9E3F;&#x7AE0;&#x6B7B;&#x524D;&#x63A8;&#x8350;&#x8881;&#x4E16;&#x51EF;&#x62C5;&#x4EFB;&#x5317;&#x6D0B;&#x5927;&#x81E3;&#xFF0C;&#x8FD9;&#x6837;&#x8881;&#x4E16;&#x51EF;&#x624D;&#x4F1A;&#x6276;&#x6447;&#x76F4;&#x4E0A;&#x6210;&#x4E3A;&#x5927;&#x6E05;&#x738B;&#x671D;&#x7684;&#x9876;&#x6881;&#x67F1;&#x3002;</p>
<h1 id="xin-hai-ge-ming">&#x8F9B;&#x4EA5;&#x9769;&#x547D;</h1>
<p>&#x56FD;&#x7236;&#x4E2D;&#x5C71;&#x5148;&#x751F;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5149;&#x9C9C;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x8BF4;&#x4ED6;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x5149;&#x5F69;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x662F;&#x8BF4;&#x4ED6;&#x4E3A;&#x4E86;&#x9769;&#x547D;&#xFF0C;&#x56DB;&#x5904;&#x7B79;&#x6B3E;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x7070;&#x5934;&#x571F;&#x8138;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x751F;&#x8BA1;&#x4ED6;&#x66FE;&#x7ECF;&#x5728;&#x7F8E;&#x56FD;&#x7AEF;&#x76D8;&#x5B50;&#x3002;&#x6B63;&#x662F;&#x4E2D;&#x5C71;&#x5148;&#x751F;&#x8FD9;&#x79CD;&#x4E0D;&#x5C48;&#x4E0D;&#x6320;&#xFF0C;&#x5C61;&#x8D25;&#x5C61;&#x6218;&#x7684;&#x7CBE;&#x795E;&#x624D;&#x4F1A;&#x6709;&#x6211;&#x4EEC;&#x540D;&#x65CF;&#x7684;&#x4ECA;&#x5929;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/04/10/exceptional-cpp-not/" rel="next" title="读书札记之 —— 《Exceptional C++》">
                <i class="fa fa-chevron-left"></i> 读书札记之 —— 《Exceptional C++》
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/22/more-exceptional-cpp-note/" rel="prev" title="读书札记之 —— 《More Exceptional C++》">
                读书札记之 —— 《More Exceptional C++》 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">80</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#ya-pian-zhan-zheng"><span class="nav-number">1.</span> <span class="nav-text">鸦片战争</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#shou-fu-xin-jiang"><span class="nav-number">2.</span> <span class="nav-text">收复新疆</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#tai-ping-tian-guo"><span class="nav-number">3.</span> <span class="nav-text">太平天国</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#jia-wu-zhong-ri-zhan-zheng"><span class="nav-number">4.</span> <span class="nav-text">甲午中日战争</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#wu-xu-bian-fa"><span class="nav-number">5.</span> <span class="nav-text">戊戌变法</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#ba-guo-lian-jun-qin-hua"><span class="nav-number">6.</span> <span class="nav-text">八国联军侵华</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#xin-hai-ge-ming"><span class="nav-number">7.</span> <span class="nav-text">辛亥革命</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
