<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Emacs," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="简介
Emacs 和 Vim 并称 Linux 下的两大编辑神器（不是 IDE，只是编辑器）。一般人认为这两
个编辑器的门槛太高，不容易学，使得很多人都只能敬仰却没有勇气使用它们。其实个人并
不认同这样的看法，Emacs 和 Vim 基本的操作其实并不复杂，而且它们各自都带有非常好
的入门教程。Emacs 在启动页面上会有一个非常通俗易懂的教程（tutorial），如果你关闭
的启动页面，你可以在">
<meta property="og:type" content="article">
<meta property="og:title" content="Emacs C、C++、Python 编程的简单配置">
<meta property="og:url" content="http://blog.guorongfei.com/2014/09/16/emacs-c-cpp-python-config/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="简介
Emacs 和 Vim 并称 Linux 下的两大编辑神器（不是 IDE，只是编辑器）。一般人认为这两
个编辑器的门槛太高，不容易学，使得很多人都只能敬仰却没有勇气使用它们。其实个人并
不认同这样的看法，Emacs 和 Vim 基本的操作其实并不复杂，而且它们各自都带有非常好
的入门教程。Emacs 在启动页面上会有一个非常通俗易懂的教程（tutorial），如果你关闭
的启动页面，你可以在">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Emacs C、C++、Python 编程的简单配置">
<meta name="twitter:description" content="简介
Emacs 和 Vim 并称 Linux 下的两大编辑神器（不是 IDE，只是编辑器）。一般人认为这两
个编辑器的门槛太高，不容易学，使得很多人都只能敬仰却没有勇气使用它们。其实个人并
不认同这样的看法，Emacs 和 Vim 基本的操作其实并不复杂，而且它们各自都带有非常好
的入门教程。Emacs 在启动页面上会有一个非常通俗易懂的教程（tutorial），如果你关闭
的启动页面，你可以在">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2014/09/16/emacs-c-cpp-python-config/"/>





  <title> Emacs C、C++、Python 编程的简单配置 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2014/09/16/emacs-c-cpp-python-config/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Emacs C、C++、Python 编程的简单配置
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2014-09-16T00:00:00+08:00">
                2014-09-16
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="jian-jie">&#x7B80;&#x4ECB;</h1>
<p>Emacs &#x548C; Vim &#x5E76;&#x79F0; Linux &#x4E0B;&#x7684;&#x4E24;&#x5927;&#x7F16;&#x8F91;&#x795E;&#x5668;&#xFF08;&#x4E0D;&#x662F; IDE&#xFF0C;&#x53EA;&#x662F;&#x7F16;&#x8F91;&#x5668;&#xFF09;&#x3002;&#x4E00;&#x822C;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x95E8;&#x69DB;&#x592A;&#x9AD8;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x5B66;&#xFF0C;&#x4F7F;&#x5F97;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x53EA;&#x80FD;&#x656C;&#x4EF0;&#x5374;&#x6CA1;&#x6709;&#x52C7;&#x6C14;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x5176;&#x5B9E;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x8BA4;&#x540C;&#x8FD9;&#x6837;&#x7684;&#x770B;&#x6CD5;&#xFF0C;Emacs &#x548C; Vim &#x57FA;&#x672C;&#x7684;&#x64CD;&#x4F5C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x90FD;&#x5E26;&#x6709;&#x975E;&#x5E38;&#x597D;&#x7684;&#x5165;&#x95E8;&#x6559;&#x7A0B;&#x3002;Emacs &#x5728;&#x542F;&#x52A8;&#x9875;&#x9762;&#x4E0A;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#x7684;&#x6559;&#x7A0B;&#xFF08;tutorial&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5173;&#x95ED;&#x7684;&#x542F;&#x52A8;&#x9875;&#x9762;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x83DC;&#x5355;&#x680F;&#x7684; Help &#x4E0B;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x6559;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5173;&#x95ED;&#x7684;&#x83DC;&#x5355;&#x680F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; M-x
&#xFF08;&#x4E5F;&#x5C31;&#x662F; Alt + x&#xFF09;&#x6267;&#x884C;&#x547D;&#x4EE4; menu-bar-mode &#x663E;&#x793A;&#x83DC;&#x5355;&#x680F;&#x3002;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x8FD9;&#x4EFD;&#x6559;&#x7A0B;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x7684;&#x4EF7;&#x503C;&#x6BD4;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8D44;&#x6599;&#x90FD;&#x66F4;&#x9AD8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x8FC7; Emacs &#x6216;&#x8005;&#x8BF4;&#x4F60;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x5B83;&#x7684;&#x8BDD;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x5148;&#x9605;&#x8BFB;&#x8FD9;&#x4EFD;&#x6587;&#x6863;&#x3002;</p>
<a id="more"></a>
<p>Emacs &#x548C; Vim &#x90FD;&#x6709;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x53EF;&#x5B9A;&#x5236;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x63D2;&#x4EF6;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x9AD8;&#x5EA6;&#x7684;&#x5B9A;&#x5236;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7684;&#x79F0;&#x624B;&#xFF08;&#x6709;&#x5B83;&#x8BE5;&#x6709;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6700;&#x4E3B;&#x8981;&#x662F;&#x4E0D;&#x8BE5;&#x6709;&#x7684;&#x529F;&#x80FD;&#x5B83;&#x6CA1;&#x6709;&#xFF09;&#x3002;&#x8FD9;&#x5927;&#x6982;&#x4E5F;&#x662F;&#x5B83;&#x4EEC;&#x6BD4;&#x4E00;&#x822C;&#x7684; IDE &#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x5427;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x51E1;&#x4E8B;&#x90FD;&#x6709;&#x5B83;&#x7684;&#x5229;&#x5F0A;&#xFF0C;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x603B;&#x662F;&#x6709;&#x70B9;&#x4EE3;&#x4EF7;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x914D;&#x7F6E;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x633A;&#x82B1;&#x65F6;&#x95F4;&#x7684;&#x3002;&#x6211;&#x4F7F;&#x7528;
Emacs &#x7684;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x5F88;&#x957F;&#xFF0C;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x8DCC;&#x8DCC;&#x649E;&#x649E;&#xFF0C;&#x76EE;&#x524D;&#x4E5F;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x76F8;&#x5BF9;&#x719F;&#x6089;&#x8FD9;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x800C;&#x5DF2;&#x3002;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x70AB;&#x8000;&#x81EA;&#x5DF1;&#x7684;&#x914D;&#x7F6E;&#x6709;&#x591A;&#x5389;&#x5BB3;&#xFF0C;&#x800C;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x603B;&#x7ED3;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x521D;&#x5B66;&#x8005;&#x5728;&#x914D;&#x7F6E; Emacs &#x65F6;&#x7684;&#x75DB;&#x82E6;&#x3002;&#x672C;&#x6587;&#x5982;&#x679C;&#x6709;&#x758F;&#x6F0F;&#x3001;&#x9519;&#x8BEF;&#x7684;&#x5730;&#x65B9;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x6307;&#x6B63;&#x51FA;&#x6765;&#x3002;</p>
<h1 id="pei-zhi-mu-biao">&#x914D;&#x7F6E;&#x76EE;&#x6807;</h1>
<p>&#x7531;&#x4E8E;&#x672C;&#x4EBA;&#x4E3B;&#x8981;&#x4F7F;&#x7528; Emacs &#x505A; c&#x3001;c++ &#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6587;&#x7684;&#x914D;&#x7F6E;&#x76EE;&#x6807;&#x4E3B;&#x8981;&#x662F;&#x628A; Emacs &#x914D;&#x7F6E;&#x6210;&#x4E00;&#x4E2A;&#x9002;&#x5408; c &#x548C; c++ &#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3002;&#x53E6;&#x5916;&#x6211;&#x4E5F;&#x5728;&#x95F2;&#x6687;&#x4E4B;&#x4F59;&#x5B66;&#x4E00;&#x70B9; Python&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7684;&#x914D;&#x7F6E;&#x4E5F;&#x4F1A;&#x6D89;&#x53CA;&#x5230; Python &#x7684;&#x76F8;&#x5173;&#x914D;&#x7F6E;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5C31;&#x7F16;&#x7A0B;&#x800C;&#x8A00;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x914D;&#x7F6E;&#x5BF9;&#x4E8E;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x53D1;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x5177;&#x4F53;&#x8BED;&#x8A00;&#x7684;&#x914D;&#x7F6E;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x591A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981; Emacs &#x505A;&#x5176;&#x4ED6;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x672C;&#x6587;&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x5BF9;&#x4F60;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x672C;&#x6587;&#x7684;&#x914D;&#x7F6E;&#x662F;&#x57FA;&#x4E8E; Emacs 24 &#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x76EE;&#x524D;&#x5B89;&#x88C5;&#x7684;&#x7248;&#x672C;&#x4F4E;&#x4E8E;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x5EFA;&#x8BAE;&#x4F60;&#x5347;&#x7EA7;&#x5230;&#x8BE5;&#x7248;&#x672C;&#x3002;&#x56E0;&#x4E3A; Emacs 24 &#x81EA;&#x5E26;&#x4E86;&#x5305;&#x7BA1;&#x7406;&#x5668; package&#xFF0C;&#x6709;&#x4E86;&#x5B83;&#x5B89;&#x88C5;&#x548C;&#x914D;&#x7F6E;&#x63D2;&#x4EF6;&#x7684;&#x96BE;&#x5EA6;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7684;&#x964D;&#x4F4E;&#x3002;</p>
<h1 id="pei-zhi-wen-jian-ji-qi-jie-gou">&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53CA;&#x5176;&#x7ED3;&#x6784;</h1>
<p>&#x5728;&#x8BB2;&#x89E3;&#x5177;&#x4F53;&#x7684;&#x914D;&#x7F6E;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x5148;&#x8BF4;&#x4E00;&#x4E0B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x5B83;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x6240;&#x8C13;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5B98;&#x65B9;&#x540D;&#x79F0;&#x53EB;&#x505A;&#x521D;&#x59CB;&#x5316;&#x6587;&#x4EF6;&#xFF08;initialization file&#xFF0C;&#x6216;&#x8005; init file&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5982;&#x679C;&#x5B58;&#x5728;&#x7684;&#x8BDD;&#xFF0C;Emacs
&#x5728;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x52A0;&#x8F7D;&#x5E76;&#x89E3;&#x6790;&#x5B83;&#x3002;Emacs &#x4F1A;&#x67E5;&#x627E;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x6587;&#x4EF6;&#xFF1A; &#x2018;~/.emacs&#x2019;, &#x2018;~/.emacs.el&#x2019;
, &#x6216;&#x8005;&#x2018;~/.emacs.d/init.el&#x2019;&#xFF0C;&#x5176;&#x4E2D; &#x2019;&#xFF5E;&#x2018; &#x8868;&#x793A;&#x4F60;&#x7684; home &#x76EE;&#x5F55;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E09;&#x8005;&#x4E4B;&#x4E00;&#x4F5C;&#x4E3A;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x4E2A;&#x7528;&#x7684;&#x591A;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#x4E3B;&#x8981;&#x662F;&#x8BF4;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6309;&#x7167;&#x600E;&#x4E48;&#x6837;&#x4E00;&#x79CD;&#x5E03;&#x5C40;&#x4E66;&#x5199;&#xFF0C;Emacs &#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x8981;&#x6C42;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x6765;&#x7EC4;&#x7EC7;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x4F60;&#x65E5;&#x540E;&#x7684;&#x67E5;&#x9605;&#x548C;&#x4FEE;&#x6539;&#xFF08;&#x4F60;&#x4E00;&#x5B9A;&#x4F1A;&#x7ECF;&#x5E38;&#x6539;&#x52A8;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4F1A;&#x7231;&#x4E0A; Emacs &#x7684;&#x914D;&#x7F6E;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x90FD;&#x4F1A;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x89C4;&#x8303;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x4F7F;&#x7528;&#x4F55;&#x79CD;&#x89C4;&#x8303;&#xFF0C;&#x4F46;&#x662F;&#x597D;&#x7684;&#x89C4;&#x8303;&#x53EF;&#x4EE5;&#x8BA9;&#x4EBA;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x8BFB;&#x61C2;&#x4EE3;&#x7801;&#x3002;&#x8BB0;&#x4F4F;&#x7F16;&#x7A0B;&#x9996;&#x5148;&#x662F;&#x5199;&#x7ED9;&#x4EBA;&#x770B;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x662F;&#x5199;&#x7ED9;&#x673A;&#x5668;&#x770B;&#xFF08;&#x8FD9;&#x53E5;&#x8BDD;&#x51FA;&#x81EA;&#x300A;&#x4EE3;&#x7801;&#x5927;&#x5168;&#x300B;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x6309;&#x7167;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x7EC4;&#x7EC7;&#x6211;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x9700;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x56FA;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<ol>
<li>&#x6587;&#x6863;&#x6CE8;&#x91CA;</li>
<li>&#x63D2;&#x4EF6;&#x65E0;&#x5173;&#x7684;&#x516C;&#x5171;&#x8BBE;&#x7F6E;&#xFF08;Emacs &#x81EA;&#x5E26;&#x7684;&#x4E00;&#x4E9B;&#x8BBE;&#x7F6E;&#xFF09;</li>
<li>&#x516C;&#x5171;&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#xFF08;&#x548C;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x7684;&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#xFF09;</li>
<li>&#x7279;&#x6B8A;&#x914D;&#x7F6E;&#xFF08;&#x5982;&#x9488;&#x5BF9;&#x5355;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x5177;&#x4F53;&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#xFF09;</li>
<li>&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#xFF08;&#x628A;&#x5B83;&#x653E;&#x5728;&#x6700;&#x540E;&#x9762;&#x662F;&#x56E0;&#x4E3A;&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#x53EF;&#x80FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x76F8;&#x5173;&#x63D2;&#x4EF6;&#xFF09;</li>
</ol>
<h1 id="pei-zhi-nei-rong">&#x914D;&#x7F6E;&#x5185;&#x5BB9;</h1>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x8BF4;&#x5177;&#x4F53;&#x7684;&#x914D;&#x7F6E;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x7ED3;&#x6784;&#x9010;&#x70B9;&#x5C55;&#x5F00;&#x3002;&#x5B8C;&#x6574;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x4ECE; <a href="https://github.com/zhaohuaxishi/emacsbackup" target="_blank" rel="external">&#x8FD9;&#x91CC;</a>&#x4E0B;&#x8F7D;.</p>
<h2 id="cha-jian-wu-guan-de-gong-gong-she-zhi">&#x63D2;&#x4EF6;&#x65E0;&#x5173;&#x7684;&#x516C;&#x5171;&#x8BBE;&#x7F6E;</h2>
<h3 id="zai-mode-line-shang-xian-shi-xing-lie-hao">&#x5728; mode line &#x4E0A;&#x663E;&#x793A;&#x884C;&#x5217;&#x53F7;</h3>
<p>&#x9996;&#x5148;&#x8981;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F; mode line&#xFF0C;&#x4E00;&#x4E2A;&#x521A;&#x521A;&#x542F;&#x52A8;&#x7684; Emacs &#x754C;&#x9762;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x5206;&#x6210;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x533A;&#x57DF;&#x3002;&#x6700;&#x4E0A;&#x9762;&#x662F;&#x83DC;&#x5355;&#x680F;&#xFF0C;&#x4E0B;&#x9762;&#x7D27;&#x6328;&#x7740;&#x5DE5;&#x5177;&#x680F;&#xFF08;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x8F83;&#x5927;&#x7684;&#x7F16;&#x8F91;&#x533A;&#x57DF;&#xFF0C;&#x4E0A;&#x9762;&#x8FD9;&#x4E24;&#x5757;&#x4E00;&#x822C;&#x4F1A;&#x88AB;&#x9690;&#x85CF;&#x8D77;&#x6765;&#xFF09;&#x3002;&#x5728;&#x6700;&#x5E95;&#x90E8;&#x662F;&#x4E00;&#x4E2A; echo &#x533A;&#x57DF;&#xFF08;echo area&#xFF0C;&#x624D;&#x758F;&#x5B66;&#x6D45;&#x5B9E;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x7FFB;&#x8BD1; echo
&#x4E3A;&#x597D;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x7528;&#x6765;&#x663E;&#x793A;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x7528;&#x6765;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x6267;&#x884C; Emacs &#x547D;&#x4EE4;&#x3002;&#x5939;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x5927;&#x5757;&#x533A;&#x57DF;&#x5728; Emacs &#x4E2D;&#x88AB;&#x79F0;&#x4E3A;&#x7A97;&#x53E3;&#xFF08;window&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7A97;&#x53E3;&#x548C;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x91CC;&#x9762;&#x7684;&#x7A97;&#x53E3;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5728; Emacs &#x4E2D;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x7684;&#x7A97;&#x53E3;&#x4E00;&#x822C;&#x79F0;&#x4E3A;&#x6846;&#x67B6;&#xFF08;frame&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x8C13;&#x7684; mode line &#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x6700;&#x4E0B;&#x9762;&#x7A81;&#x8D77;&#x7684;&#x90A3;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x628A;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#x6DFB;&#x52A0;&#x5230;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x53EF;&#x4EE5;&#x5728; mode line &#x4E2D;&#x663E;&#x793A;&#x884C;&#x5217;&#x53F7;</p>
<figure class="highlight lisp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line"><span class="comment">;; &#x5728; mode line &#x4E0A;&#x663E;&#x793A;&#x884C;&#x5217;&#x53F7;</span></div><div class="line">(<span class="name">setq</span> column-number-mode <span class="number">1</span>)</div><div class="line">(<span class="name">setq</span> line-number-mode <span class="number">1</span>)</div></pre></td></tr></table></figure>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; linum-mode &#x5728; buffer &#x7684;&#x5DE6;&#x8FB9;&#x5217;&#x51FA;&#x6CA1;&#x4E00;&#x884C;&#x7684;&#x884C;&#x53F7;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; M-x
linum-mode &#x6765;&#x6682;&#x65F6;&#x6253;&#x5F00;&#x548C;&#x5173;&#x95ED;&#x884C;&#x53F7;&#x663E;&#x793A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A; (global-linum-mode) &#x52A0;&#x5165;&#x5230;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x663E;&#x793A;&#x884C;&#x53F7;&#x3002;</p>
<h3 id="qu-diao-gun-dong-tiao-cai-dan-lan-he-gong-ju-lan">&#x53BB;&#x6389;&#x6EDA;&#x52A8;&#x6761;&#x3001;&#x83DC;&#x5355;&#x680F;&#x548C;&#x5DE5;&#x5177;&#x680F;</h3>
<p>&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x8F83;&#x5927;&#x7684;&#x7F16;&#x8F91;&#x533A;&#x57DF;&#xFF0C;Emacs &#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x914D;&#x7F6E;&#x4F7F;&#x5F97;&#x4F60;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x5316;&#x4F60;&#x7684;&#x7F16;&#x8F91;&#x533A;&#x57DF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF08;&#x5199;&#x5230;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#xFF09;&#x6765;&#x53BB;&#x6389;&#x6EDA;&#x52A8;&#x6761;&#x3001;&#x83DC;&#x5355;&#x680F;&#x3001;&#x5DE5;&#x5177;&#x680F;&#x3002;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">;; &#x53D6;&#x6D88;&#x6EDA;&#x52A8;&#x680F;&#xFF0C;&#x5DE5;&#x5177;&#x680F;</div><div class="line">(tool-bar-mode <span class="number">0</span>)</div><div class="line">(menu-bar-mode <span class="number">0</span>)</div><div class="line">(scroll-bar-mode <span class="number">0</span>)</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x8FD8;&#x4F1A;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#xFF08;tool-bar-mode nil&#xFF09;&#x3002;&#x5728;
Emacs 24 &#x4E2D;&#x4F7F;&#x7528; nil &#x597D;&#x50CF;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x4E0A;&#x9762;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#x4F7F;&#x7528; nil &#x53C8;&#x53EF;&#x4EE5;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7EDF;&#x4E00;&#x98CE;&#x683C;&#xFF0C;&#x6211;&#x4E00;&#x5F8B;&#x4F7F;&#x7528; 0 &#x8868;&#x793A;&#x5426;&#x5B9A;&#x503C;&#x3002;</p>
<h3 id="guan-bi-emacs-de-qi-shi-huan-ying-ye-mian">&#x5173;&#x95ED; Emacs &#x7684;&#x8D77;&#x59CB;&#x6B22;&#x8FCE;&#x9875;&#x9762;</h3>
<p>Emacs &#x7684;&#x8D77;&#x59CB;&#x6B22;&#x8FCE;&#x9875;&#x9762;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#x5E2E;&#x52A9;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x5404;&#x65B9;&#x9762;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x5B98;&#x65B9;&#x7684;&#x6559;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x6765;&#x8BF4;&#x5B83;&#x6709;&#x70B9;&#x788D;&#x4E8B;&#xFF0C;&#x4E5F;&#x5F71;&#x54CD;&#x7F8E;&#x89C2;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x5173;&#x95ED;&#x5B83;&#x3002;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">;; &#x5173;&#x95ED;emacs&#x542F;&#x52A8;&#x65F6;&#x7684;&#x9875;&#x9762;</div><div class="line">(setq inhibit-startup-message <span class="number">1</span>)</div><div class="line">(setq gnus-inhibit-startup-message <span class="number">1</span>)</div></pre></td></tr></table></figure>
<h3 id="yi-y-n-dai-biao-yes-no">&#x4EE5; y/n&#x4EE3;&#x8868; yes/no</h3>
<p>Emacs &#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x786E;&#x8BA4;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x5728;&#x6CA1;&#x6709;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5173;&#x95ED; Emacs&#xFF0C;&#x5B83;&#x4F1A;&#x8981;&#x4F60;&#x786E;&#x8BA4;&#x662F;&#x5426;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x9700;&#x8981;&#x8F93;&#x5165; yes &#x6765;&#x8868;&#x793A;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x5F88;&#x7E41;&#x7410;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x6539;&#x53D8;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#xFF0C;&#x628A; yes&#x3001;no &#x6539;&#x6210; y&#x3001;n&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">;; &#x4EE5; y/n&#x4EE3;&#x8868; yes/no</div><div class="line">(fset &apos;yes-or-no-p &apos;y-or-n-p)</div></pre></td></tr></table></figure>
<h3 id="bei-fen-she-zhi">&#x5907;&#x4EFD;&#x8BBE;&#x7F6E;</h3>
<p>&#x4F7F;&#x7528; Emacs &#x7F16;&#x8F91;&#x6587;&#x4EF6;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x591A;&#x51FA;&#x4E00;&#x4E9B;&#x4EE5; ~ &#x7ED3;&#x5C3E;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x8005;&#x6216;&#x8005;&#x4F60;&#x6709;&#x8F7B;&#x5FAE;&#x5F3A;&#x8FEB;&#x75C7;&#xFF08;&#x6211;&#x5C31;&#x662F;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x96BE;&#x5FCD;&#x53D7;&#x7684;&#xFF0C;&#x6211;&#x539F;&#x6765;&#x7ECF;&#x5E38;&#x4F1A;&#x53BB;&#x5220;&#x9664;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#xFF0C;&#x76F4;&#x5230;&#x540E;&#x6765;&#x627E;&#x5230;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x5F0F;&#x3002;&#x5728; Emacs &#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5907;&#x4EFD;&#x7B56;&#x7565;&#xFF0C;&#x5305;&#x62EC;&#x5907;&#x4EFD;&#x51E0;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x5907;&#x4EFD;&#x5230;&#x54EA;&#x91CC;&#x7B49;&#x7B49;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x7684;&#x5907;&#x4EFD;&#x7B56;&#x7565;&#x8BBE;&#x7F6E;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line">;;; &#x8BBE;&#x7F6E;&#x5907;&#x4EFD;&#x7B56;&#x7565;</div><div class="line">(setq make-backup-files t)</div><div class="line">(setq kept-old-versions 2)</div><div class="line">(setq kept-new-versions 2)</div><div class="line">(setq delete-old-versions t)</div><div class="line">(setq backup-directory-alist &apos;((&quot;&quot; . &quot;~/.emacsbackup&quot;)))</div></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x4F60;&#x5B8C;&#x5168;&#x4E0D;&#x60F3;&#x5907;&#x4EFD;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A; make-backup-files &#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF0C;&#x4E0D;&#x8FC7;&#x5907;&#x4EFD;&#x6587;&#x4EF6;&#x5728;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E76;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F60;&#x90A3;&#x6837;&#x505A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x5907;&#x4EFD;&#x6587;&#x4EF6;&#x51FA;&#x73B0;&#x5728;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E13;&#x95E8;&#x5B58;&#x653E;&#x4F60;&#x7684;&#x5907;&#x4EFD;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528; backup-directory-alist &#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4F60;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x5C31;&#x628A;&#x5B83;&#x8BBE;&#x7F6E;&#x5728;&#x81EA;&#x5DF1;&#x7684; home &#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x6587;&#x4EF6;&#x5939;&#xFF08;.emacsbackup
&#xFF09;&#x4E0B;&#x9762;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x914D;&#x7F6E;&#x4E2D;&#x95F4;&#x7684;&#x4E09;&#x6761;&#x8BED;&#x53E5;&#x662F;&#x6307;&#x660E;&#x4F60;&#x7684;&#x5907;&#x4EFD;&#x7B56;&#x7565;&#xFF0C;&#x4FDD;&#x5B58;&#x6700;&#x8001;&#x7684; 2 &#x4EFD;&#x6570;&#x636E;&#x548C;&#x6700;&#x65B0;&#x7684; 2 &#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x5220;&#x9664;&#x5176;&#x4F59;&#x7684;&#x5907;&#x4EFD;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x6539;&#x53D8;&#x5176;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x4EE5;&#x4FDD;&#x5B58;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4EFD;&#x6570;&#x3002;</p>
<h2 id="gong-gong-cha-jian-pei-zhi">&#x516C;&#x5171;&#x63D2;&#x4EF6;&#x914D;&#x7F6E;</h2>
<p>Emacs &#x7684;&#x63D2;&#x4EF6;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F8;&#x5173;&#x7684;&#x63D2;&#x4EF6;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6211;&#x5E73;&#x5E38;&#x4F7F;&#x7528;&#x8F83;&#x591A;&#x7684;&#x63D2;&#x4EF6;&#x3002;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x63D2;&#x4EF6;&#xFF1A;</p>
<ul>
<li>
<p>package: &#x5305;&#x7BA1;&#x7406;&#x63D2;&#x4EF6;</p>
</li>
<li>
<p>autopair: &#x62EC;&#x53F7;&#x7684;&#x81EA;&#x52A8;&#x5339;&#x914D;</p>
</li>
<li>
<p>yasnippet: &#x4EE3;&#x7801;&#x5757;&#x6269;&#x5C55;</p>
</li>
<li>
<p>auto-complete: &#x4EE3;&#x7801;&#x667A;&#x80FD;&#x8865;&#x5168;</p>
</li>
<li>
<p>evil: &#x7ED9; emacs &#x52A0;&#x5165; vim &#x7684;&#x529F;&#x80FD;</p>
</li>
<li>
<p>desktop: &#x4FDD;&#x5B58;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;</p>
</li>
<li>
<p>ido: &#x5FEB;&#x901F;&#x7684;&#x67E5;&#x627E;&#x6587;&#x4EF6;&#x3001;&#x5207;&#x6362; buffer</p>
</li>
<li>
<p>smex: &#x5FEB;&#x901F;&#x7684;&#x8F93;&#x5165; emacs &#x547D;&#x4EE4;</p>
</li>
<li>
<p>gtags: &#x4EE3;&#x7801;&#x8DF3;&#x8F6C;&#xFF0C;&#x6E90;&#x7801;&#x9605;&#x8BFB;&#x795E;&#x5668;</p>
</li>
<li>
<p>fill-column-indicator: &#x7528;&#x4E8E;&#x63D0;&#x793A;&#x6BCF;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x5B57;&#x7B26;&#x9650;&#x5236;</p>
</li>
<li>
<p>doxymacs: &#x5199;&#x6CE8;&#x91CA;&#x975E;&#x5E38;&#x65B9;&#x4FBF;</p>
</li>
<li>
<p>jedi: &#x552F;&#x4E00;&#x9700;&#x8981;&#x7684; python &#x63D2;&#x4EF6;&#x3002;&#x529F;&#x80FD;&#x5E94;&#x6709;&#x5C3D;&#x6709;</p>
</li>
</ul>
<p>&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x63D2;&#x4EF6;&#x662F;&#x4E00;&#x4E9B;&#x516C;&#x7528;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x548C;&#x5177;&#x4F53;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;&#x63D2;&#x4EF6;&#x6211;&#x4E3B;&#x8981;&#x7528;&#x5728;&#xA0;c&#x3001;cpp &#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x7684;&#x63D2;&#x4EF6;&#x4E3B;&#x8981;&#x7528;&#x5728; Python &#x5F00;&#x53D1;&#x4E2D;&#x3002;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x63D2;&#x4EF6;&#x3002;</p>
<h3 id="bao-guan-li-cha-jian-package">&#x5305;&#x7BA1;&#x7406;&#x63D2;&#x4EF6; &#x2014;&#x2014; package</h3>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x8981;&#x9686;&#x91CD;&#x4ECB;&#x7ECD;&#x7684;&#x63D2;&#x4EF6;&#x662F; package&#xFF0C;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x662F; Emacs 24 &#x81EA;&#x5E26;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x65B9;&#x4FBF;&#x7684;&#x7BA1;&#x7406;&#x5404;&#x79CD;&#x63D2;&#x4EF6;&#x3002;&#x4ECB;&#x7ECD;&#x5B83;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x5148;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B; ELPA &#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;ELPA &#x662F; Emacs Lisp Package
Archive &#x7684;&#x7F29;&#x5199;&#xFF0C;&#x5B83;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#xFF08;&#x4E5F;&#x5C31;&#x662F; Lisp Package&#xFF09;&#x4ED3;&#x5E93;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6253;&#x5305;&#x597D;&#x4E86;&#x7684; Emacs Lisp &#x4EE3;&#x7801;&#xFF08;&#x63D2;&#x4EF6;&#x7528; Emacs Lisp &#x8BED;&#x8A00;&#x7F16;&#x5199;&#xFF0C;Emacs Lisp &#x662F; Lisp &#x8BED;&#x8A00;&#x7684;&#x53D8;&#x79CD;&#xFF0C;&#x7EA7;&#x522B;&#x5E94;&#x8BE5;&#x76F8;&#x5F53;&#x4E8E;&#x662F; Scheme &#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x6863;&#x5176;&#x5B9E;&#x4E5F;&#x662F; Emacs Lisp &#x8BED;&#x8A00;&#x7F16;&#x5199;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053; Emacs &#x7684;&#x53EF;&#x5B9A;&#x5236;&#x6027;&#x548C;&#x6269;&#x5C55;&#x6027;&#x90FD;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x4F7F;&#x5F97; Emacs &#x7684;&#x63D2;&#x4EF6;&#x4E0D;&#x8BA1;&#x5176;&#x6570;&#xFF0C;&#x5B89;&#x88C5;&#x548C;&#x7BA1;&#x7406;&#x8FD9;&#x4E9B;&#x63D2;&#x4EF6;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7684;&#x7E41;&#x6742;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86; ELPA&#xFF0C;&#x628A;&#x63D2;&#x4EF6;&#x7EDF;&#x4E00;&#x8D77;&#x6765;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x4FBF;&#x6377;&#x65B9;&#x5F0F;&#x4ECE;&#x4ED3;&#x5E93;&#x4E2D;&#x4E0B;&#x8F7D;&#x548C;&#x66F4;&#x65B0;&#x6211;&#x4EEC;&#x7684;&#x63D2;&#x4EF6;&#x3002;&#x800C;&#x8FD9;&#x79CD;&#x4FBF;&#x6377;&#x7684;&#x64CD;&#x4F5C;&#x4F9D;&#x7136;&#x662F;&#x901A;&#x8FC7;&#x63D2;&#x4EF6;&#x5B8C;&#x6210;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684; package &#x63D2;&#x4EF6;&#xFF0C;&#x5B83;&#x5185;&#x7F6E;&#x5728; Emacs 24 &#x4E2D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x4E0D;&#x662F; Emacs 24&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x5148;&#x5347;&#x7EA7;&#x5230; 24 &#x7248;&#x672C;&#x3002;</p>
<p>&#x56E0;&#x4E3A; package &#x662F;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#xFF0C;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x5B83;&#x4ED3;&#x5E93;&#xFF08;
ELPA&#xFF09;&#x7684;&#x4F4D;&#x7F6E;&#x5373;&#x53EF;&#x3002;ELPA &#x6709;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x8F83;&#x591A;&#x7684;&#x662F; MELPA&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x63D2;&#x4EF6;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x63D2;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x9762;&#x627E;&#x5230;&#x3002;&#x4E0B;&#x9762;&#x662F; package &#x7684;&#x8BBE;&#x7F6E;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">;; &#x8BBE;&#x7F6E; package system&#xFF0C;&#x8FD9;&#x91CC;&#x4F7F;&#x7528; MELPA&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5305;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5E94;&#x6709;&#x5C3D;&#x6709;</div><div class="line">(require &apos;package)</div><div class="line">(add-to-list &apos;package-archives</div><div class="line">             &apos;(&quot;melpa&quot; . &quot;http://melpa.milkbox.net/packages/&quot;) t)</div><div class="line">(package-initialize)</div></pre></td></tr></table></figure>
<p>&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x6F0F;&#x6389;&#x4E86;&#x6700;&#x540E;&#x7684; (package-initialize)&#x3002;&#x8BBE;&#x7F6E;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6267;&#x884C;
list-packages &#xA0;&#x547D;&#x4EE4;&#xFF08;&#x901A;&#x8FC7; M-x &#x7136;&#x540E;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#xFF09;&#x6765;&#x67E5;&#x770B;&#x6240;&#x6709;&#x7684;&#x5305;&#xFF0C;&#x5728;&#x67E5;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5305;&#x4E4B;&#x540E;&#x5728;&#x6539;&#x884C;&#x8F93;&#x5165; i &#x6807;&#x8BB0;&#x4F60;&#x8981;&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x5165; x &#x6267;&#x884C;&#x4F60;&#x7684;&#x5B89;&#x88C5;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x5B89;&#x88C5;&#x5230;&#x4F60;&#x7684; Emacs &#x4E2D;&#x53BB;&#x4E86;&#xFF08;&#x5728; ~/.emacs.d/elpa/ &#x76EE;&#x5F55;&#x4E0B;&#x9762;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6709;&#x5305;&#x9700;&#x8981;&#x66F4;&#x65B0;&#xFF0C;&#x5728;&#x4F60;&#x6267;&#x884C; list-package &#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x5728; echo &#x533A;&#x57DF;&#x4F1A;&#x6709;&#x63D0;&#x793A;&#xFF0C;&#x6B64;&#x65F6;&#x76F4;&#x63A5;&#x8F93;&#x5165; U &#x7136;&#x540E;&#x8F93;&#x5165; x &#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x5305;&#x3002;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x5220;&#x9664;&#x4F60;&#x5B89;&#x88C5;&#x7684;&#x5305;&#xFF0C;&#x65B9;&#x5F0F;&#x662F;&#x5728;&#x4F60;&#x60F3;&#x8981;&#x5220;&#x9664;&#x7684;&#x5305;&#x4E0A;&#x9762;&#x8F93;&#x5165;
d &#x7136;&#x540E;&#x8F93;&#x5165; x &#x6267;&#x884C;&#x5B83;&#x3002;</p>
<p>&#x5F88;&#x65B9;&#x4FBF;&#x5427;&#xFF0C;&#x540E;&#x9762;&#x63D0;&#x5230;&#x7684;&#x63D2;&#x4EF6;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#xFF0C;&#x4EE5;&#x540E;&#x4E0D;&#x518D;&#x91CD;&#x590D;&#x3002;</p>
<h3 id="gua-hao-zi-dong-pi-pei-autopair">&#x62EC;&#x53F7;&#x81EA;&#x52A8;&#x5339;&#x914D; &#x2014;&#x2014; <a href="https://github.com/capitaomorte/autopair" target="_blank" rel="external">autopair</a></h3>
<p>&#x5728;&#x7F16;&#x5199;&#x5927;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x62EC;&#x53F7;&#x5339;&#x914D;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x9002;&#x5408;&#x6211;&#x4EEC;&#x8F93;&#x5165; &apos;(&apos; &#x7684;&#x9002;&#x5408;&#x975E;&#x5E38;&#x5E0C;&#x671B;&#x80FD; Emacs &#x81EA;&#x52A8;&#x8865;&#x5168; &apos;)&apos; &#x5E76;&#x4E14;&#x628A;&#x5149;&#x6807;&#x505C;&#x5230;&#x4E24;&#x8005;&#x4E2D;&#x95F4;&#x3002;&#x53EF;&#x662F; Emacs &#x5E76;&#x9ED8;&#x8BA4;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x81EA;&#x5E26;&#x7684;&#x6A21;&#x5F0F; electric-pair-mode &#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; M-x &#x6765;&#x5F00;&#x542F;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x52A0;&#x5165;&#x5230;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x53BB;&#x3002;&#x6211;&#x5C1D;&#x8BD5;&#x8FC7;&#x4F7F;&#x7528; electric-pair-mode &#x4F46;&#x662F;&#x611F;&#x89C9;&#x4E0D;&#x5982; autopair &#x597D;&#x7528;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x4E86; autopair&#x3002;</p>
<p>&#x901A;&#x8FC7; package &#x5B89;&#x88C5;&#x4E4B;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; M-x autopair-mode &#x6765;&#x5F00;&#x542F;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4ED6;&#x52A0;&#x5165;&#x5230;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x9488;&#x5BF9;&#x67D0;&#x79CD;&#x4E3B;&#x6A21;&#x5F0F;&#x5F00;&#x542F;&#x3002;&#x5BF9;&#x4E8E; Emacs &#x7684;&#x5927;&#x591A;&#x662F;&#x63D2;&#x4EF6;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x8FD9;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x4F7F;&#x7528;&#x5B83;&#xFF1A;</p>
<ul>
<li>
<p>&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;:</p>
<p>M-x autopaire-mode</p>
</li>
<li>
<p>&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x628A;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#x5199;&#x5165;&#x5230;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#xFF1A;</p>
</li>
</ul>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">(autopair-global-mode)</div></pre></td></tr></table></figure>
<ul>
<li>&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5BF9;&#x7279;&#x6B8A;&#x7684;&#x4E3B;&#x6A21;&#x5F0F;&#x4E0B;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</li>
</ul>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">(add-hook &apos;c-mode-common-hook &apos;autopair-mode)</div></pre></td></tr></table></figure>
<p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x7684;&#x63D2;&#x4EF6;&#x90FD;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x91CD;&#x590D;&#x5B83;&#x4EEC;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6700;&#x4F73;&#x7684;&#x65B9;&#x5F0F;&#x662F; google &#x4E00;&#x4E0B;&#xFF0C;&#x67E5;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x4E3B;&#x9875;&#xFF08;&#x4E00;&#x822C;&#x5728; github &#x4E0A;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x770B;&#x4E0A;&#x9762;&#x7684;&#x5B98;&#x65B9;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x6211;&#x5728;&#x6BCF;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x540D;&#x5B57;&#x4E0A;&#x52A0;&#x4E86;&#x5B98;&#x7F51;&#x94FE;&#x63A5;&#xFF0C;&#x65B9;&#x4FBF;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#x67E5;&#x9605;&#x3002;</p>
<h3 id="dai-ma-kuo-zhan-shen-qi-yasnippet-he-dai-ma-bu-quan-shen-qi-auto-complete">&#x4EE3;&#x7801;&#x6269;&#x5C55;&#x795E;&#x5668; <a href="https://github.com/capitaomorte/yasnippet" target="_blank" rel="external">yasnippet</a> &#x548C;&#x4EE3;&#x7801;&#x8865;&#x5168;&#x795E;&#x5668; <a href="http://cx4a.org/software/auto-complete/manual.html" target="_blank" rel="external">auto-complete</a></h3>
<p>&#x8FD9;&#x4E24;&#x6B3E;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x7F16;&#x7A0B;&#x5FC5;&#x5907;&#x7684;&#x3002;&#x5176;&#x4E2D; yasnippet &#x662F;&#x7528;&#x6765;&#x505A;&#x4EE3;&#x7801;&#x6269;&#x5C55;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x5728;&#x7F16;&#x5199; .c
&#x6587;&#x4EF6;&#x65F6;&#x8F93;&#x5165; io &#x7136;&#x540E;&#x6309;&#x4E0B;&#x6269;&#x5C55;&#x952E;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x6210; #include &lt;stdio.h&gt;&#xFF0C;&#x8F93;&#x5165; d &#x7136;&#x540E;&#x6309;&#x4E0B;&#x6269;&#x5C55;&#x952E;&#x4E4B;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x8865;&#x5168;&#x6210; #define&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x4FBF;&#x6377;&#x3002;&#x800C; auto-complete &#x5219;&#x662F;&#x7528;&#x6765;&#x505A;&#x4EE3;&#x7801;&#x8865;&#x5168;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x5728; .c &#x6587;&#x4EF6;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570; <code>my_function</code>&#x3001;&#x548C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF; <code>my_name</code>&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x8F93;&#x5165; my &#x7684;&#x65F6;&#x5019;&#x5B83;&#x4F1A;&#x628A; <code>my_function</code> &#x548C; <code>my_name</code> &#x5217;&#x51FA;&#x6765;&#x4F9B;&#x4F60;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x57FA;&#x672C;&#x4E0A;&#x7684; IDE &#x90FD;&#x6709;&#x63D0;&#x4F9B;&#xFF0C;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x5E76;&#x4E0D;&#x964C;&#x751F;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x6B3E;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x8BF4;&#x6B8A;&#x9014;&#x540C;&#x5F52;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x7406;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x6700;&#x540E;&#x90FD;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x4EE3;&#x7801;&#x8F93;&#x5165;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x524D;&#x8005;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7528;&#x4E8E;&#x6269;&#x5C55;&#x7684; snippet&#xFF0C;&#x800C;&#x540E;&#x8005;&#x597D;&#x50CF;&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x5BF9;
buffer &#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x8BCD;&#x6765;&#x63D0;&#x4F9B;&#x8865;&#x5168;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x4E24;&#x6B3E;&#x63D2;&#x4EF6;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x4E86; TAB &#x952E;&#xFF0C; yasnippt &#x7528;&#x5B83;&#x6765;&#x4F5C;&#x4E3A;&#x6269;&#x5C55;&#x952E;&#xFF0C;&#x800C; auto-complete &#x7528;&#x6765;&#x662F;&#x4F5C;&#x4E3A;&#x63D0;&#x793A;&#x89E6;&#x53D1;&#x952E;&#x548C;&#x9009;&#x62E9;&#x952E;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x51B2;&#x7A81;&#xFF0C;&#x6211;&#x8BD5;&#x8FC7;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x7B2C;&#x4E00;&#xFF0C;&#x5173;&#x95ED;
auto-complete &#x7684;&#x81EA;&#x52A8;&#x63D0;&#x793A;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4F60;&#x6309;&#x4E0B; TAB &#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x6709;&#x76F8;&#x5173;&#x7684; yasnippt &#x4EE3;&#x7801;&#x6269;&#x5C55;&#xFF0C;&#x4F1A;&#x5148;&#x8FDB;&#x884C; yasnippt &#x6269;&#x5C55;&#xFF0C;&#x7136;&#x540E;&#x662F; auto-complete &#x8865;&#x5168;&#x63D0;&#x793A;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x66F4;&#x6539;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x7684;&#x4FC3;&#x53D1;&#x6309;&#x952E;&#xFF0C;&#x6211;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E2D;&#x65B9;&#x6CD5;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x7684;&#x76F8;&#x5173;&#x8BBE;&#x7F6E;:</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div></pre></td><td class="code"><pre><div class="line">;; yasnippet setting</div><div class="line">(yas-global-mode 1)</div><div class="line">(define-key yas-minor-mode-map (kbd &quot;&lt;tab&gt;&quot;) nil)</div><div class="line">(define-key yas-minor-mode-map (kbd &quot;TAB&quot;) nil)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f2 &#x4E3A; yas &#x6269;&#x5C55;&#x5FEB;&#x6377;&#x952E;</div><div class="line">(define-key yas-minor-mode-map (kbd &quot;&lt;f2&gt;&quot;) &apos;yas-expand)</div><div class="line"></div><div class="line">;; auto-complete</div><div class="line">(ac-config-default)</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x662F;&#x628A; yasnippt &#x7684;&#x6269;&#x5C55;&#x952E;&#x53BB;&#x6389;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4ED6;&#x91CD;&#x65B0;&#x7ED1;&#x5B9A;&#x5230; f2 &#x4E0A;&#xFF08;&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#x7684;&#x8BBE;&#x7F6E;&#x6211;&#x4E00;&#x822C;&#x653E;&#x5728;&#x4E86;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x6700;&#x672B;&#x5C3E;&#xFF0C;&#x5199;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BB2;&#x89E3;&#xFF09;&#x3002;</p>
<h3 id="vim-he-emacs-de-rong-he-evil">Vim &#x548C; Emacs &#x7684;&#x878D;&#x5408; &#x2014;&#x2014; <a href="https://gitorious.org/evil/pages/Home" target="_blank" rel="external">EVIL</a></h3>
<p>Evil&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x63D2;&#x4EF6;&#x6B63;&#x5982;&#x5176;&#x540D;&#xFF0C;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x5230;&#x90AA;&#x6076;&#x7684;&#x5730;&#x6B65;&#x3002;&#x5728; Linux &#x9886;&#x57DF;&#x6709;&#x4E00;&#x573A;&#x65F7;&#x65E5;&#x6301;&#x4E45;&#x7684;&#x7F16;&#x8F91;&#x4E4B;&#x6218;&#xFF0C;&#x4F7F;&#x7528;&#x53F7;&#x79F0;&#x201C;&#x7F16;&#x8F91;&#x5668;&#x4E4B;&#x795E;&#x201D;&#x7684; Vim &#x7684; V &#x515A;&#x548C;&#x4F7F;&#x7528;&#x53F7;&#x79F0;&#x201C;&#x795E;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x201D;&#x7684; Emacs &#x7684; E &#x515A;&#x5435;&#x7684;&#x4E0D;&#x53EF;&#x5F00;&#x4EA4;&#xFF0C;&#x53EA;&#x4E3A;&#x4E86;&#x4E89;&#x593A;&#x6700;&#x597D;&#x7528;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x865A;&#x540D;&#x3002;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x4F7F;&#x7528;
Emacs&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x627F;&#x8BA4; Vim &#x4E00;&#x6837;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x5B83;&#x7684; normal mode &#x7528;&#x6765;&#x67E5;&#x770B;&#x6587;&#x6863;&#x8981;&#x6BD4; Emacs &#x597D;&#x7528;&#x7684;&#x591A;&#xFF0C;Vim &#x53EF;&#x4EE5;&#x901A;&#x8FC7; hjkl &#x6765;&#x79FB;&#x52A8;&#x5149;&#x6807;&#xFF0C;&#x800C; Emacs &#x9700;&#x8981;&#x6309; C-p C-n C-f C-b &#x8FD9;&#x4E9B;&#x7EC4;&#x5408;&#x952E;&#x3002;&#x4F46;&#x662F; Vim &#x7684;&#x7F16;&#x8F91;&#x80FD;&#x529B;&#x786E;&#x5B9E;&#x76F8;&#x5BF9;&#x6CA1;&#x6709; Emacs &#x5F3A;&#xFF0C; Vim &#x5728;&#x8F93;&#x5165;&#x7684;&#x65F6;&#x5019;&#x65E0;&#x6CD5;&#x4F7F;&#x7528; hjkl &#x6765;&#x5B9A;&#x4F4D;&#x5149;&#x6807;&#xFF0C;&#x800C; Emacs &#x7684;&#x6309;&#x952E;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x628A;&#x4E24;&#x8005;&#x7684;&#x7CBE;&#x534E;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F97;&#x5230;&#x4E16;&#x4E0A;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x7F16;&#x8F91;&#x5668; &#x201C;Emacsim&#x201D;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x8981;&#x4ECB;&#x7ECD;&#x7684; Evil&#x3002;<strong>E</strong>xtensible <strong>Vi</strong> <strong>L</strong>ayer for Emacs&#xFF0C;&#x5B83;&#x662F; Emacs &#x7684;&#x4E00;&#x4E2A; Vi &#x6269;&#x5C55;&#x5C42;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5728; Emacs &#x4E0A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Vim &#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x5B83;&#x7684;&#x9009;&#x62E9;&#x529F;&#x80FD;&#x548C;&#x65B9;&#x4FBF;&#x7684;&#x6587;&#x672C;&#x9605;&#x8BFB;&#x529F;&#x80FD;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x4E24;&#x5927;&#x795E;&#x5668;&#x7684;&#x878D;&#x5408;&#x96BE;&#x514D;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x548C;&#x8C10;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6BD4;&#x5982;&#x6309;&#x952E;&#x4E0A;&#x7684;&#x51B2;&#x7A81;&#x662F;&#x5728;&#x6240;&#x96BE;&#x514D;&#x7684;&#xFF0C;&#x597D;&#x5728;
Evil &#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x7F6E;&#x6309;&#x952E;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x6536;&#x96C6;&#x7684;&#x4E00;&#x4E9B;&#x6309;&#x952E;&#x91CD;&#x7ED1;&#x5B9A;&#x3002;&#x8FD9;&#x4E9B;&#x6309;&#x952E;&#x7684;&#x91CD;&#x65B0;&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x4E24;&#x8005;&#x7684;&#x878D;&#x5408;&#x66F4;&#x52A0;&#x7684;&#x878D;&#x6D3D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x6309;&#x952E;&#x4ECE;&#x7ED1;&#x5B9A;&#x3002;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div></pre></td><td class="code"><pre><div class="line">;; evil &#x628A; emcas &#x548C; vim &#x7684;&#x7CBE;&#x534E;&#x7CC5;&#x5408;&#x5728;&#x4E00;&#x8D77;</div><div class="line">(evil-mode 1)</div><div class="line"></div><div class="line">;; normal mode &#x4E0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; &quot;,,&quot; &#x6765;&#x5207;&#x6362; buffer&#xFF0C;&#x53D6;&#x6D88; q &#x6309;&#x952E;&#x7ED1;&#x5B9A;</div><div class="line">(define-key evil-normal-state-map (kbd &quot;,,&quot;) &apos;evil-buffer)</div><div class="line">(define-key evil-normal-state-map (kbd &quot;q&quot;) nil)</div><div class="line"></div><div class="line">;; &#x8F93;&#x5165;&#x6A21;&#x5F0F;&#x4E0B;&#x53D6;&#x6D88;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x8F93;&#x5165;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x7684;&#x79FB;&#x52A8;&#x5149;&#x6807;</div><div class="line">(define-key evil-insert-state-map (kbd &quot;C-e&quot;) nil)</div><div class="line">(define-key evil-insert-state-map (kbd &quot;C-d&quot;) nil)</div><div class="line">(define-key evil-insert-state-map (kbd &quot;C-k&quot;) nil)</div><div class="line">(define-key evil-insert-state-map (kbd &quot;C-g&quot;) &apos;evil-normal-state)</div><div class="line"></div><div class="line">;; &#x5176;&#x4ED6;&#x7ED1;&#x5B9A;</div><div class="line">(define-key evil-motion-state-map (kbd &quot;C-e&quot;) nil)</div><div class="line">(define-key evil-visual-state-map (kbd &quot;C-c&quot;) &apos;evil-exit-visual-state)</div></pre></td></tr></table></figure>
<p>&#x56E0;&#x4E3A; Vim &#x4F7F;&#x7528;&#x7684;&#x662F;&#x591A;&#x6A21;&#x5F0F;&#x7F16;&#x8F91;&#xFF0C;Evil &#x4E5F;&#x81EA;&#x7136;&#x662F;&#x591A;&#x6A21;&#x5F0F;&#x7684;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9ED8;&#x8BA4;&#x4F1A;&#x5728; Emacs &#x7684; mode line &#x4E0A;&#x6807;&#x8BB0;&#x76EE;&#x524D;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x9ED8;&#x8BA4;&#x7684;&#x65B9;&#x5F0F;&#x592A;&#x4E0D;&#x663E;&#x773C;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x8BC6;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B; Emacs &#x53EF;&#x4EE5;&#x5F88;&#x663E;&#x773C;&#x7684;&#x63D0;&#x793A;&#x8BA9;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x662F;&#x4EC0;&#x4E48;&#x6A21;&#x5F0F;&#xFF0C;Emacs &#x63D0;&#x4F9B;&#x4E86;&#x8BBE;&#x7F6E;&#x6BCF;&#x4E2A;&#x6A21;&#x5F0F;&#x989C;&#x8272;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6765;&#x81EA; Emacs wiki&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x663E;&#x793A;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">;; change mode-line color by evil state</div><div class="line">(lexical-let ((default-color (cons (face-background &apos;mode-line)</div><div class="line">                                   (face-foreground &apos;mode-line))))</div><div class="line">  (add-hook &apos;post-command-hook</div><div class="line">            (lambda ()</div><div class="line">              (let ((color (cond ((minibufferp) default-color)</div><div class="line">                                 ((evil-insert-state-p) &apos;(&quot;#e80000&quot; . &quot;#ffffff&quot;))</div><div class="line">                                 ((evil-emacs-state-p)  &apos;(&quot;#444488&quot; . &quot;#ffffff&quot;))</div><div class="line">                                 ((buffer-modified-p)   &apos;(&quot;#006fa0&quot; . &quot;#ffffff&quot;))</div><div class="line">                                 (t default-color))))</div><div class="line">                (set-face-background &apos;mode-line (car color))</div><div class="line">                (set-face-foreground &apos;mode-line (cdr color))))))</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5728;&#x7EC8;&#x7AEF;&#x5F00;&#x542F; Emacs&#xFF08;emacs -nw&#xFF09;&#x7684;&#x6548;&#x679C;&#x975E;&#x5E38;&#x7684;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528; x-window &#x7684;&#x8BDD;&#x6548;&#x679C;&#x4E0D;&#x4F73;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x4F7F;&#x7528; x-window &#x542F;&#x52A8; Emacs&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; powerline &#x63D2;&#x4EF6;&#x3002;&#x5B83;&#x539F;&#x672C;&#x662F; Vim &#x7684;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#xFF0C;&#x76EE;&#x524D;&#x6709; Emacs &#x7684;&#x7248;&#x672C;&#xFF0C;&#x5F53;&#x7136;&#x968F;&#x7740; Evil &#x7684;&#x5230;&#x6765;&#x81EA;&#x7136;&#x4F1A;&#x6709;
powerline-evil &#x63D2;&#x4EF6;&#xFF0C;&#x5B89;&#x88C5; powerline &#x7684;&#x65F6;&#x5019;&#x4F1A;&#x81EA;&#x52A8;&#x5B89;&#x88C5; powerline-evil&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E4B;&#x540E; Evil &#x4E0B;&#x7684;&#x4E0D;&#x540C;&#x6A21;&#x5F0F;&#x663E;&#x793A;&#x5C31;&#x8FD1;&#x4E4E;&#x5B8C;&#x7F8E;&#x4E86;&#x3002;</p>
<h3 id="bao-cun-gong-zuo-huan-jing-desktop-he-session">&#x4FDD;&#x5B58;&#x5DE5;&#x4F5C;&#x73AF;&#x5883; desktop &#x548C; session</h3>
<p>&#x6BCF;&#x6B21;&#x5173;&#x95ED; Emacs &#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x7684; buffer &#x90FD;&#x4F1A;&#x968F;&#x4E4B;&#x5173;&#x95ED;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x4E0B;&#x6B21;&#x6253;&#x5F00; Emacs &#x7684;&#x65F6;&#x5019;&#x5E0C;&#x671B;&#x539F;&#x6765;&#x6253;&#x5F00;&#x7684; buffer &#x4F9D;&#x7136;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x501F;&#x52A9; desktop &#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x63D2;&#x4EF6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x53EA;&#x9700;&#x8981;&#x6253;&#x5F00;&#x76F8;&#x5E94;&#x7684;&#x6A21;&#x5F0F;&#x5373;&#x53EF;&#xFF0C;&#x5728;&#x5173;&#x95ED; Emacs &#x7684;&#x65F6;&#x5019; desktop &#x4F1A;&#x4FDD;&#x5B58;&#x4F60;&#x5F00;&#x542F;&#x7684; buffer&#xFF0C;&#x8FD9;&#x6837;&#x4E0B;&#x6B21;&#x6253;&#x5F00;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x8FD8;&#x5728;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x5173;&#x95ED;&#x8FC7;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x63D2;&#x4EF6;&#x662F; session&#xFF0C;&#x5B83;&#x53EF;&#x4EE5; File &#x83DC;&#x5355;&#x4E0B;&#x589E;&#x52A0;&#x5B50;&#x83DC;&#x5355;&#xFF0C;&#x8BB0;&#x5F55;&#x6211;&#x4EEC;&#x6700;&#x8FD1;&#x8BBF;&#x95EE;&#x7684;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x50CF;&#x5927;&#x90E8;&#x5206; IDE &#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x4E00;&#x6837;&#x3002;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x6211;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x5173;&#x95ED; menu-bar &#x800C;&#x4E14;&#x4F7F;&#x7528;&#x4E86;
desktop&#xFF0C;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x4F5C;&#x7528;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="jian-bu-ru-fei-de-shu-ru-ido-smex">&#x5065;&#x6B65;&#x5982;&#x98DE;&#x7684;&#x8F93;&#x5165; &#x2014;&#x2014; ido&#x3001;smex</h3>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x63D2;&#x4EF6;&#x4E5F;&#x662F;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x3002;Emacs &#x7684;&#x8F93;&#x5165;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; TAB &#x952E;&#x6765;&#x8865;&#x5168;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x7684;&#x754C;&#x9762;&#x663E;&#x793A;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x63D2;&#x4EF6;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x8F93;&#x5165;&#x6307;&#x4EE4;&#x65F6;&#x7684; auto-complete&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x8F93;&#x5165;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>ido &#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5FEB;&#x901F;&#x7684;&#x67E5;&#x770B;&#x6587;&#x4EF6;&#x548C;&#x5207;&#x6362; buffer&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528; ido &#x6765;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x9012;&#x8FDB;&#x7684;&#x6587;&#x4EF6;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x8D77;&#x521D;&#x663E;&#x793A;&#x6700;&#x9876;&#x5C42;&#x7684;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x4E4B;&#x540E;&#x663E;&#x793A;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x5B50;&#x9879;&#x76EE;&#x3002;&#x540C;&#x6837;&#x5728;&#x5207;&#x6362; buffer &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E86; ido &#x53EF;&#x4EE5;&#x76F4;&#x89C2;&#x7684;&#x770B;&#x5230;&#x6709;&#x54EA;&#x4E9B;
buffer&#xFF0C;&#x5728;&#x4F60;&#x8F93;&#x5165;&#x60F3;&#x8981;&#x5207;&#x6362;&#x7684; buffer &#x540D;&#x79F0;&#x7684;&#x65F6;&#x5019; ido &#x4E5F;&#x540C;&#x65F6;&#x5E2E;&#x4F60;&#x8FDB;&#x884C;&#x7B5B;&#x9009;&#x3002;&#x6B64;&#x5916;&#xA0;ido &#x672C;&#x8EAB;&#x6709;&#x8BB0;&#x5FC6;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x7684;&#x5B9A;&#x4F4D;&#x5230;&#x4E0A;&#x4E00;&#x6B21;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x3002;</p>
<p>ido &#x4F7F;&#x5F97;&#x67E5;&#x627E;&#x6587;&#x4EF6;&#x548C;&#x5207;&#x6362; buffer &#x7684;&#x4EFB;&#x52A1;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x7684;&#x8F7B;&#x677E;&#xFF0C;smex &#x5219;&#x4F7F;&#x5F97;&#x8F93;&#x5165; Emacs &#x547D;&#x4EE4;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x4FBF;&#x6377;&#x3002;smex &#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E; ido &#x7684;&#x754C;&#x9762;&#x3002;&#x5728;&#x4F60;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x89C2;&#x7684;&#x7ED9;&#x51FA;&#x540E;&#x9009;&#x9879;&#xFF0C;&#x5728;&#x8F93;&#x5165;&#x7684;&#x540C;&#x65F6;&#x4E0D;&#x65AD;&#x7684;&#x7B5B;&#x9009;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8BB0;&#x5F55;&#x4F60;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F7F;&#x5F97;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF08;&#x5176;&#x5B9E;&#x5927;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x547D;&#x4EE4;&#x4E5F;&#x5C31;&#x90A3;&#x4E48;&#x51E0;&#x6761;&#xFF0C;&#x6709;&#x4E86; smex&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x7528;&#x8F93;&#x5165;&#x591A;&#x5C11;&#x4E2A;&#x5B57;&#x7B26;&#x5C31;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x8BB0;&#x5FC6;&#x529F;&#x80FD;&#xFF09;&#x3002;</p>
<h3 id="chun-wen-ben-bian-ji-li-qi-org">&#x7EAF;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5229;&#x5668; &#x2014;&#x2014; org</h3>
<p>org mode &#x7684;&#x5F3A;&#x5927;&#x5E76;&#x4E0D;&#x662F;&#x4E09;&#x8A00;&#x4E24;&#x8BED;&#x53EF;&#x4EE5;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x5B83;&#x7684;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x5C31;&#x6709;&#x597D;&#x51E0;&#x767E;&#x9875;&#x3002;&#x6211;&#x672C;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x7EC3;&#x7684;&#x638C;&#x63E1;&#x5B83;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x3002;</p>
<p>org &#x4E3B;&#x8981;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5C42;&#x6B21;&#x5316;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x4F7F;&#x5F97;&#x4F60;&#x5199;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x6761;&#x7406;&#x6E05;&#x6670;&#xFF0C;&#x6B64;&#x5916; org mode &#x5B9E;&#x73B0;&#x4E86; GTD &#xFF08;&#x597D;&#x50CF;&#x662F; Get Things Done &#x7684;&#x7F29;&#x5199;&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5217;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x7ED9;&#x51FA;&#x4F60;&#x7684;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#xFF0C;&#x8BA1;&#x5212;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4EFD;&#x65E5;&#x7A0B;&#x8868;&#xFF0C;&#x8BA9;&#x4F60;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x8FDB;&#x884C;&#x5F88;&#x597D;&#x7684;&#x89C4;&#x5212;&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x63D2;&#x5165;&#x8868;&#x683C;&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x5404;&#x79CD;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x3002;&#x4E5F;&#x6709;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x5199;&#x535A;&#x5BA2;&#x7684; org2blog &#x63D2;&#x4EF6;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; Emacs &#x7684; org &#x6A21;&#x5F0F;&#x7F16;&#x5199;&#x535A;&#x5BA2;&#x3002;</p>
<p>&#x6211;&#x5BF9; org &#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4ECB;&#x7ECD;&#x548C;&#x63A8;&#x8350;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x66F4;&#x5347;&#x5165;&#x7684;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x5B83;&#x7684;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x3002;</p>
<h3 id="qi-ta-cha-jian">&#x5176;&#x4ED6;&#x63D2;&#x4EF6;</h3>
<p>&#x5176;&#x4ED6;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#x4E5F;&#x5F88;&#x7ED9;&#x529B;&#xFF0C;&#x6BD4;&#x5982; auto-complete-clang &#x53EF;&#x4EE5;&#x5728; auto-complete &#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7; clang &#x4F5C;&#x4E3A;&#x540E;&#x7AEF;&#x63D0;&#x4F9B;&#x5E93;&#x51FD;&#x6570;&#x7684;&#x8865;&#x5168;&#x3002;ECB&#xFF08;Emacs Code Browser&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x50CF;&#x4F7F;&#x7528;
IDE &#x4E00;&#x6837;&#x4F7F;&#x7528; Emacs&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x6587;&#x4EF6;&#x7684;&#x5404;&#x79CD;&#x89C6;&#x56FE;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x3001;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x3001;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x5217;&#x8868;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x63D2;&#x4EF6;&#x867D;&#x7136;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x8BA9; Emacs &#x53D8;&#x7684;&#x5F88;&#x6162;&#xFF0C;&#x4E00;&#x5B9A;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#x53CD;&#x800C;&#x964D;&#x4F4E;&#x4E86; Emacs &#x7684;&#x6548;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x5B83;&#x4EEC;&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x67E5;&#x770B;&#x5177;&#x4F53;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="dan-ge-yu-yan-de-te-shu-pei-zhi-he-gui-de-te-shu-pei-zhi">&#x5355;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6B8A;&#x914D;&#x7F6E;&#x548C;GUI&#x7684;&#x7279;&#x6B8A;&#x914D;&#x7F6E;</h2>
<p>&#x524D;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5E76;&#x4E0D;&#x9650;&#x4E8E;&#x67D0;&#x4E2A;&#x8BED;&#x8A00;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x5219;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5BF9;&#x4E8E;&#x5355;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6B8A;&#x914D;&#x7F6E;&#x3002;</p>
<h3 id="c-cpp-cha-jian-pei-zhi">c&#x3001;cpp &#x63D2;&#x4EF6;&#x914D;&#x7F6E;</h3>
<h4 id="xing-zi-fu-shu-xian-zhi-fill-colum-indicator">&#x884C;&#x5B57;&#x7B26;&#x6570;&#x9650;&#x5236; &#x2014;&#x2014; <a href="https://github.com/alpaker/Fill-Column-Indicator" target="_blank" rel="external">fill-colum-indicator</a></h4>
<p>c&#x3001;cpp &#x7684;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x89C4;&#x8303;&#x5C31;&#x662F;&#x6BCF;&#x4E00;&#x884C;&#x7684;&#x5B57;&#x7B26;&#x4E0D;&#x8981;&#x8D85;&#x8FC7; 80 &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5728;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x53EF;&#x80FD;&#x53BB;&#x8BB0;&#x4F4F;&#x6CA1;&#x4E00;&#x884C;&#x76EE;&#x524D;&#x6709;&#x591A;&#x5C11;&#x5B57;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;
fill-colum-indicator &#x7684;&#x4F5C;&#x7528;&#x3002;&#x5B83;&#x4F1A;&#x5728;&#x5C4F;&#x5E55;&#x7684;&#x53F3;&#x8FB9;&#x89C4;&#x5B9A;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5730;&#x65B9;&#x7ED9;&#x51FA;&#x4E00;&#x6761;&#x7AD6;&#x7EBF;&#xFF0C;&#x4F7F;&#x5F97;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x76F4;&#x89C2;&#x7684;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x4E86;&#x8FD9;&#x4E2A;&#x754C;&#x9650;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5B83;&#x6307;&#x793A;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x989C;&#x8272;&#x548C;&#x7AD6;&#x7EBF;&#x7684;&#x5BBD;&#x5EA6;&#x3002;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">(setq fci-rule-column <span class="number">80</span>) ;; <span class="number">80</span> &#x4E2A;&#x5B57;&#x8282;&#x5904;&#x753B;&#x7AD6;&#x7EBF;</div><div class="line">(setq fci-rule-color <span class="string">&quot;orange&quot;</span>) ;; &#x7AD6;&#x7EBF;&#x4E3A;&#x9EC4;&#x8272;</div><div class="line">(setq fci-rule-width <span class="number">2</span>) ;; &#x7AD6;&#x7EBF;&#x5BBD;&#x5EA6;&#x4E3A; <span class="number">2</span> &#x4E2A;&#x50CF;&#x7D20;</div><div class="line">(fci-mode <span class="number">1</span>) ;; &#x5F00;&#x542F; fci &#x6A21;&#x5F0F;</div></pre></td></tr></table></figure>
<h4 id="dai-ma-tiao-zhuan-gtags">&#x4EE3;&#x7801;&#x8DF3;&#x8F6C; &#x2014;&#x2014; <a href="http://www.gnu.org/software/global/globaldoc_toc.html#Emacs-editor" target="_blank" rel="external">gtags</a></h4>
<p>&#x5728;&#x7F16;&#x5199;&#x6216;&#x8005;&#x9605;&#x8BFB;&#x8F83;&#x5927;&#x578B;&#x7684;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x5728;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x5B9E;&#x73B0;&#x4E2D;&#x8FDB;&#x884C;&#x8DF3;&#x8F6C;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5927;&#x90E8;&#x5206; IDE &#x90FD;&#x6709;&#x63D0;&#x4F9B;Emacs &#x4E5F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5B83;&#x3002;Emacs &#x4E2D;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x8DF3;&#x8F6C;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982; etags&#x3001;cscope &#x7B49;&#x7B49;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#x4E60;&#x60EF;&#x7684;&#x4F7F;&#x7528;&#x7684;&#x662F;gtags&#xFF0C;&#x5B83;&#x4EE5; GNU GLOBAL &#x4E3A;&#x4F9D;&#x6258;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4F7F;&#x7528; gtags &#x4E4B;&#x524D;&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x5B89;&#x88C5; global&#x3002;&#x5728;&#x5B98;&#x7F51;&#x7684;&#x7684;&#x6E90;&#x7801;&#x5305;&#x91CC;&#x6709; gtags.el&#xA0;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#xFF08;&#x5728; MELPA &#x4E2D;&#x6709;&#x4E00;&#x4E2A; ggtags &#x662F; gtags &#x63D2;&#x4EF6;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x8FD8;&#x4E0D;&#x5982;&#x8FD9;&#x4E2A;&#x539F;&#x751F;&#x7684;&#x597D;&#x7528;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7F16;&#x8BD1;&#x5B89;&#x88C5; global&#xFF0C;&#x90A3;&#x4E48;&#x5728; /usr/local/share/ &#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x4F1A;&#x6709; gtags.el &#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x52A0;&#x5230;&#x4F60;&#x7684; load-path &#x4E2D;&#x53BB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;
~/.emacs.d/plugins/&#xFF09;&#xFF0C;&#x628A;&#x6E90;&#x7801;&#x5305;&#x4E2D;&#x7684; gtags.el &#x653E;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x4E4B;&#x540E;&#x628A;&#x4F60;&#x5EFA;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x6DFB;&#x52A0;&#x5230; load-path &#x4E2D;&#x3002;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">(setq load-path (cons &quot;~/.emacs.d/plugins/&quot; load-path))</div><div class="line">(autoload &apos;gtags-mode &quot;gtags&quot; &quot;&quot; t)</div></pre></td></tr></table></figure>
<p>&#x76EE;&#x524D;&#x6211;&#x7528;&#x5B83;&#x6765;&#x9605;&#x8BFB; Linux Kernel &#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x63A8;&#x8350;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<h4 id="fang-bian-er-mei-guan-de-dai-ma-zhu-shi-doxymacs">&#x65B9;&#x4FBF;&#x800C;&#x7F8E;&#x89C2;&#x7684;&#x4EE3;&#x7801;&#x6CE8;&#x91CA; &#x2014;&#x2014; <a href="http://doxymacs.sourceforge.net/" target="_blank" rel="external">doxymacs</a></h4>
<p>Emacs &#x672C;&#x8EAB;&#x7684;&#x6CE8;&#x91CA;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528; M-; &#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x6CE8;&#x91CA;&#xFF0C;&#x5728;&#x6CE8;&#x91CA;&#x91CC;&#x9762;&#x4F7F;&#x7528;
M-j &#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x7684;&#x6CE8;&#x91CA;&#x63D2;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; doxymacs&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63D2;&#x5165;&#x6574;&#x4E2A;&#x6587;&#x6863;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x5355;&#x884C;&#x6CE8;&#x91CA;&#x7B49;&#x7B49;&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6CE8;&#x91CA;&#x7684;&#x8BED;&#x6CD5;&#x9AD8;&#x4EAE;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x597D;&#x7528;&#x3002;</p>
<p>&#x4E0D;&#x8FC7; doxymacs &#x4E5F;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x5B89;&#x88C5;&#xFF0C;&#x5728; package &#x91CC;&#x9762;&#x6CA1;&#x529E;&#x6CD5;&#x76F4;&#x63A5;&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x3002;&#x7F16;&#x8BD1;&#x5B89;&#x88C5;
doxymacs &#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;&#x5177;&#x4F53;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x7684;&#x3002;</p>
<h4 id="zi-ding-yi-han-shu">&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;</h4>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x53EA;&#x5BF9; c&#x3001;cpp &#x6709;&#x6548;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x91CC;&#x9762;&#x5199;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6302;&#x5230; c &#x548C; cpp &#x7684; mode &#x4E0A;&#x9762;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div></pre></td><td class="code"><pre><div class="line">(defun my-c-mode-hook()</div><div class="line">&quot;This is the function of c mode hook&quot;</div><div class="line"></div><div class="line">;; set fci-mode argument</div><div class="line">(setq fci-rule-column 80)</div><div class="line">(setq fci-rule-color &quot;orange&quot;)</div><div class="line">(setq fci-rule-width 2)</div><div class="line">(fci-mode 1)</div><div class="line"></div><div class="line">;; gtags mode and doxymacs</div><div class="line">(setq load-path (cons &quot;~/.emacs.d/plugins/&quot; load-path))</div><div class="line">(autoload &apos;gtags-mode &quot;gtags&quot; &quot;&quot; t)</div><div class="line"></div><div class="line">;; open gtags mode</div><div class="line">(gtags-mode 1)</div><div class="line"></div><div class="line">;; doxymacs mode</div><div class="line">(doxymacs-mode 1)</div><div class="line"></div><div class="line">;; &#x56DE;&#x8F66;&#x6362;&#x884C;&#x81EA;&#x52A8;&#x7F29;&#x8FDB;</div><div class="line">(setq-default indent-tabs-mode nil)</div><div class="line">(global-set-key (kbd &quot;RET&quot;) &apos;newline-and-indent)</div><div class="line"></div><div class="line">;; &#x7F29;&#x8FDB;&#x98CE;&#x683C;&#x8BBE;&#x7F6E;</div><div class="line">(setq c-default-style &apos;((java-mode . &quot;java&quot;)</div><div class="line">                                     (awk-mode . &quot;awk&quot;)</div><div class="line">                                     (other . &quot;linux&quot;)))</div><div class="line">)</div></pre></td></tr></table></figure>
<p>&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x8FC7; hook &#x628A;&#x5B83;&#x6302;&#x5230; c-common-hook &#x4E0A;&#x9762;&#x3002;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">(add-hook &apos;c-mode-common-hook &apos;my-c-mode-hook)</div></pre></td></tr></table></figure>
<h3 id="python-cha-jian-pei-zhi">Python &#x63D2;&#x4EF6;&#x914D;&#x7F6E;</h3>
<p>Python &#x7684;&#x914D;&#x7F6E;&#x9664;&#x4E86;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684; fill-colum-indicator &#x4E4B;&#x5916;&#xFF08;Python &#x4E00;&#x822C;&#x8981;&#x6C42;&#x6BCF;&#x884C;&#x4E0D;&#x8D85;&#x8FC7;
79 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x800C; c&#x3001;cpp &#x5219;&#x4E00;&#x822C;&#x662F; 80 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x901A;&#x7528;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5206;&#x5F00;&#x5199;&#x5B83;&#x4EEC;&#x7684;&#x914D;&#x7F6E;&#xFF09;&#x6211;&#x53EA;&#x63A8;&#x8350;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x2014;&#x2014;<a href="http://tkf.github.io/emacs-jedi/latest/" target="_blank" rel="external">jedi</a>&#x3002;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x8865;&#x5168;&#xFF0C;&#x4EE3;&#x7801;&#x8DF3;&#x8F6C;&#xFF0C; docstring &#x7684;&#x67E5;&#x770B;&#x7B49;&#x7B49;&#x3002;</p>
<p>jdei &#x7684;&#x5B89;&#x88C5;&#x76F8;&#x5BF9;&#x8981;&#x9EBB;&#x70E6;&#x4E00;&#x4E0B;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ul>
<li>&#x5B89;&#x88C5;&#x76F8;&#x5173;&#x4F9D;&#x8D56;&#xFF0C;&#x5305;&#x62EC; virtual&#x3001;epc&#x3001;jedi</li>
</ul>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">sudo pip install virtualenv</div><div class="line">sudo pip install epc</div><div class="line">sudo pip install jedi</div></pre></td></tr></table></figure>
<ul>
<li>
<p>&#x7528; package &#x5B89;&#x88C5; jdei &#x63D2;&#x4EF6;(package &#x5728;&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x540C;&#x65F6;&#x4F1A;&#x5B89;&#x88C5;&#x5B83;&#x4F9D;&#x8D56;&#x7684;&#x7684;&#x63D2;&#x4EF6;)</p>
</li>
<li>
<p>&#x5728; Emacs &#x4E2D;&#x6267;&#x884C;&#x547D;&#x4EE4; jedi:install-server</p>
</li>
</ul>
<p>&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x914D;&#x7F6E;&#x5F00;&#x542F; jedi:</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">;; <span class="function">setup <span class="title">jedi</span></span></div><div class="line"><span class="params">(jedi:setup)</span></div><div class="line"><span class="params">(setq jedi:complete-on-dot t)</span></div></pre></td></tr></table></figure>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x628A;&#x4E0A;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x5199;&#x5230;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7; hook &#x6302;&#x5230; python mode
&#x4E2D;&#x3002;</p>
<p>jedi &#x7684;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x8BF7;&#x67E5;&#x8003;&#x5B83;&#x7684;<a href="http://tkf.github.io/emacs-jedi/latest/" target="_blank" rel="external">&#x5B98;&#x65B9;&#x6587;&#x6863;</a> &#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x5FEB;&#x6377;&#x952E;&#xFF1A;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line">;; &lt;C-tab&gt; jedi:complete</div><div class="line">;; Complete code at point.</div><div class="line"></div><div class="line">;; C-c ? jedi:show-doc</div><div class="line">;; Show the documentation of the object at point.</div><div class="line"></div><div class="line">;; C-c . jedi:<span class="keyword">goto</span>-definition</div><div class="line">;; Goto the definition of the object at point.</div><div class="line"></div><div class="line">;; C-c , jedi:<span class="keyword">goto</span>-definition-pop-marker</div><div class="line">;; Goto the last point where jedi:<span class="keyword">goto</span>-definition was called.</div></pre></td></tr></table></figure>
<p>jedi &#x5728; python 3 &#x4E0B;&#x597D;&#x50CF;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528; Python 2 &#x6765;&#x914D;&#x7F6E;&#x5B83;&#x3002;&#xFF08;&#x6211;&#x5728; Arch
&#x4E0B;&#x914D;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x56E0;&#x4E3A;&#x5B83;&#x4EE5; Python3 &#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x7684; Python &#x7248;&#x672C;&#x914D;&#x7F6E;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x628A;&#x9ED8;&#x8BA4;&#x6539;&#x6210;
Python2 &#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;</p>
<h3 id="gui-te-shu-pei-zhi">GUI &#x7279;&#x6B8A;&#x914D;&#x7F6E;</h3>
<p>Emacs &#x4E2D;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#x53EA;&#x6709;&#x5728;&#x4F7F;&#x7528; x-window &#x7684;&#x65F6;&#x5019;&#x624D;&#x6709;&#x6548;&#xFF0C;&#x6BD4;&#x5982;&#x8BBE;&#x7F6E;&#x5B57;&#x4F53;&#xFF0C;&#x4F7F;&#x7528;
powerline &#x548C;&#x7CFB;&#x7EDF;&#x5171;&#x4EAB;&#x526A;&#x8D34;&#x677F;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4E3A;&#x6B64;&#x6211;&#x4E13;&#x95E8;&#x4E3A; x-window &#x914D;&#x7F6E;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5F53;&#x4F7F;&#x7528; x-window &#x7684;&#x65F6;&#x5019;&#x6267;&#x884C;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x914D;&#x7F6E; GUI &#x7279;&#x6B8A;&#x529F;&#x80FD;&#x3002;</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div></pre></td><td class="code"><pre><div class="line">(defun x-window-config()</div><div class="line">    (powerline-center-evil-theme)</div><div class="line">    (setq x-select-enable-clipboard <span class="number">1</span>)</div><div class="line">    (<span class="built_in">set</span>-<span class="keyword">default</span>-font <span class="string">&quot;Courier 10 Pitch&quot;</span>))</div><div class="line"></div><div class="line">(<span class="keyword">if</span> window-system (x-window-config))</div></pre></td></tr></table></figure>
<h2 id="an-jian-bang-ding">&#x6309;&#x952E;&#x7ED1;&#x5B9A;</h2>
<p>&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#x4E4B;&#x6240;&#x4EE5;&#x653E;&#x5728;&#x6700;&#x540E;&#x9762;&#x662F;&#x56E0;&#x4E3A;&#x6309;&#x952E;&#x7684;&#x7ED1;&#x5B9A;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x5230;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7684;&#x63D2;&#x4EF6;&#x90FD;&#x914D;&#x7F6E;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x8BBE;&#x7F6E;&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x6E05;&#x6670;&#x660E;&#x4E86;&#xFF0C;&#x4E5F;&#x9632;&#x6B62;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6309;&#x952E;&#x7ED1;&#x5B9A;&#x4E3B;&#x8981;&#x662F; f1-f12 &#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x5177;&#x4F53;&#x7ED1;&#x5B9A;&#x5982;&#x4E0B;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x5176;&#x4ED6;&#x7684;&#x6309;&#x952E;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div></pre></td><td class="code"><pre><div class="line">;; &#x8BBE;&#x7F6E; f1 &#x6253;&#x5F00;&#x5E2E;&#x52A9;&#x6587;&#x6863;</div><div class="line">(global-set-key [f1] &apos;info)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f2 &#x4E3A; yas &#x6269;&#x5C55;&#x5FEB;&#x6377;&#x952E;</div><div class="line">(define-key yas-minor-mode-map (kbd &quot;&lt;f2&gt;&quot;) &apos;yas-expand)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f3 &#x5173;&#x95ED;&#x5F53;&#x524D;buffer</div><div class="line">(global-set-key [f3] &apos;kill-this-buffer)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f4 &#x6253;&#x5F00; eshell</div><div class="line">(global-set-key [f4] &apos;eshell)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f10 &#x4E3A;&#x67E5;&#x627E;&#x7B26;&#x53F7;&#x7684;&#x5F15;&#x7528;</div><div class="line">(global-set-key [f10] &apos;gtags-find-rtag)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f11 &#x4E3A;&#x67E5;&#x627E;&#x7B26;&#x53F7;&#x7684;&#x5B9A;&#x4E49;</div><div class="line">(global-set-key [f11] &apos;gtags-find-tag)</div><div class="line"></div><div class="line">;; &#x8BBE;&#x7F6E; f12 &#x8FD4;&#x56DE;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;</div><div class="line">(global-set-key [f12] &apos;gtags-pop-stack)</div></pre></td></tr></table></figure>
<p>&#x5176;&#x4E2D; f1 &#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;f2 &#x4F5C;&#x4E3A; yasnippt &#x7684;&#x6269;&#x5C55;&#x952E;&#xFF0C;f3 &#x7528;&#x6765;&#x5173;&#x95ED;&#x5F53;&#x524D; buffer&#xFF08;Emacs
&#x7684;C-x k &#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x5173;&#x95ED; buffer &#x6309;&#x952E;&#xFF09;&#x3002;f10 &#x5230; f12 &#x662F;&#x4E13;&#x95E8;&#x7ED1;&#x5B9A;&#x5230; gtags &#x63D2;&#x4EF6;&#x7684;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x4E0A;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97; gtags &#x7684;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x4FBF;&#x6377;&#x3002;</p>
<p>&#x6211;&#x628A; f4 &#x7ED1;&#x5B9A;&#x4E3A;&#x6253;&#x5F00; eshell&#x3002;Emacs &#x672C;&#x8EAB;&#x652F;&#x6301; shell &#x548C; eshell&#xFF0C;&#x5176;&#x4E2D;&#x524D;&#x8005;&#x7684;&#x4F7F;&#x7528;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x60F3;&#x8981;&#x6267;&#x884C;&#x4E0A;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528; M-p&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x4E0A;&#x7BAD;&#x5934;&#xFF08;&#x540C;&#x6837;&#x4E0B;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x9700;&#x8981;&#x7528; M-n&#xFF09;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x65B9;&#x4FBF;&#x5F88;&#x591A;&#x3002;eshell &#x662F;&#x7528; Emacs lisp &#x5199;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x548C; Emacs &#x7684;&#x878D;&#x5408;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6B64;&#x5916;&#x56E0;&#x4E3A;&#x5B83;&#x662F; Emacs lisp &#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728; eshell &#x4E2D;&#x6267;&#x884C; Emacs &#x547D;&#x4EE4;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E94;&#x8BE5;&#x5F88;&#x5C11;&#x4F1A;&#x6709;&#x4EBA;&#x8FD9;&#x4E48;&#x5E72;&#xFF0C;&#x56E0;&#x4E3A; smex &#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x5F3A;&#x5927;&#x4E86;&#x3002;</p>
<hr>
<p>&#x5B8C;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Emacs/" rel="tag"># Emacs</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/09/06/linux-interrupt-preemptive-lock/" rel="next" title="Linux 中断、抢占、锁之间的关系">
                <i class="fa fa-chevron-left"></i> Linux 中断、抢占、锁之间的关系
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/09/18/lkd-chapter-one/" rel="prev" title="LKD 总结 —— 第一章">
                LKD 总结 —— 第一章 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">83</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#jian-jie"><span class="nav-number">1.</span> <span class="nav-text">简介</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#pei-zhi-mu-biao"><span class="nav-number">2.</span> <span class="nav-text">配置目标</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#pei-zhi-wen-jian-ji-qi-jie-gou"><span class="nav-number">3.</span> <span class="nav-text">配置文件及其结构</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#pei-zhi-nei-rong"><span class="nav-number">4.</span> <span class="nav-text">配置内容</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#cha-jian-wu-guan-de-gong-gong-she-zhi"><span class="nav-number">4.1.</span> <span class="nav-text">插件无关的公共设置</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#zai-mode-line-shang-xian-shi-xing-lie-hao"><span class="nav-number">4.1.1.</span> <span class="nav-text">在 mode line 上显示行列号</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#qu-diao-gun-dong-tiao-cai-dan-lan-he-gong-ju-lan"><span class="nav-number">4.1.2.</span> <span class="nav-text">去掉滚动条、菜单栏和工具栏</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#guan-bi-emacs-de-qi-shi-huan-ying-ye-mian"><span class="nav-number">4.1.3.</span> <span class="nav-text">关闭 Emacs 的起始欢迎页面</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#yi-y-n-dai-biao-yes-no"><span class="nav-number">4.1.4.</span> <span class="nav-text">以 y/n代表 yes/no</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#bei-fen-she-zhi"><span class="nav-number">4.1.5.</span> <span class="nav-text">备份设置</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#gong-gong-cha-jian-pei-zhi"><span class="nav-number">4.2.</span> <span class="nav-text">公共插件配置</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#bao-guan-li-cha-jian-package"><span class="nav-number">4.2.1.</span> <span class="nav-text">包管理插件 —— package</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#gua-hao-zi-dong-pi-pei-autopair"><span class="nav-number">4.2.2.</span> <span class="nav-text">括号自动匹配 —— autopair</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#dai-ma-kuo-zhan-shen-qi-yasnippet-he-dai-ma-bu-quan-shen-qi-auto-complete"><span class="nav-number">4.2.3.</span> <span class="nav-text">代码扩展神器 yasnippet 和代码补全神器 auto-complete</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#vim-he-emacs-de-rong-he-evil"><span class="nav-number">4.2.4.</span> <span class="nav-text">Vim 和 Emacs 的融合 —— EVIL</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#bao-cun-gong-zuo-huan-jing-desktop-he-session"><span class="nav-number">4.2.5.</span> <span class="nav-text">保存工作环境 desktop 和 session</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#jian-bu-ru-fei-de-shu-ru-ido-smex"><span class="nav-number">4.2.6.</span> <span class="nav-text">健步如飞的输入 —— ido、smex</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#chun-wen-ben-bian-ji-li-qi-org"><span class="nav-number">4.2.7.</span> <span class="nav-text">纯文本编辑利器 —— org</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#qi-ta-cha-jian"><span class="nav-number">4.2.8.</span> <span class="nav-text">其他插件</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#dan-ge-yu-yan-de-te-shu-pei-zhi-he-gui-de-te-shu-pei-zhi"><span class="nav-number">4.3.</span> <span class="nav-text">单个语言的特殊配置和GUI的特殊配置</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#c-cpp-cha-jian-pei-zhi"><span class="nav-number">4.3.1.</span> <span class="nav-text">c、cpp 插件配置</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#xing-zi-fu-shu-xian-zhi-fill-colum-indicator"><span class="nav-number">4.3.1.1.</span> <span class="nav-text">行字符数限制 —— fill-colum-indicator</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#dai-ma-tiao-zhuan-gtags"><span class="nav-number">4.3.1.2.</span> <span class="nav-text">代码跳转 —— gtags</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#fang-bian-er-mei-guan-de-dai-ma-zhu-shi-doxymacs"><span class="nav-number">4.3.1.3.</span> <span class="nav-text">方便而美观的代码注释 —— doxymacs</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#zi-ding-yi-han-shu"><span class="nav-number">4.3.1.4.</span> <span class="nav-text">自定义函数</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#python-cha-jian-pei-zhi"><span class="nav-number">4.3.2.</span> <span class="nav-text">Python 插件配置</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#gui-te-shu-pei-zhi"><span class="nav-number">4.3.3.</span> <span class="nav-text">GUI 特殊配置</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#an-jian-bang-ding"><span class="nav-number">4.4.</span> <span class="nav-text">按键绑定</span></a></li></ol></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
