<!doctype html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="读书笔记," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="这本书发人深省，作者思想深邃到让人不寒而栗，很多事情原来从来没有想过，作者以
他非凡的洞察力和缜密的逻辑思维把问题讲解的非常透彻，文字生动而幽默，一切都像故事
一样娓娓道来，让人欲罢不能。
作者保罗.格雷厄姆是硅谷的创业教父，整本书也可以说是写给创业者的指南，包括为什么
要去创业、如何找到创业的突破口、如何选择创业的技术、如何设计产品、如何开发产品等
等。
作者本身是一名黑客，和大多数黑客一样推崇">
<meta property="og:type" content="article">
<meta property="og:title" content="读书札记之 —— 《黑客与画家》">
<meta property="og:url" content="http://blog.guorongfei.com/2016/02/18/hackers-and-painters-note/index.html">
<meta property="og:site_name" content="时习之">
<meta property="og:description" content="这本书发人深省，作者思想深邃到让人不寒而栗，很多事情原来从来没有想过，作者以
他非凡的洞察力和缜密的逻辑思维把问题讲解的非常透彻，文字生动而幽默，一切都像故事
一样娓娓道来，让人欲罢不能。
作者保罗.格雷厄姆是硅谷的创业教父，整本书也可以说是写给创业者的指南，包括为什么
要去创业、如何找到创业的突破口、如何选择创业的技术、如何设计产品、如何开发产品等
等。
作者本身是一名黑客，和大多数黑客一样推崇">
<meta property="og:updated_time" content="2016-12-02T06:07:19.259Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书札记之 —— 《黑客与画家》">
<meta name="twitter:description" content="这本书发人深省，作者思想深邃到让人不寒而栗，很多事情原来从来没有想过，作者以
他非凡的洞察力和缜密的逻辑思维把问题讲解的非常透彻，文字生动而幽默，一切都像故事
一样娓娓道来，让人欲罢不能。
作者保罗.格雷厄姆是硅谷的创业教父，整本书也可以说是写给创业者的指南，包括为什么
要去创业、如何找到创业的突破口、如何选择创业的技术、如何设计产品、如何开发产品等
等。
作者本身是一名黑客，和大多数黑客一样推崇">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://blog.guorongfei.com/2016/02/18/hackers-and-painters-note/"/>





  <title> 读书札记之 —— 《黑客与画家》 | 时习之 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">时习之</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">学而时习之，不亦说乎</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.guorongfei.com/2016/02/18/hackers-and-painters-note/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="郭荣飞">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/img/avatar.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="时习之">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="时习之" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                读书札记之 —— 《黑客与画家》
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-02-18T20:14:28+08:00">
                2016-02-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x672C;&#x4E66;<strong>&#x53D1;&#x4EBA;&#x6DF1;&#x7701;</strong>&#xFF0C;&#x4F5C;&#x8005;&#x601D;&#x60F3;&#x6DF1;&#x9083;&#x5230;&#x8BA9;&#x4EBA;&#x4E0D;&#x5BD2;&#x800C;&#x6817;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x539F;&#x6765;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#xFF0C;&#x4F5C;&#x8005;&#x4EE5;
&#x4ED6;&#x975E;&#x51E1;&#x7684;&#x6D1E;&#x5BDF;&#x529B;&#x548C;&#x7F1C;&#x5BC6;&#x7684;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x628A;&#x95EE;&#x9898;&#x8BB2;&#x89E3;&#x7684;&#x975E;&#x5E38;&#x900F;&#x5F7B;&#xFF0C;&#x6587;&#x5B57;&#x751F;&#x52A8;&#x800C;&#x5E7D;&#x9ED8;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x50CF;&#x6545;&#x4E8B;
&#x4E00;&#x6837;&#x5A13;&#x5A13;&#x9053;&#x6765;&#xFF0C;&#x8BA9;&#x4EBA;&#x6B32;&#x7F62;&#x4E0D;&#x80FD;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x4FDD;&#x7F57;.&#x683C;&#x96F7;&#x5384;&#x59C6;&#x662F;&#x7845;&#x8C37;&#x7684;&#x521B;&#x4E1A;&#x6559;&#x7236;&#xFF0C;&#x6574;&#x672C;&#x4E66;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5199;&#x7ED9;&#x521B;&#x4E1A;&#x8005;&#x7684;&#x6307;&#x5357;&#xFF0C;&#x5305;&#x62EC;&#x4E3A;&#x4EC0;&#x4E48;
&#x8981;&#x53BB;&#x521B;&#x4E1A;&#x3001;&#x5982;&#x4F55;&#x627E;&#x5230;&#x521B;&#x4E1A;&#x7684;&#x7A81;&#x7834;&#x53E3;&#x3001;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x521B;&#x4E1A;&#x7684;&#x6280;&#x672F;&#x3001;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x3001;&#x5982;&#x4F55;&#x5F00;&#x53D1;&#x4EA7;&#x54C1;&#x7B49;
&#x7B49;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x540D;&#x9ED1;&#x5BA2;&#xFF0C;&#x548C;&#x5927;&#x591A;&#x6570;&#x9ED1;&#x5BA2;&#x4E00;&#x6837;&#x63A8;&#x5D07;&#x6781;&#x81F4;&#x3002;&#x4F60;&#x9700;&#x8981;&#x8FDB;&#x5EA6;&#x7684;&#x52AA;&#x529B;&#x624D;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x6781;&#x5927;&#x7684;
&#x56DE;&#x62A5;&#xFF0C;&#x624D;&#x53EF;&#x80FD;&#x5728;&#x521B;&#x4E1A;&#x7684;&#x5927;&#x6D6A;&#x6DD8;&#x6C99;&#x4E2D;&#x5B58;&#x6D3B;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x4E2A;&#x4EBA;&#x6587;&#x96C6;&#xFF0C;&#x91CC;&#x9762;&#x5145;&#x65A5;&#x7740;&#x5404;&#x79CD;&#x4E2A;&#x4EBA;&#x7684;&#x601D;&#x8003;&#x548C;&#x504F;&#x597D;&#x3002;&#x4F5C;&#x8005;&#x4EE5;&#x4F20;&#x9500;&#x5F0F;&#x7684;&#x624B;&#x6CD5;&#x5411;&#x4F60;&#x63CF;&#x8FF0;&#x4ED6;&#x5BF9;
&#x4E8E;&#x95EE;&#x9898;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x9605;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x4E4B;&#x524D;&#x8BF7;&#x4F60;&#x5148;&#x505A;&#x597D;&#x601D;&#x60F3;&#x51C6;&#x5907;&#xFF0C;&#x4E5F;&#x8BB8;&#x8BFB;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5728;&#x662F;&#x4F60;
&#x4E86;&#x3002;</p>
<a id="more"></a>
<h1 id="wo-xue-dao-liao-shi-me">&#x6211;&#x5B66;&#x5230;&#x4E86;&#x4EC0;&#x4E48;</h1>
<p><strong>&#x4E00;&#x4E2A;&#x80FD;&#x8BF4;&#x4F1A;&#x9053;&#x7684;&#x4E66;&#x5446;&#x5B50;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x6574;&#x4E2A;&#x4E16;&#x754C;</strong>&#x3002;</p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x4E66;&#x5446;&#x5B50;&#x4E0D;&#x53D7;&#x6B22;&#x8FCE;</strong>&#x4E00;&#x6587;&#x4E2D;&#x7684;&#x89C2;&#x70B9;&#x6211;&#x975E;&#x5E38;&#x8BA4;&#x540C;&#xFF0C;<code>&#x522B;&#x4EBA;&#x7B11;&#x6211;&#x592A;&#x75AF;&#x766B;&#xFF0C;&#x6211;&#x7B11;&#x4ED6;&#x4EBA;&#x770B;&#x4E0D;&#x7A7F;</code>
&#x4E5F;&#x8BB8;&#x6211;&#x73B0;&#x5728;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x906D;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x9119;&#x89C6;&#xFF0C;&#x4E5F;&#x8BB8;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x6211;&#x4E0D;&#x53EF;&#x7406;&#x55BB;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x6709;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;
&#x575A;&#x5B9A;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x4E0D;&#x5FC5;&#x592A;&#x5728;&#x4E4E;&#x522B;&#x4EBA;&#x5BF9;&#x4F60;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x5E76;&#x575A;&#x6301;&#x505A;&#x4E0B;&#x53BB;&#x6BD4;&#x5176;&#x4ED6;&#x7684;
&#x4E8B;&#x60C5;&#x90FD;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4E5F;&#x8BB8;&#x6210;&#x4E3A;&#x4E0D;&#x4E86;&#x4E00;&#x4E2A;&#x6280;&#x827A;&#x7CBE;&#x6E5B;&#x7684;&#x9ED1;&#x5BA2;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65F6;&#x523B;&#x90FD;&#x5173;&#x6CE8;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x827A;&#x7684;&#x589E;&#x957F;
&#x3002;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x65F6;&#x523B;&#x5173;&#x6CE8;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x827A;&#x3002;</p>
<p><strong>&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;</strong>&#x8BB2;&#x8FF0;&#x4E86;&#x5F88;&#x591A;&#x6D45;&#x663E;&#x4F46;&#x662F;&#x5BB9;&#x6613;&#x88AB;&#x4EBA;&#x5FFD;&#x89C6;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x50CF;&#x753B;&#x5BB6;&#x3001;&#x5EFA;&#x7B51;&#x5E08;&#x548C;&#x4F5C;
&#x5BB6;&#x4E00;&#x6837;&#x521B;&#x4F5C;&#xFF0C;&#x5173;&#x6CE8;&#x4F5C;&#x54C1;&#x7684;&#x7F8E;&#x611F;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x8981;&#x50CF;&#x5199;&#x8BD7;&#x4E00;&#x6837;&#x4F18;&#x96C5;&#x3002;&#x5199;&#x7A0B;&#x5E8F;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x53EF;&#x4EE5;&#x501F;&#x9274;&#x7ED8;&#x753B;
&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x5E94;&#x8BE5;&#x5F00;&#x59CB;&#x753B;&#xFF08;&#x5199;&#x7A0B;&#x5E8F;&#xFF09;&#x7136;&#x540E;&#x6162;&#x6162;&#x7684;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x8981;&#x753B;&#x4EC0;&#x4E48;&#xFF08;&#x6700;&#x7EC8;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF09;&#xFF1B;
&#x6BD4;&#x5982;&#x4F60;&#x5E94;&#x8BE5;&#x9010;&#x6B65;&#x5B8C;&#x6210;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#xFF08;&#x7A0B;&#x5E8F;&#xFF09;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x5168;&#x90E8;&#x641E;&#x5B9A;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x73B0;&#x5728;&#x5907;&#x53D7;&#x63A8;&#x5D07;&#x7684;&#x8FED;&#x4EE3;
&#x4E0D;&#x8C0B;&#x800C;&#x5408;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E1D;&#x4E0D;&#x82DF;&#x7684;&#x5BF9;&#x5F85;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#xFF08;&#x4EE3;&#x7801;&#xFF09;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x9700;&#x8981;&#x8D81;&#x4F60;&#x6709;&#x5F88;&#x597D;&#x7684;&#x72B6;
&#x6001;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x548C;&#x522B;&#x4EBA;&#x5408;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x6709;&#x660E;&#x786E;&#x7684;&#x5206;&#x5DE5;&#xFF0C;&#x5426;&#x5219;&#x4EE3;&#x7801;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x56E2;&#x4E71;&#x9EBB;
&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x7EC3;&#x4E60;&#x624D;&#x80FD;&#x6210;&#x4E3A;&#x719F;&#x7EC3;&#x7684;&#x753B;&#x5BB6;&#xFF08;&#x7A0B;&#x5E8F;&#x5458;&#xFF09;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x89C2;&#x6469;&#x524D;&#x4EBA;
&#x4F18;&#x79C0;&#x7684;&#x753B;&#x4F5C;&#xFF08;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF09;&#x6765;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x5883;&#x754C;&#x3002;</p>
<p><strong>&#x4E0D;&#x80FD;&#x8BF4;&#x7684;&#x8BDD;</strong>&#x4E00;&#x6587;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x793E;&#x4F1A;&#x4E0A;&#x7684;&#x79CD;&#x79CD;&#x4E16;&#x4FD7;&#x89C2;&#x5FF5;&#x80CC;&#x540E;&#x5176;&#x5B9E;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x4E0D;&#x80FD;&#x8BF4;&#x7684;&#x8C2C;&#x8BEF;&#xFF0C;&#x627E;&#x5230;
&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x4F1A;&#x6709;&#x5229;&#x4E8E;&#x5F97;&#x5230;&#x4F60;&#x8D85;&#x4E4E;&#x5E38;&#x4EBA;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x662F;&#x4F60;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x7A81;&#x7834;&#x6210;&#x4E3A;&#x521B;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x3002;&#x81EA;
&#x7531;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x72EC;&#x7ACB;&#x7684;&#x7CBE;&#x795E;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8D70;&#x7684;&#x66F4;&#x8FDC;&#x3002;</p>
<p>&#x5728;<strong>&#x53E6;&#x4E00;&#x6761;&#x8DEF;</strong>&#x4E00;&#x6587;&#x4E2D;&#x4F5C;&#x8005;&#x9F13;&#x5439;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x5E74;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x521B;&#x4E1A;&#x6D6A;&#x6F6E;&#x5F88;
&#x597D;&#x7684;&#x5370;&#x8BC1;&#x4E86;&#x4F5C;&#x8005;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x627E;&#x5230;&#x98CE;&#x53E3;&#x80FD;&#x8BA9;&#x732A;&#x98DE;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x98CE;&#x53E3;&#x4E4B;&#x4E00;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x53E3;&#x4E0A;&#x73B0;
&#x5728;&#x5DF2;&#x7ECF;&#x7AD9;&#x6EE1;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x732A;&#x3002;&#x867D;&#x7136;&#x4E92;&#x8054;&#x7F51;&#x8F6F;&#x4EF6;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x6D3B;&#x529B;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F3C;
&#x4E4E;&#x6CA1;&#x6709;&#x4E86;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x90A3;&#x79CD;&#x5360;&#x636E;&#x5148;&#x673A;&#x7684;&#x4F18;&#x52BF;&#x4E86;&#x3002;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x70ED;&#x5EA6;&#x4F3C;&#x4E4E;&#x5728;&#x6301;&#x7EED;&#x7684;&#x4E0A;&#x5347;&#xFF0C;
&#x800C;IoT&#x7684;&#x6982;&#x5FF5;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x666E;&#x53CA;&#x5F00;&#x6765;&#xFF0C;&#x672A;&#x6765;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x98CE;&#x53E3;&#x6211;&#x8FD9;&#x79CD;&#x51E1;&#x592B;&#x4FD7;&#x5B50;&#x5B9E;&#x5728;&#x96BE;&#x4EE5;
&#x6D1E;&#x5BDF;&#x3002;</p>
<p><strong>&#x521B;&#x9020;&#x8D22;&#x5BCC;</strong>&#x4E00;&#x6587;&#x548C;<strong>&#x5173;&#x6CE8;&#x8D2B;&#x5BCC;&#x5206;&#x5316;</strong>&#x4E00;&#x6587;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x5728;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x6211;&#x4EEC;
&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x51FA;&#x5BF9;&#x793E;&#x4F1A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x83B7;&#x5F97;&#x8D22;&#x5BCC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5927;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#x521B;&#x9020;&#x4EF7;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x6211;
&#x4EEC;&#x7684;&#x8D21;&#x732E;&#x4F1A;&#x88AB;&#x5E73;&#x5747;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x521B;&#x4E1A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x66F4;&#x52AA;&#x529B;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x5F97;&#x5230;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x800C;&#x4E0D;&#x4F1A;&#x88AB;&#x5176;&#x4ED6;
&#x4EBA;&#x5E73;&#x5747;&#x5316;&#x3002;&#x793E;&#x4F1A;&#x4E4B;&#x6240;&#x4EE5;&#x51FA;&#x73B0;&#x8D2B;&#x5BCC;&#x5DEE;&#x8DDD;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x51FA;&#x7684;&#x4EF7;&#x503C;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;
&#x80FD;&#x529B;&#x6709;&#x4E0D;&#x540C;&#x6240;&#x4EE5;&#x521B;&#x9020;&#x51FA;&#x6765;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4F5C;&#x8005;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x5269;&#x4F59;&#x4EF7;&#x503C;&#x7406;&#x8BBA;&#xFF0C;&#x6216;&#x8005;&#x4ED6;&#x4EEC;&#x6839;&#x672C;&#x4E0D;&#x8BA4;
&#x540C;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;&#x5C31;&#x7B97;&#x8003;&#x8651;&#x4E86;&#x5269;&#x4F59;&#x4EF7;&#x503C;&#x7406;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x5426;&#x8BA4;&#x6BCF;&#x4E2A;&#x4EBA;&#x56E0;&#x4E3A;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x540C;&#x521B;
&#x9020;&#x51FA;&#x6765;&#x7684;&#x4EF7;&#x503C;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x8D2B;&#x5BCC;&#x5DEE;&#x8DDD;&#x3002;</p>
<p><strong>&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x54C1;&#x5473;</strong>&#x4E00;&#x6587;&#x8BA9;&#x6211;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x4ED6;&#x89E3;&#x91CA;&#x4E86;&#x54C1;&#x5473;&#x56E0;&#x4EBA;&#x800C;&#x5F02;&#x7684;&#x8352;&#x8C2C;&#x6027;&#x3002;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;
&#x54C1;&#x5473;&#x624D;&#x80FD;&#x505A;&#x51FA;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x7B80;&#x5355;&#x3001;&#x4E0D;&#x8FC7;&#x65F6;&#x3001;&#x89E3;&#x51B3;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x3001;&#x6709;&#x8DA3;&#x5473;&#x6027;&#x7B49;&#x5404;&#x79CD;&#x7279;&#x6027;&#x3002;&#x8BB0;
&#x5F97;&#x8001;&#x5927;&#x8BF4;&#x54C1;&#x5473;&#x4E0A;&#x53BB;&#x4E86;&#x5C31;&#x5F88;&#x96BE;&#x4E0B;&#x7684;&#x6765;&#x3002;</p>
<p>&#x6700;&#x540E;&#x51E0;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x5173;&#x4E8E;<strong>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</strong>&#x7684;&#xFF0C;&#x4F5C;&#x8005;&#x6781;&#x5EA6;&#x63A8;&#x5D07;Lisp&#x8FD9;&#x7C7B;&#x7684;&#x9B54;&#x5E7B;&#x8BED;&#x8A00;&#xFF0C;&#x4ED6;&#x663E;&#x7136;&#x4E0D;&#x559C;&#x6B22;&#x9759;
&#x6001;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x4E0D;&#x559C;&#x6B22;&#x90A3;&#x4E9B;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x51FA;&#x9519;&#x800C;&#x505A;&#x7684;&#x591A;&#x4F59;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x4F5C;&#x8005;&#x770B;&#x6765;&#x628A;&#x7528;&#x6237;&#x5F53;&#x6210;&#x662F;&#x50BB;&#x74DC;&#x800C;&#x8BBE;
&#x8BA1;&#x7684;&#x4E1C;&#x897F;&#x5FC5;&#x7136;&#x4F1A;&#x88AB;&#x7528;&#x6237;&#x770B;&#x6210;&#x662F;&#x5F88;&#x50BB;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4F5C;&#x4E3A;&#x9ED1;&#x5BA2;&#x4ED6;&#x4E5F;&#x8BB8;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x6709;&#x7740;&#x4E30;&#x5BCC;&#x7684;&#x7ECF;&#x9A8C;
&#x548C;&#x9AD8;&#x8D85;&#x7684;&#x6280;&#x827A;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x7C7B;&#x7684;&#x9AD8;&#x624B;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x5C11;&#x6570;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x521D;&#x5B66;&#x8005;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x5E2E;&#x52A9;&#x6765;&#x89E3;&#x51B3;&#x5404;
&#x79CD;&#x9AD8;&#x624B;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5F31;&#x667A;&#x7684;BUG&#xFF0C;&#x6240;&#x4EE5;&#x4F5C;&#x8005;&#x6781;&#x5EA6;&#x63A8;&#x5D07;Lisp&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x5C0F;&#x83DC;&#x7684;&#x6211;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x8FD8;&#x4E0D;&#x4F1A;
&#x53BB;&#x4F7F;&#x7528;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x3002;</p>
<p><strong>&#x8BBE;&#x8BA1;&#x4E0E;&#x7814;&#x7A76;</strong>&#x975E;&#x5E38;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x4F7F;&#x7528;&#x539F;&#x578B;&#xFF0C;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5728;&#x5927;&#x91CF;&#x7684;&#x4E66;&#x7C4D;&#x5F53;&#x4E2D;&#x90FD;&#x6709;&#x63A8;&#x8350;&#xFF0C;
&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<h1 id="geng-duo-de-nei-rong">&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x53EA;&#x662F;&#x4F5C;&#x8005;&#x6587;&#x7AE0;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6587;&#x7AE0;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#x4E2D;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x5982;
&#x679C;&#x82F1;&#x8BED;&#x591F;&#x597D;&#x53EF;&#x4EE5;&#x770B;&#x770B;<a href="http://paulgraham.com/articles.html" target="_blank" rel="external">PAUL GRAHAM</a>&#x3002;</p>
<p>&#x53E6;&#x5916;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7FFB;&#x8BD1;&#x8D28;&#x91CF;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#xFF0C;&#x8BD1;&#x8005;&#x962E;&#x4E00;&#x5CF0;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x540D;&#x7684;&#x535A;&#x4E3B;&#xFF0C;&#x5982;&#x679C;&#x611F;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x770B;
&#x770B;&#x4ED6;&#x7684;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x2014;&#x2014;<a href="http://www.ruanyifeng.com/blog/" target="_blank" rel="external">&#x962E;&#x4E00;&#x5CF0;&#x7684;&#x7F51;&#x7EDC;&#x65E5;&#x5FD7;</a></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/17/cpp-design-evolution-note/" rel="next" title="读书札记之 —— 《C++ 语言的设计和演化》">
                <i class="fa fa-chevron-left"></i> 读书札记之 —— 《C++ 语言的设计和演化》
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/02/24/poly-and-inher/" rel="prev" title="C++ 多态性继承和非多态性继承的区别">
                C++ 多态性继承和非多态性继承的区别 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="郭荣飞" />
          <p class="site-author-name" itemprop="name">郭荣飞</p>
          <p class="site-description motion-element" itemprop="description">记录成长路上的点点滴滴</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">78</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">21</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#wo-xue-dao-liao-shi-me"><span class="nav-number">1.</span> <span class="nav-text">我学到了什么</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#geng-duo-de-nei-rong"><span class="nav-number">2.</span> <span class="nav-text">更多的内容</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">郭荣飞</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
